'use strict';

define(function(require, exports, module) {

    module.exports = [
        {
          "text": "北京",
          "id": 3317,
          "c": [
            {
              "text": "北京市",
              "id": 1,
              "c": [
                {
                  "text": "东城区",
                  "id": 2
                },
                {
                  "text": "西城区",
                  "id": 3
                },
                {
                  "text": "朝阳区",
                  "id": 4
                },
                {
                  "text": "丰台区",
                  "id": 5
                },
                {
                  "text": "石景山区",
                  "id": 6
                },
                {
                  "text": "海淀区",
                  "id": 7
                },
                {
                  "text": "门头沟区",
                  "id": 8
                },
                {
                  "text": "房山区",
                  "id": 9
                },
                {
                  "text": "通州区",
                  "id": 10
                },
                {
                  "text": "顺义区",
                  "id": 11
                },
                {
                  "text": "昌平区",
                  "id": 12
                },
                {
                  "text": "大兴区",
                  "id": 13
                },
                {
                  "text": "怀柔区",
                  "id": 14
                },
                {
                  "text": "平谷区",
                  "id": 15
                },
                {
                  "text": "密云县",
                  "id": 16
                },
                {
                  "text": "延庆县",
                  "id": 17
                }
              ]
            }
          ]
        },
        {
          "text": "天津",
          "id": 3319,
          "c": [
            {
              "text": "天津市",
              "id": 18,
              "c": [
                {
                  "text": "和平区",
                  "id": 19
                },
                {
                  "text": "河东区",
                  "id": 20
                },
                {
                  "text": "河西区",
                  "id": 21
                },
                {
                  "text": "南开区",
                  "id": 22
                },
                {
                  "text": "河北区",
                  "id": 23
                },
                {
                  "text": "红桥区",
                  "id": 24
                },
                {
                  "text": "东丽区",
                  "id": 25
                },
                {
                  "text": "西青区",
                  "id": 26
                },
                {
                  "text": "津南区",
                  "id": 27
                },
                {
                  "text": "北辰区",
                  "id": 28
                },
                {
                  "text": "武清区",
                  "id": 29
                },
                {
                  "text": "宝坻区",
                  "id": 30
                },
                {
                  "text": "滨海新区",
                  "id": 31
                },
                {
                  "text": "宁河县",
                  "id": 32
                },
                {
                  "text": "静海县",
                  "id": 33
                },
                {
                  "text": "蓟县",
                  "id": 34
                }
              ]
            }
          ]
        },
        {
          "text": "河北省",
          "id": 35,
          "c": [
            {
              "text": "石家庄市",
              "id": 36,
              "c": [
                {
                  "text": "长安区",
                  "id": 37
                },
                {
                  "text": "桥东区",
                  "id": 38
                },
                {
                  "text": "桥西区",
                  "id": 39
                },
                {
                  "text": "新华区",
                  "id": 40
                },
                {
                  "text": "井陉矿区",
                  "id": 41
                },
                {
                  "text": "裕华区",
                  "id": 42
                },
                {
                  "text": "井陉县",
                  "id": 43
                },
                {
                  "text": "正定县",
                  "id": 44
                },
                {
                  "text": "栾城县",
                  "id": 45
                },
                {
                  "text": "行唐县",
                  "id": 46
                },
                {
                  "text": "灵寿县",
                  "id": 47
                },
                {
                  "text": "高邑县",
                  "id": 48
                },
                {
                  "text": "深泽县",
                  "id": 49
                },
                {
                  "text": "赞皇县",
                  "id": 50
                },
                {
                  "text": "无极县",
                  "id": 51
                },
                {
                  "text": "平山县",
                  "id": 52
                },
                {
                  "text": "元氏县",
                  "id": 53
                },
                {
                  "text": "赵县",
                  "id": 54
                },
                {
                  "text": "辛集市",
                  "id": 55
                },
                {
                  "text": "藁城市",
                  "id": 56
                },
                {
                  "text": "晋州市",
                  "id": 57
                },
                {
                  "text": "新乐市",
                  "id": 58
                },
                {
                  "text": "鹿泉市",
                  "id": 59
                }
              ]
            },
            {
              "text": "唐山市",
              "id": 60,
              "c": [
                {
                  "text": "路南区",
                  "id": 61
                },
                {
                  "text": "路北区",
                  "id": 62
                },
                {
                  "text": "古冶区",
                  "id": 63
                },
                {
                  "text": "开平区",
                  "id": 64
                },
                {
                  "text": "丰南区",
                  "id": 65
                },
                {
                  "text": "丰润区",
                  "id": 66
                },
                {
                  "text": "曹妃甸区",
                  "id": 67
                },
                {
                  "text": "滦县",
                  "id": 68
                },
                {
                  "text": "滦南县",
                  "id": 69
                },
                {
                  "text": "乐亭县",
                  "id": 70
                },
                {
                  "text": "迁西县",
                  "id": 71
                },
                {
                  "text": "玉田县",
                  "id": 72
                },
                {
                  "text": "遵化市",
                  "id": 73
                },
                {
                  "text": "迁安市",
                  "id": 74
                }
              ]
            },
            {
              "text": "秦皇岛市",
              "id": 75,
              "c": [
                {
                  "text": "海港区",
                  "id": 76
                },
                {
                  "text": "山海关区",
                  "id": 77
                },
                {
                  "text": "北戴河区",
                  "id": 78
                },
                {
                  "text": "青龙满族自治县",
                  "id": 79
                },
                {
                  "text": "昌黎县",
                  "id": 80
                },
                {
                  "text": "抚宁县",
                  "id": 81
                },
                {
                  "text": "卢龙县",
                  "id": 82
                }
              ]
            },
            {
              "text": "邯郸市",
              "id": 83,
              "c": [
                {
                  "text": "邯山区",
                  "id": 84
                },
                {
                  "text": "丛台区",
                  "id": 85
                },
                {
                  "text": "复兴区",
                  "id": 86
                },
                {
                  "text": "峰峰矿区",
                  "id": 87
                },
                {
                  "text": "邯郸县",
                  "id": 88
                },
                {
                  "text": "临漳县",
                  "id": 89
                },
                {
                  "text": "成安县",
                  "id": 90
                },
                {
                  "text": "大名县",
                  "id": 91
                },
                {
                  "text": "涉县",
                  "id": 92
                },
                {
                  "text": "磁县",
                  "id": 93
                },
                {
                  "text": "肥乡县",
                  "id": 94
                },
                {
                  "text": "永年县",
                  "id": 95
                },
                {
                  "text": "邱县",
                  "id": 96
                },
                {
                  "text": "鸡泽县",
                  "id": 97
                },
                {
                  "text": "广平县",
                  "id": 98
                },
                {
                  "text": "馆陶县",
                  "id": 99
                },
                {
                  "text": "魏县",
                  "id": 100
                },
                {
                  "text": "曲周县",
                  "id": 101
                },
                {
                  "text": "武安市",
                  "id": 102
                }
              ]
            },
            {
              "text": "邢台市",
              "id": 103,
              "c": [
                {
                  "text": "桥东区",
                  "id": 104
                },
                {
                  "text": "桥西区",
                  "id": 105
                },
                {
                  "text": "邢台县",
                  "id": 106
                },
                {
                  "text": "临城县",
                  "id": 107
                },
                {
                  "text": "内丘县",
                  "id": 108
                },
                {
                  "text": "柏乡县",
                  "id": 109
                },
                {
                  "text": "隆尧县",
                  "id": 110
                },
                {
                  "text": "任县",
                  "id": 111
                },
                {
                  "text": "南和县",
                  "id": 112
                },
                {
                  "text": "宁晋县",
                  "id": 113
                },
                {
                  "text": "巨鹿县",
                  "id": 114
                },
                {
                  "text": "新河县",
                  "id": 115
                },
                {
                  "text": "广宗县",
                  "id": 116
                },
                {
                  "text": "平乡县",
                  "id": 117
                },
                {
                  "text": "威县",
                  "id": 118
                },
                {
                  "text": "清河县",
                  "id": 119
                },
                {
                  "text": "临西县",
                  "id": 120
                },
                {
                  "text": "南宫市",
                  "id": 121
                },
                {
                  "text": "沙河市",
                  "id": 122
                }
              ]
            },
            {
              "text": "保定市",
              "id": 123,
              "c": [
                {
                  "text": "新市区",
                  "id": 124
                },
                {
                  "text": "北市区",
                  "id": 125
                },
                {
                  "text": "南市区",
                  "id": 126
                },
                {
                  "text": "满城县",
                  "id": 127
                },
                {
                  "text": "清苑县",
                  "id": 128
                },
                {
                  "text": "涞水县",
                  "id": 129
                },
                {
                  "text": "阜平县",
                  "id": 130
                },
                {
                  "text": "徐水县",
                  "id": 131
                },
                {
                  "text": "定兴县",
                  "id": 132
                },
                {
                  "text": "唐县",
                  "id": 133
                },
                {
                  "text": "高阳县",
                  "id": 134
                },
                {
                  "text": "容城县",
                  "id": 135
                },
                {
                  "text": "涞源县",
                  "id": 136
                },
                {
                  "text": "望都县",
                  "id": 137
                },
                {
                  "text": "安新县",
                  "id": 138
                },
                {
                  "text": "易县",
                  "id": 139
                },
                {
                  "text": "曲阳县",
                  "id": 140
                },
                {
                  "text": "蠡县",
                  "id": 141
                },
                {
                  "text": "顺平县",
                  "id": 142
                },
                {
                  "text": "博野县",
                  "id": 143
                },
                {
                  "text": "雄县",
                  "id": 144
                },
                {
                  "text": "涿州市",
                  "id": 145
                },
                {
                  "text": "定州市",
                  "id": 146
                },
                {
                  "text": "安国市",
                  "id": 147
                },
                {
                  "text": "高碑店市",
                  "id": 148
                }
              ]
            },
            {
              "text": "张家口市",
              "id": 149,
              "c": [
                {
                  "text": "桥东区",
                  "id": 150
                },
                {
                  "text": "桥西区",
                  "id": 151
                },
                {
                  "text": "宣化区",
                  "id": 152
                },
                {
                  "text": "下花园区",
                  "id": 153
                },
                {
                  "text": "宣化县",
                  "id": 154
                },
                {
                  "text": "张北县",
                  "id": 155
                },
                {
                  "text": "康保县",
                  "id": 156
                },
                {
                  "text": "沽源县",
                  "id": 157
                },
                {
                  "text": "尚义县",
                  "id": 158
                },
                {
                  "text": "蔚县",
                  "id": 159
                },
                {
                  "text": "阳原县",
                  "id": 160
                },
                {
                  "text": "怀安县",
                  "id": 161
                },
                {
                  "text": "万全县",
                  "id": 162
                },
                {
                  "text": "怀来县",
                  "id": 163
                },
                {
                  "text": "涿鹿县",
                  "id": 164
                },
                {
                  "text": "赤城县",
                  "id": 165
                },
                {
                  "text": "崇礼县",
                  "id": 166
                }
              ]
            },
            {
              "text": "承德市",
              "id": 167,
              "c": [
                {
                  "text": "双桥区",
                  "id": 168
                },
                {
                  "text": "双滦区",
                  "id": 169
                },
                {
                  "text": "鹰手营子矿区",
                  "id": 170
                },
                {
                  "text": "承德县",
                  "id": 171
                },
                {
                  "text": "兴隆县",
                  "id": 172
                },
                {
                  "text": "平泉县",
                  "id": 173
                },
                {
                  "text": "滦平县",
                  "id": 174
                },
                {
                  "text": "隆化县",
                  "id": 175
                },
                {
                  "text": "丰宁满族自治县",
                  "id": 176
                },
                {
                  "text": "宽城满族自治县",
                  "id": 177
                },
                {
                  "text": "围场满族蒙古族自治县",
                  "id": 178
                }
              ]
            },
            {
              "text": "沧州市",
              "id": 179,
              "c": [
                {
                  "text": "新华区",
                  "id": 180
                },
                {
                  "text": "运河区",
                  "id": 181
                },
                {
                  "text": "沧县",
                  "id": 182
                },
                {
                  "text": "青县",
                  "id": 183
                },
                {
                  "text": "东光县",
                  "id": 184
                },
                {
                  "text": "海兴县",
                  "id": 185
                },
                {
                  "text": "盐山县",
                  "id": 186
                },
                {
                  "text": "肃宁县",
                  "id": 187
                },
                {
                  "text": "南皮县",
                  "id": 188
                },
                {
                  "text": "吴桥县",
                  "id": 189
                },
                {
                  "text": "献县",
                  "id": 190
                },
                {
                  "text": "孟村回族自治县",
                  "id": 191
                },
                {
                  "text": "泊头市",
                  "id": 192
                },
                {
                  "text": "任丘市",
                  "id": 193
                },
                {
                  "text": "黄骅市",
                  "id": 194
                },
                {
                  "text": "河间市",
                  "id": 195
                }
              ]
            },
            {
              "text": "廊坊市",
              "id": 196,
              "c": [
                {
                  "text": "安次区",
                  "id": 197
                },
                {
                  "text": "广阳区",
                  "id": 198
                },
                {
                  "text": "固安县",
                  "id": 199
                },
                {
                  "text": "永清县",
                  "id": 200
                },
                {
                  "text": "香河县",
                  "id": 201
                },
                {
                  "text": "大城县",
                  "id": 202
                },
                {
                  "text": "文安县",
                  "id": 203
                },
                {
                  "text": "大厂回族自治县",
                  "id": 204
                },
                {
                  "text": "霸州市",
                  "id": 205
                },
                {
                  "text": "三河市",
                  "id": 206
                }
              ]
            },
            {
              "text": "衡水市",
              "id": 207,
              "c": [
                {
                  "text": "桃城区",
                  "id": 208
                },
                {
                  "text": "枣强县",
                  "id": 209
                },
                {
                  "text": "武邑县",
                  "id": 210
                },
                {
                  "text": "武强县",
                  "id": 211
                },
                {
                  "text": "饶阳县",
                  "id": 212
                },
                {
                  "text": "安平县",
                  "id": 213
                },
                {
                  "text": "故城县",
                  "id": 214
                },
                {
                  "text": "景县",
                  "id": 215
                },
                {
                  "text": "阜城县",
                  "id": 216
                },
                {
                  "text": "冀州市",
                  "id": 217
                },
                {
                  "text": "深州市",
                  "id": 218
                }
              ]
            }
          ]
        },
        {
          "text": "山西省",
          "id": 219,
          "c": [
            {
              "text": "太原市",
              "id": 220,
              "c": [
                {
                  "text": "小店区",
                  "id": 221
                },
                {
                  "text": "迎泽区",
                  "id": 222
                },
                {
                  "text": "杏花岭区",
                  "id": 223
                },
                {
                  "text": "尖草坪区",
                  "id": 224
                },
                {
                  "text": "万柏林区",
                  "id": 225
                },
                {
                  "text": "晋源区",
                  "id": 226
                },
                {
                  "text": "清徐县",
                  "id": 227
                },
                {
                  "text": "阳曲县",
                  "id": 228
                },
                {
                  "text": "娄烦县",
                  "id": 229
                },
                {
                  "text": "古交市",
                  "id": 230
                }
              ]
            },
            {
              "text": "大同市",
              "id": 231,
              "c": [
                {
                  "text": "城区",
                  "id": 232
                },
                {
                  "text": "矿区",
                  "id": 233
                },
                {
                  "text": "南郊区",
                  "id": 234
                },
                {
                  "text": "新荣区",
                  "id": 235
                },
                {
                  "text": "阳高县",
                  "id": 236
                },
                {
                  "text": "天镇县",
                  "id": 237
                },
                {
                  "text": "广灵县",
                  "id": 238
                },
                {
                  "text": "灵丘县",
                  "id": 239
                },
                {
                  "text": "浑源县",
                  "id": 240
                },
                {
                  "text": "左云县",
                  "id": 241
                },
                {
                  "text": "大同县",
                  "id": 242
                }
              ]
            },
            {
              "text": "阳泉市",
              "id": 243,
              "c": [
                {
                  "text": "城区",
                  "id": 244
                },
                {
                  "text": "矿区",
                  "id": 245
                },
                {
                  "text": "郊区",
                  "id": 246
                },
                {
                  "text": "平定县",
                  "id": 247
                },
                {
                  "text": "盂县",
                  "id": 248
                }
              ]
            },
            {
              "text": "长治市",
              "id": 249,
              "c": [
                {
                  "text": "城区",
                  "id": 250
                },
                {
                  "text": "郊区",
                  "id": 251
                },
                {
                  "text": "长治县",
                  "id": 252
                },
                {
                  "text": "襄垣县",
                  "id": 253
                },
                {
                  "text": "屯留县",
                  "id": 254
                },
                {
                  "text": "平顺县",
                  "id": 255
                },
                {
                  "text": "黎城县",
                  "id": 256
                },
                {
                  "text": "壶关县",
                  "id": 257
                },
                {
                  "text": "长子县",
                  "id": 258
                },
                {
                  "text": "武乡县",
                  "id": 259
                },
                {
                  "text": "沁县",
                  "id": 260
                },
                {
                  "text": "沁源县",
                  "id": 261
                },
                {
                  "text": "潞城市",
                  "id": 262
                }
              ]
            },
            {
              "text": "晋城市",
              "id": 263,
              "c": [
                {
                  "text": "晋城市市辖区",
                  "id": 264
                },
                {
                  "text": "城区",
                  "id": 265
                },
                {
                  "text": "沁水县",
                  "id": 266
                },
                {
                  "text": "阳城县",
                  "id": 267
                },
                {
                  "text": "陵川县",
                  "id": 268
                },
                {
                  "text": "泽州县",
                  "id": 269
                },
                {
                  "text": "高平市",
                  "id": 270
                }
              ]
            },
            {
              "text": "朔州市",
              "id": 271,
              "c": [
                {
                  "text": "朔城区",
                  "id": 272
                },
                {
                  "text": "平鲁区",
                  "id": 273
                },
                {
                  "text": "山阴县",
                  "id": 274
                },
                {
                  "text": "应县",
                  "id": 275
                },
                {
                  "text": "右玉县",
                  "id": 276
                },
                {
                  "text": "怀仁县",
                  "id": 277
                }
              ]
            },
            {
              "text": "晋中市",
              "id": 278,
              "c": [
                {
                  "text": "榆次区",
                  "id": 279
                },
                {
                  "text": "榆社县",
                  "id": 280
                },
                {
                  "text": "左权县",
                  "id": 281
                },
                {
                  "text": "和顺县",
                  "id": 282
                },
                {
                  "text": "昔阳县",
                  "id": 283
                },
                {
                  "text": "寿阳县",
                  "id": 284
                },
                {
                  "text": "太谷县",
                  "id": 285
                },
                {
                  "text": "祁县",
                  "id": 286
                },
                {
                  "text": "平遥县",
                  "id": 287
                },
                {
                  "text": "灵石县",
                  "id": 288
                },
                {
                  "text": "介休市",
                  "id": 289
                }
              ]
            },
            {
              "text": "运城市",
              "id": 290,
              "c": [
                {
                  "text": "盐湖区",
                  "id": 291
                },
                {
                  "text": "临猗县",
                  "id": 292
                },
                {
                  "text": "万荣县",
                  "id": 293
                },
                {
                  "text": "闻喜县",
                  "id": 294
                },
                {
                  "text": "稷山县",
                  "id": 295
                },
                {
                  "text": "新绛县",
                  "id": 296
                },
                {
                  "text": "绛县",
                  "id": 297
                },
                {
                  "text": "垣曲县",
                  "id": 298
                },
                {
                  "text": "夏县",
                  "id": 299
                },
                {
                  "text": "平陆县",
                  "id": 300
                },
                {
                  "text": "芮城县",
                  "id": 301
                },
                {
                  "text": "永济市",
                  "id": 302
                },
                {
                  "text": "河津市",
                  "id": 303
                }
              ]
            },
            {
              "text": "忻州市",
              "id": 304,
              "c": [
                {
                  "text": "忻府区",
                  "id": 305
                },
                {
                  "text": "定襄县",
                  "id": 306
                },
                {
                  "text": "五台县",
                  "id": 307
                },
                {
                  "text": "代县",
                  "id": 308
                },
                {
                  "text": "繁峙县",
                  "id": 309
                },
                {
                  "text": "宁武县",
                  "id": 310
                },
                {
                  "text": "静乐县",
                  "id": 311
                },
                {
                  "text": "神池县",
                  "id": 312
                },
                {
                  "text": "五寨县",
                  "id": 313
                },
                {
                  "text": "岢岚县",
                  "id": 314
                },
                {
                  "text": "河曲县",
                  "id": 315
                },
                {
                  "text": "保德县",
                  "id": 316
                },
                {
                  "text": "偏关县",
                  "id": 317
                },
                {
                  "text": "原平市",
                  "id": 318
                }
              ]
            },
            {
              "text": "临汾市",
              "id": 319,
              "c": [
                {
                  "text": "尧都区",
                  "id": 320
                },
                {
                  "text": "曲沃县",
                  "id": 321
                },
                {
                  "text": "翼城县",
                  "id": 322
                },
                {
                  "text": "襄汾县",
                  "id": 323
                },
                {
                  "text": "洪洞县",
                  "id": 324
                },
                {
                  "text": "古县",
                  "id": 325
                },
                {
                  "text": "安泽县",
                  "id": 326
                },
                {
                  "text": "浮山县",
                  "id": 327
                },
                {
                  "text": "吉县",
                  "id": 328
                },
                {
                  "text": "乡宁县",
                  "id": 329
                },
                {
                  "text": "大宁县",
                  "id": 330
                },
                {
                  "text": "隰县",
                  "id": 331
                },
                {
                  "text": "永和县",
                  "id": 332
                },
                {
                  "text": "蒲县",
                  "id": 333
                },
                {
                  "text": "汾西县",
                  "id": 334
                },
                {
                  "text": "侯马市",
                  "id": 335
                },
                {
                  "text": "霍州市",
                  "id": 336
                }
              ]
            },
            {
              "text": "吕梁市",
              "id": 337,
              "c": [
                {
                  "text": "离石区",
                  "id": 338
                },
                {
                  "text": "文水县",
                  "id": 339
                },
                {
                  "text": "交城县",
                  "id": 340
                },
                {
                  "text": "兴县",
                  "id": 341
                },
                {
                  "text": "临县",
                  "id": 342
                },
                {
                  "text": "柳林县",
                  "id": 343
                },
                {
                  "text": "石楼县",
                  "id": 344
                },
                {
                  "text": "岚县",
                  "id": 345
                },
                {
                  "text": "方山县",
                  "id": 346
                },
                {
                  "text": "中阳县",
                  "id": 347
                },
                {
                  "text": "交口县",
                  "id": 348
                },
                {
                  "text": "孝义市",
                  "id": 349
                },
                {
                  "text": "汾阳市",
                  "id": 350
                }
              ]
            }
          ]
        },
        {
          "text": "内蒙古自治区",
          "id": 351,
          "c": [
            {
              "text": "呼和浩特市",
              "id": 352,
              "c": [
                {
                  "text": "新城区",
                  "id": 353
                },
                {
                  "text": "回民区",
                  "id": 354
                },
                {
                  "text": "玉泉区",
                  "id": 355
                },
                {
                  "text": "赛罕区",
                  "id": 356
                },
                {
                  "text": "土默特左旗",
                  "id": 357
                },
                {
                  "text": "托克托县",
                  "id": 358
                },
                {
                  "text": "和林格尔县",
                  "id": 359
                },
                {
                  "text": "清水河县",
                  "id": 360
                },
                {
                  "text": "武川县",
                  "id": 361
                }
              ]
            },
            {
              "text": "包头市",
              "id": 362,
              "c": [
                {
                  "text": "东河区",
                  "id": 363
                },
                {
                  "text": "昆都仑区",
                  "id": 364
                },
                {
                  "text": "青山区",
                  "id": 365
                },
                {
                  "text": "石拐区",
                  "id": 366
                },
                {
                  "text": "白云鄂博矿区",
                  "id": 367
                },
                {
                  "text": "九原区",
                  "id": 368
                },
                {
                  "text": "土默特右旗",
                  "id": 369
                },
                {
                  "text": "固阳县",
                  "id": 370
                },
                {
                  "text": "达尔罕茂明安联合旗",
                  "id": 371
                }
              ]
            },
            {
              "text": "乌海市",
              "id": 372,
              "c": [
                {
                  "text": "海勃湾区",
                  "id": 373
                },
                {
                  "text": "海南区",
                  "id": 374
                },
                {
                  "text": "乌达区",
                  "id": 375
                }
              ]
            },
            {
              "text": "赤峰市",
              "id": 376,
              "c": [
                {
                  "text": "红山区",
                  "id": 377
                },
                {
                  "text": "元宝山区",
                  "id": 378
                },
                {
                  "text": "松山区",
                  "id": 379
                },
                {
                  "text": "阿鲁科尔沁旗",
                  "id": 380
                },
                {
                  "text": "巴林左旗",
                  "id": 381
                },
                {
                  "text": "巴林右旗",
                  "id": 382
                },
                {
                  "text": "林西县",
                  "id": 383
                },
                {
                  "text": "克什克腾旗",
                  "id": 384
                },
                {
                  "text": "翁牛特旗",
                  "id": 385
                },
                {
                  "text": "喀喇沁旗",
                  "id": 386
                },
                {
                  "text": "宁城县",
                  "id": 387
                },
                {
                  "text": "敖汉旗",
                  "id": 388
                }
              ]
            },
            {
              "text": "通辽市",
              "id": 389,
              "c": [
                {
                  "text": "科尔沁区",
                  "id": 390
                },
                {
                  "text": "科尔沁左翼中旗",
                  "id": 391
                },
                {
                  "text": "科尔沁左翼后旗",
                  "id": 392
                },
                {
                  "text": "开鲁县",
                  "id": 393
                },
                {
                  "text": "库伦旗",
                  "id": 394
                },
                {
                  "text": "奈曼旗",
                  "id": 395
                },
                {
                  "text": "扎鲁特旗",
                  "id": 396
                },
                {
                  "text": "霍林郭勒市",
                  "id": 397
                }
              ]
            },
            {
              "text": "鄂尔多斯市",
              "id": 398,
              "c": [
                {
                  "text": "东胜区",
                  "id": 399
                },
                {
                  "text": "达拉特旗",
                  "id": 400
                },
                {
                  "text": "准格尔旗",
                  "id": 401
                },
                {
                  "text": "鄂托克前旗",
                  "id": 402
                },
                {
                  "text": "鄂托克旗",
                  "id": 403
                },
                {
                  "text": "杭锦旗",
                  "id": 404
                },
                {
                  "text": "乌审旗",
                  "id": 405
                },
                {
                  "text": "伊金霍洛旗",
                  "id": 406
                }
              ]
            },
            {
              "text": "呼伦贝尔市",
              "id": 407,
              "c": [
                {
                  "text": "海拉尔区",
                  "id": 408
                },
                {
                  "text": "阿荣旗",
                  "id": 409
                },
                {
                  "text": "莫力达瓦达斡尔族自治旗",
                  "id": 410
                },
                {
                  "text": "鄂伦春自治旗",
                  "id": 411
                },
                {
                  "text": "鄂温克族自治旗",
                  "id": 412
                },
                {
                  "text": "陈巴尔虎旗",
                  "id": 413
                },
                {
                  "text": "新巴尔虎左旗",
                  "id": 414
                },
                {
                  "text": "新巴尔虎右旗",
                  "id": 415
                },
                {
                  "text": "满洲里市",
                  "id": 416
                },
                {
                  "text": "牙克石市",
                  "id": 417
                },
                {
                  "text": "扎兰屯市",
                  "id": 418
                },
                {
                  "text": "额尔古纳市",
                  "id": 419
                },
                {
                  "text": "根河市",
                  "id": 420
                }
              ]
            },
            {
              "text": "巴彦淖尔市",
              "id": 421,
              "c": [
                {
                  "text": "临河区",
                  "id": 422
                },
                {
                  "text": "五原县",
                  "id": 423
                },
                {
                  "text": "磴口县",
                  "id": 424
                },
                {
                  "text": "乌拉特前旗",
                  "id": 425
                },
                {
                  "text": "乌拉特中旗",
                  "id": 426
                },
                {
                  "text": "乌拉特后旗",
                  "id": 427
                },
                {
                  "text": "杭锦后旗",
                  "id": 428
                }
              ]
            },
            {
              "text": "乌兰察布市",
              "id": 429,
              "c": [
                {
                  "text": "集宁区",
                  "id": 430
                },
                {
                  "text": "卓资县",
                  "id": 431
                },
                {
                  "text": "化德县",
                  "id": 432
                },
                {
                  "text": "商都县",
                  "id": 433
                },
                {
                  "text": "兴和县",
                  "id": 434
                },
                {
                  "text": "凉城县",
                  "id": 435
                },
                {
                  "text": "察哈尔右翼前旗",
                  "id": 436
                },
                {
                  "text": "察哈尔右翼中旗",
                  "id": 437
                },
                {
                  "text": "察哈尔右翼后旗",
                  "id": 438
                },
                {
                  "text": "四子王旗",
                  "id": 439
                },
                {
                  "text": "丰镇市",
                  "id": 440
                }
              ]
            },
            {
              "text": "兴安盟",
              "id": 441,
              "c": [
                {
                  "text": "乌兰浩特市",
                  "id": 442
                },
                {
                  "text": "阿尔山市",
                  "id": 443
                },
                {
                  "text": "科尔沁右翼前旗",
                  "id": 444
                },
                {
                  "text": "科尔沁右翼中旗",
                  "id": 445
                },
                {
                  "text": "扎赉特旗",
                  "id": 446
                },
                {
                  "text": "突泉县",
                  "id": 447
                }
              ]
            },
            {
              "text": "锡林郭勒盟",
              "id": 448,
              "c": [
                {
                  "text": "二连浩特市",
                  "id": 449
                },
                {
                  "text": "锡林浩特市",
                  "id": 450
                },
                {
                  "text": "阿巴嘎旗",
                  "id": 451
                },
                {
                  "text": "苏尼特左旗",
                  "id": 452
                },
                {
                  "text": "苏尼特右旗",
                  "id": 453
                },
                {
                  "text": "东乌珠穆沁旗",
                  "id": 454
                },
                {
                  "text": "西乌珠穆沁旗",
                  "id": 455
                },
                {
                  "text": "太仆寺旗",
                  "id": 456
                },
                {
                  "text": "镶黄旗",
                  "id": 457
                },
                {
                  "text": "正镶白旗",
                  "id": 458
                },
                {
                  "text": "正蓝旗",
                  "id": 459
                },
                {
                  "text": "多伦县",
                  "id": 460
                }
              ]
            },
            {
              "text": "阿拉善盟",
              "id": 461,
              "c": [
                {
                  "text": "阿拉善左旗",
                  "id": 462
                },
                {
                  "text": "阿拉善右旗",
                  "id": 463
                },
                {
                  "text": "额济纳旗",
                  "id": 464
                }
              ]
            }
          ]
        },
        {
          "text": "辽宁省",
          "id": 465,
          "c": [
            {
              "text": "沈阳市",
              "id": 466,
              "c": [
                {
                  "text": "和平区",
                  "id": 467
                },
                {
                  "text": "沈河区",
                  "id": 468
                },
                {
                  "text": "大东区",
                  "id": 469
                },
                {
                  "text": "皇姑区",
                  "id": 470
                },
                {
                  "text": "铁西区",
                  "id": 471
                },
                {
                  "text": "苏家屯区",
                  "id": 472
                },
                {
                  "text": "东陵区",
                  "id": 473
                },
                {
                  "text": "沈北新区",
                  "id": 474
                },
                {
                  "text": "于洪区",
                  "id": 475
                },
                {
                  "text": "辽中县",
                  "id": 476
                },
                {
                  "text": "康平县",
                  "id": 477
                },
                {
                  "text": "法库县",
                  "id": 478
                },
                {
                  "text": "新民市",
                  "id": 479
                }
              ]
            },
            {
              "text": "大连市",
              "id": 480,
              "c": [
                {
                  "text": "中山区",
                  "id": 481
                },
                {
                  "text": "西岗区",
                  "id": 482
                },
                {
                  "text": "沙河口区",
                  "id": 483
                },
                {
                  "text": "甘井子区",
                  "id": 484
                },
                {
                  "text": "旅顺口区",
                  "id": 485
                },
                {
                  "text": "金州区",
                  "id": 486
                },
                {
                  "text": "长海县",
                  "id": 487
                },
                {
                  "text": "瓦房店市",
                  "id": 488
                },
                {
                  "text": "普兰店市",
                  "id": 489
                },
                {
                  "text": "庄河市",
                  "id": 490
                }
              ]
            },
            {
              "text": "鞍山市",
              "id": 491,
              "c": [
                {
                  "text": "铁东区",
                  "id": 492
                },
                {
                  "text": "铁西区",
                  "id": 493
                },
                {
                  "text": "立山区",
                  "id": 494
                },
                {
                  "text": "千山区",
                  "id": 495
                },
                {
                  "text": "台安县",
                  "id": 496
                },
                {
                  "text": "岫岩满族自治县",
                  "id": 497
                },
                {
                  "text": "海城市",
                  "id": 498
                }
              ]
            },
            {
              "text": "抚顺市",
              "id": 499,
              "c": [
                {
                  "text": "新抚区",
                  "id": 500
                },
                {
                  "text": "东洲区",
                  "id": 501
                },
                {
                  "text": "望花区",
                  "id": 502
                },
                {
                  "text": "顺城区",
                  "id": 503
                },
                {
                  "text": "抚顺县",
                  "id": 504
                },
                {
                  "text": "新宾满族自治县",
                  "id": 505
                },
                {
                  "text": "清原满族自治县",
                  "id": 506
                }
              ]
            },
            {
              "text": "本溪市",
              "id": 507,
              "c": [
                {
                  "text": "平山区",
                  "id": 508
                },
                {
                  "text": "溪湖区",
                  "id": 509
                },
                {
                  "text": "明山区",
                  "id": 510
                },
                {
                  "text": "南芬区",
                  "id": 511
                },
                {
                  "text": "本溪满族自治县",
                  "id": 512
                },
                {
                  "text": "桓仁满族自治县",
                  "id": 513
                }
              ]
            },
            {
              "text": "丹东市",
              "id": 514,
              "c": [
                {
                  "text": "元宝区",
                  "id": 515
                },
                {
                  "text": "振兴区",
                  "id": 516
                },
                {
                  "text": "振安区",
                  "id": 517
                },
                {
                  "text": "宽甸满族自治县",
                  "id": 518
                },
                {
                  "text": "东港市",
                  "id": 519
                },
                {
                  "text": "凤城市",
                  "id": 520
                }
              ]
            },
            {
              "text": "锦州市",
              "id": 521,
              "c": [
                {
                  "text": "古塔区",
                  "id": 522
                },
                {
                  "text": "凌河区",
                  "id": 523
                },
                {
                  "text": "太和区",
                  "id": 524
                },
                {
                  "text": "黑山县",
                  "id": 525
                },
                {
                  "text": "义县",
                  "id": 526
                },
                {
                  "text": "凌海市",
                  "id": 527
                },
                {
                  "text": "北镇市",
                  "id": 528
                }
              ]
            },
            {
              "text": "营口市",
              "id": 529,
              "c": [
                {
                  "text": "站前区",
                  "id": 530
                },
                {
                  "text": "西市区",
                  "id": 531
                },
                {
                  "text": "鲅鱼圈区",
                  "id": 532
                },
                {
                  "text": "老边区",
                  "id": 533
                },
                {
                  "text": "盖州市",
                  "id": 534
                },
                {
                  "text": "大石桥市",
                  "id": 535
                }
              ]
            },
            {
              "text": "阜新市",
              "id": 536,
              "c": [
                {
                  "text": "海州区",
                  "id": 537
                },
                {
                  "text": "新邱区",
                  "id": 538
                },
                {
                  "text": "太平区",
                  "id": 539
                },
                {
                  "text": "清河门区",
                  "id": 540
                },
                {
                  "text": "细河区",
                  "id": 541
                },
                {
                  "text": "阜新蒙古族自治县",
                  "id": 542
                },
                {
                  "text": "彰武县",
                  "id": 543
                }
              ]
            },
            {
              "text": "辽阳市",
              "id": 544,
              "c": [
                {
                  "text": "白塔区",
                  "id": 545
                },
                {
                  "text": "文圣区",
                  "id": 546
                },
                {
                  "text": "宏伟区",
                  "id": 547
                },
                {
                  "text": "弓长岭区",
                  "id": 548
                },
                {
                  "text": "太子河区",
                  "id": 549
                },
                {
                  "text": "辽阳县",
                  "id": 550
                },
                {
                  "text": "灯塔市",
                  "id": 551
                }
              ]
            },
            {
              "text": "盘锦市",
              "id": 552,
              "c": [
                {
                  "text": "双台子区",
                  "id": 553
                },
                {
                  "text": "兴隆台区",
                  "id": 554
                },
                {
                  "text": "大洼县",
                  "id": 555
                },
                {
                  "text": "盘山县",
                  "id": 556
                }
              ]
            },
            {
              "text": "铁岭市",
              "id": 557,
              "c": [
                {
                  "text": "银州区",
                  "id": 558
                },
                {
                  "text": "清河区",
                  "id": 559
                },
                {
                  "text": "铁岭县",
                  "id": 560
                },
                {
                  "text": "西丰县",
                  "id": 561
                },
                {
                  "text": "昌图县",
                  "id": 562
                },
                {
                  "text": "调兵山市",
                  "id": 563
                },
                {
                  "text": "开原市",
                  "id": 564
                }
              ]
            },
            {
              "text": "朝阳市",
              "id": 565,
              "c": [
                {
                  "text": "双塔区",
                  "id": 566
                },
                {
                  "text": "龙城区",
                  "id": 567
                },
                {
                  "text": "朝阳县",
                  "id": 568
                },
                {
                  "text": "建平县",
                  "id": 569
                },
                {
                  "text": "喀喇沁左翼蒙古族自治县",
                  "id": 570
                },
                {
                  "text": "北票市",
                  "id": 571
                },
                {
                  "text": "凌源市",
                  "id": 572
                }
              ]
            },
            {
              "text": "葫芦岛市",
              "id": 573,
              "c": [
                {
                  "text": "连山区",
                  "id": 574
                },
                {
                  "text": "龙港区",
                  "id": 575
                },
                {
                  "text": "南票区",
                  "id": 576
                },
                {
                  "text": "绥中县",
                  "id": 577
                },
                {
                  "text": "建昌县",
                  "id": 578
                },
                {
                  "text": "兴城市",
                  "id": 579
                }
              ]
            }
          ]
        },
        {
          "text": "吉林省",
          "id": 580,
          "c": [
            {
              "text": "长春市",
              "id": 581,
              "c": [
                {
                  "text": "南关区",
                  "id": 582
                },
                {
                  "text": "宽城区",
                  "id": 583
                },
                {
                  "text": "朝阳区",
                  "id": 584
                },
                {
                  "text": "二道区",
                  "id": 585
                },
                {
                  "text": "绿园区",
                  "id": 586
                },
                {
                  "text": "双阳区",
                  "id": 587
                },
                {
                  "text": "农安县",
                  "id": 588
                },
                {
                  "text": "九台市",
                  "id": 589
                },
                {
                  "text": "榆树市",
                  "id": 590
                },
                {
                  "text": "德惠市",
                  "id": 591
                }
              ]
            },
            {
              "text": "吉林市",
              "id": 592,
              "c": [
                {
                  "text": "昌邑区",
                  "id": 593
                },
                {
                  "text": "龙潭区",
                  "id": 594
                },
                {
                  "text": "船营区",
                  "id": 595
                },
                {
                  "text": "丰满区",
                  "id": 596
                },
                {
                  "text": "永吉县",
                  "id": 597
                },
                {
                  "text": "蛟河市",
                  "id": 598
                },
                {
                  "text": "桦甸市",
                  "id": 599
                },
                {
                  "text": "舒兰市",
                  "id": 600
                },
                {
                  "text": "磐石市",
                  "id": 601
                }
              ]
            },
            {
              "text": "四平市",
              "id": 602,
              "c": [
                {
                  "text": "铁西区",
                  "id": 603
                },
                {
                  "text": "铁东区",
                  "id": 604
                },
                {
                  "text": "梨树县",
                  "id": 605
                },
                {
                  "text": "伊通满族自治县",
                  "id": 606
                },
                {
                  "text": "公主岭市",
                  "id": 607
                },
                {
                  "text": "双辽市",
                  "id": 608
                }
              ]
            },
            {
              "text": "辽源市",
              "id": 609,
              "c": [
                {
                  "text": "龙山区",
                  "id": 610
                },
                {
                  "text": "西安区",
                  "id": 611
                },
                {
                  "text": "东丰县",
                  "id": 612
                },
                {
                  "text": "东辽县",
                  "id": 613
                }
              ]
            },
            {
              "text": "通化市",
              "id": 614,
              "c": [
                {
                  "text": "东昌区",
                  "id": 615
                },
                {
                  "text": "二道江区",
                  "id": 616
                },
                {
                  "text": "通化县",
                  "id": 617
                },
                {
                  "text": "辉南县",
                  "id": 618
                },
                {
                  "text": "柳河县",
                  "id": 619
                },
                {
                  "text": "梅河口市",
                  "id": 620
                },
                {
                  "text": "集安市",
                  "id": 621
                }
              ]
            },
            {
              "text": "白山市",
              "id": 622,
              "c": [
                {
                  "text": "浑江区",
                  "id": 623
                },
                {
                  "text": "江源区",
                  "id": 624
                },
                {
                  "text": "抚松县",
                  "id": 625
                },
                {
                  "text": "靖宇县",
                  "id": 626
                },
                {
                  "text": "长白朝鲜族自治县",
                  "id": 627
                },
                {
                  "text": "临江市",
                  "id": 628
                }
              ]
            },
            {
              "text": "松原市",
              "id": 629,
              "c": [
                {
                  "text": "宁江区",
                  "id": 630
                },
                {
                  "text": "前郭尔罗斯蒙古族自治县",
                  "id": 631
                },
                {
                  "text": "长岭县",
                  "id": 632
                },
                {
                  "text": "乾安县",
                  "id": 633
                },
                {
                  "text": "扶余县",
                  "id": 634
                }
              ]
            },
            {
              "text": "白城市",
              "id": 635,
              "c": [
                {
                  "text": "洮北区",
                  "id": 636
                },
                {
                  "text": "镇赉县",
                  "id": 637
                },
                {
                  "text": "通榆县",
                  "id": 638
                },
                {
                  "text": "洮南市",
                  "id": 639
                },
                {
                  "text": "大安市",
                  "id": 640
                }
              ]
            },
            {
              "text": "延边朝鲜族自治州",
              "id": 641,
              "c": [
                {
                  "text": "延吉市",
                  "id": 642
                },
                {
                  "text": "图们市",
                  "id": 643
                },
                {
                  "text": "敦化市",
                  "id": 644
                },
                {
                  "text": "珲春市",
                  "id": 645
                },
                {
                  "text": "龙井市",
                  "id": 646
                },
                {
                  "text": "和龙市",
                  "id": 647
                },
                {
                  "text": "汪清县",
                  "id": 648
                },
                {
                  "text": "安图县",
                  "id": 649
                }
              ]
            }
          ]
        },
        {
          "text": "黑龙江省",
          "id": 650,
          "c": [
            {
              "text": "哈尔滨市",
              "id": 651,
              "c": [
                {
                  "text": "道里区",
                  "id": 652
                },
                {
                  "text": "南岗区",
                  "id": 653
                },
                {
                  "text": "道外区",
                  "id": 654
                },
                {
                  "text": "平房区",
                  "id": 655
                },
                {
                  "text": "松北区",
                  "id": 656
                },
                {
                  "text": "香坊区",
                  "id": 657
                },
                {
                  "text": "呼兰区",
                  "id": 658
                },
                {
                  "text": "阿城区",
                  "id": 659
                },
                {
                  "text": "依兰县",
                  "id": 660
                },
                {
                  "text": "方正县",
                  "id": 661
                },
                {
                  "text": "宾县",
                  "id": 662
                },
                {
                  "text": "巴彦县",
                  "id": 663
                },
                {
                  "text": "木兰县",
                  "id": 664
                },
                {
                  "text": "通河县",
                  "id": 665
                },
                {
                  "text": "延寿县",
                  "id": 666
                },
                {
                  "text": "双城市",
                  "id": 667
                },
                {
                  "text": "尚志市",
                  "id": 668
                },
                {
                  "text": "五常市",
                  "id": 669
                }
              ]
            },
            {
              "text": "齐齐哈尔市",
              "id": 670,
              "c": [
                {
                  "text": "龙沙区",
                  "id": 671
                },
                {
                  "text": "建华区",
                  "id": 672
                },
                {
                  "text": "铁锋区",
                  "id": 673
                },
                {
                  "text": "昂昂溪区",
                  "id": 674
                },
                {
                  "text": "富拉尔基区",
                  "id": 675
                },
                {
                  "text": "碾子山区",
                  "id": 676
                },
                {
                  "text": "梅里斯达斡尔族区",
                  "id": 677
                },
                {
                  "text": "龙江县",
                  "id": 678
                },
                {
                  "text": "依安县",
                  "id": 679
                },
                {
                  "text": "泰来县",
                  "id": 680
                },
                {
                  "text": "甘南县",
                  "id": 681
                },
                {
                  "text": "富裕县",
                  "id": 682
                },
                {
                  "text": "克山县",
                  "id": 683
                },
                {
                  "text": "克东县",
                  "id": 684
                },
                {
                  "text": "拜泉县",
                  "id": 685
                },
                {
                  "text": "讷河市",
                  "id": 686
                }
              ]
            },
            {
              "text": "鸡西市",
              "id": 687,
              "c": [
                {
                  "text": "鸡冠区",
                  "id": 688
                },
                {
                  "text": "恒山区",
                  "id": 689
                },
                {
                  "text": "滴道区",
                  "id": 690
                },
                {
                  "text": "梨树区",
                  "id": 691
                },
                {
                  "text": "城子河区",
                  "id": 692
                },
                {
                  "text": "麻山区",
                  "id": 693
                },
                {
                  "text": "鸡东县",
                  "id": 694
                },
                {
                  "text": "虎林市",
                  "id": 695
                },
                {
                  "text": "密山市",
                  "id": 696
                }
              ]
            },
            {
              "text": "鹤岗市",
              "id": 697,
              "c": [
                {
                  "text": "向阳区",
                  "id": 698
                },
                {
                  "text": "工农区",
                  "id": 699
                },
                {
                  "text": "南山区",
                  "id": 700
                },
                {
                  "text": "兴安区",
                  "id": 701
                },
                {
                  "text": "东山区",
                  "id": 702
                },
                {
                  "text": "兴山区",
                  "id": 703
                },
                {
                  "text": "萝北县",
                  "id": 704
                },
                {
                  "text": "绥滨县",
                  "id": 705
                }
              ]
            },
            {
              "text": "双鸭山市",
              "id": 706,
              "c": [
                {
                  "text": "尖山区",
                  "id": 707
                },
                {
                  "text": "岭东区",
                  "id": 708
                },
                {
                  "text": "四方台区",
                  "id": 709
                },
                {
                  "text": "宝山区",
                  "id": 710
                },
                {
                  "text": "集贤县",
                  "id": 711
                },
                {
                  "text": "友谊县",
                  "id": 712
                },
                {
                  "text": "宝清县",
                  "id": 713
                },
                {
                  "text": "饶河县",
                  "id": 714
                }
              ]
            },
            {
              "text": "大庆市",
              "id": 715,
              "c": [
                {
                  "text": "萨尔图区",
                  "id": 716
                },
                {
                  "text": "龙凤区",
                  "id": 717
                },
                {
                  "text": "让胡路区",
                  "id": 718
                },
                {
                  "text": "红岗区",
                  "id": 719
                },
                {
                  "text": "大同区",
                  "id": 720
                },
                {
                  "text": "肇州县",
                  "id": 721
                },
                {
                  "text": "肇源县",
                  "id": 722
                },
                {
                  "text": "林甸县",
                  "id": 723
                },
                {
                  "text": "杜尔伯特蒙古族自治县",
                  "id": 724
                }
              ]
            },
            {
              "text": "伊春市",
              "id": 725,
              "c": [
                {
                  "text": "伊春区",
                  "id": 726
                },
                {
                  "text": "南岔区",
                  "id": 727
                },
                {
                  "text": "友好区",
                  "id": 728
                },
                {
                  "text": "西林区",
                  "id": 729
                },
                {
                  "text": "翠峦区",
                  "id": 730
                },
                {
                  "text": "新青区",
                  "id": 731
                },
                {
                  "text": "美溪区",
                  "id": 732
                },
                {
                  "text": "金山屯区",
                  "id": 733
                },
                {
                  "text": "五营区",
                  "id": 734
                },
                {
                  "text": "乌马河区",
                  "id": 735
                },
                {
                  "text": "汤旺河区",
                  "id": 736
                },
                {
                  "text": "带岭区",
                  "id": 737
                },
                {
                  "text": "乌伊岭区",
                  "id": 738
                },
                {
                  "text": "红星区",
                  "id": 739
                },
                {
                  "text": "上甘岭区",
                  "id": 740
                },
                {
                  "text": "嘉荫县",
                  "id": 741
                },
                {
                  "text": "铁力市",
                  "id": 742
                }
              ]
            },
            {
              "text": "佳木斯市",
              "id": 743,
              "c": [
                {
                  "text": "向阳区",
                  "id": 744
                },
                {
                  "text": "前进区",
                  "id": 745
                },
                {
                  "text": "东风区",
                  "id": 746
                },
                {
                  "text": "郊区",
                  "id": 747
                },
                {
                  "text": "桦南县",
                  "id": 748
                },
                {
                  "text": "桦川县",
                  "id": 749
                },
                {
                  "text": "汤原县",
                  "id": 750
                },
                {
                  "text": "抚远县",
                  "id": 751
                },
                {
                  "text": "同江市",
                  "id": 752
                },
                {
                  "text": "富锦市",
                  "id": 753
                }
              ]
            },
            {
              "text": "七台河市",
              "id": 754,
              "c": [
                {
                  "text": "新兴区",
                  "id": 755
                },
                {
                  "text": "桃山区",
                  "id": 756
                },
                {
                  "text": "茄子河区",
                  "id": 757
                },
                {
                  "text": "勃利县",
                  "id": 758
                }
              ]
            },
            {
              "text": "牡丹江市",
              "id": 759,
              "c": [
                {
                  "text": "东安区",
                  "id": 760
                },
                {
                  "text": "阳明区",
                  "id": 761
                },
                {
                  "text": "爱民区",
                  "id": 762
                },
                {
                  "text": "西安区",
                  "id": 763
                },
                {
                  "text": "东宁县",
                  "id": 764
                },
                {
                  "text": "林口县",
                  "id": 765
                },
                {
                  "text": "绥芬河市",
                  "id": 766
                },
                {
                  "text": "海林市",
                  "id": 767
                },
                {
                  "text": "宁安市",
                  "id": 768
                },
                {
                  "text": "穆棱市",
                  "id": 769
                }
              ]
            },
            {
              "text": "黑河市",
              "id": 770,
              "c": [
                {
                  "text": "爱辉区",
                  "id": 771
                },
                {
                  "text": "嫩江县",
                  "id": 772
                },
                {
                  "text": "逊克县",
                  "id": 773
                },
                {
                  "text": "孙吴县",
                  "id": 774
                },
                {
                  "text": "北安市",
                  "id": 775
                },
                {
                  "text": "五大连池市",
                  "id": 776
                }
              ]
            },
            {
              "text": "绥化市",
              "id": 777,
              "c": [
                {
                  "text": "北林区",
                  "id": 778
                },
                {
                  "text": "望奎县",
                  "id": 779
                },
                {
                  "text": "兰西县",
                  "id": 780
                },
                {
                  "text": "青冈县",
                  "id": 781
                },
                {
                  "text": "庆安县",
                  "id": 782
                },
                {
                  "text": "明水县",
                  "id": 783
                },
                {
                  "text": "绥棱县",
                  "id": 784
                },
                {
                  "text": "安达市",
                  "id": 785
                },
                {
                  "text": "肇东市",
                  "id": 786
                },
                {
                  "text": "海伦市",
                  "id": 787
                }
              ]
            },
            {
              "text": "大兴安岭地区",
              "id": 788,
              "c": [
                {
                  "text": "呼玛县",
                  "id": 789
                },
                {
                  "text": "塔河县",
                  "id": 790
                },
                {
                  "text": "漠河县",
                  "id": 791
                }
              ]
            }
          ]
        },
        {
          "text": "上海",
          "id": 3318,
          "c": [
            {
              "text": "上海市",
              "id": 792,
              "c": [
                {
                  "text": "松江区",
                  "id": 806
                },
                {
                  "text": "青浦区",
                  "id": 807
                },
                {
                  "text": "嘉定区",
                  "id": 803
                },
                {
                  "text": "浦东新区",
                  "id": 804
                },
                {
                  "text": "闵行区",
                  "id": 801
                },
                {
                  "text": "宝山区",
                  "id": 802
                },
                {
                  "text": "奉贤区",
                  "id": 808
                },
                {
                  "text": "黄浦区",
                  "id": 793
                },
                {
                  "text": "徐汇区",
                  "id": 794
                },
                {
                  "text": "长宁区",
                  "id": 795
                },
                {
                  "text": "静安区",
                  "id": 796
                },
                {
                  "text": "普陀区",
                  "id": 797
                },
                {
                  "text": "闸北区",
                  "id": 798
                },
                {
                  "text": "虹口区",
                  "id": 799
                },
                {
                  "text": "杨浦区",
                  "id": 800
                },
                {
                  "text": "金山区",
                  "id": 805
                },
                {
                  "text": "崇明县",
                  "id": 809
                }
              ]
            }
          ]
        },
        {
          "text": "江苏省",
          "id": 810,
          "c": [
            {
              "text": "南京市",
              "id": 811,
              "c": [
                {
                  "text": "玄武区",
                  "id": 812
                },
                {
                  "text": "白下区",
                  "id": 813
                },
                {
                  "text": "秦淮区",
                  "id": 814
                },
                {
                  "text": "建邺区",
                  "id": 815
                },
                {
                  "text": "鼓楼区",
                  "id": 816
                },
                {
                  "text": "下关区",
                  "id": 817
                },
                {
                  "text": "浦口区",
                  "id": 818
                },
                {
                  "text": "栖霞区",
                  "id": 819
                },
                {
                  "text": "雨花台区",
                  "id": 820
                },
                {
                  "text": "江宁区",
                  "id": 821
                },
                {
                  "text": "六合区",
                  "id": 822
                },
                {
                  "text": "溧水县",
                  "id": 823
                },
                {
                  "text": "高淳县",
                  "id": 824
                }
              ]
            },
            {
              "text": "无锡市",
              "id": 825,
              "c": [
                {
                  "text": "崇安区",
                  "id": 826
                },
                {
                  "text": "南长区",
                  "id": 827
                },
                {
                  "text": "北塘区",
                  "id": 828
                },
                {
                  "text": "锡山区",
                  "id": 829
                },
                {
                  "text": "惠山区",
                  "id": 830
                },
                {
                  "text": "滨湖区",
                  "id": 831
                },
                {
                  "text": "江阴市",
                  "id": 832
                },
                {
                  "text": "宜兴市",
                  "id": 833
                }
              ]
            },
            {
              "text": "徐州市",
              "id": 834,
              "c": [
                {
                  "text": "鼓楼区",
                  "id": 835
                },
                {
                  "text": "云龙区",
                  "id": 836
                },
                {
                  "text": "贾汪区",
                  "id": 837
                },
                {
                  "text": "泉山区",
                  "id": 838
                },
                {
                  "text": "铜山区",
                  "id": 839
                },
                {
                  "text": "丰县",
                  "id": 840
                },
                {
                  "text": "沛县",
                  "id": 841
                },
                {
                  "text": "睢宁县",
                  "id": 842
                },
                {
                  "text": "新沂市",
                  "id": 843
                },
                {
                  "text": "邳州市",
                  "id": 844
                }
              ]
            },
            {
              "text": "常州市",
              "id": 845,
              "c": [
                {
                  "text": "天宁区",
                  "id": 846
                },
                {
                  "text": "钟楼区",
                  "id": 847
                },
                {
                  "text": "戚墅堰区",
                  "id": 848
                },
                {
                  "text": "新北区",
                  "id": 849
                },
                {
                  "text": "武进区",
                  "id": 850
                },
                {
                  "text": "溧阳市",
                  "id": 851
                },
                {
                  "text": "金坛市",
                  "id": 852
                }
              ]
            },
            {
              "text": "苏州市",
              "id": 853,
              "c": [
                {
                  "text": "虎丘区",
                  "id": 854
                },
                {
                  "text": "吴中区",
                  "id": 855
                },
                {
                  "text": "相城区",
                  "id": 856
                },
                {
                  "text": "姑苏区",
                  "id": 857
                },
                {
                  "text": "吴江区",
                  "id": 858
                },
                {
                  "text": "常熟市",
                  "id": 859
                },
                {
                  "text": "张家港市",
                  "id": 860
                },
                {
                  "text": "昆山市",
                  "id": 861
                },
                {
                  "text": "太仓市",
                  "id": 862
                },
                {
                  "text": "金阊区",
                  "id": 3321
                }
              ]
            },
            {
              "text": "南通市",
              "id": 863,
              "c": [
                {
                  "text": "崇川区",
                  "id": 864
                },
                {
                  "text": "港闸区",
                  "id": 865
                },
                {
                  "text": "通州区",
                  "id": 866
                },
                {
                  "text": "海安县",
                  "id": 867
                },
                {
                  "text": "如东县",
                  "id": 868
                },
                {
                  "text": "启东市",
                  "id": 869
                },
                {
                  "text": "如皋市",
                  "id": 870
                },
                {
                  "text": "海门市",
                  "id": 871
                }
              ]
            },
            {
              "text": "连云港市",
              "id": 872,
              "c": [
                {
                  "text": "连云区",
                  "id": 873
                },
                {
                  "text": "新浦区",
                  "id": 874
                },
                {
                  "text": "海州区",
                  "id": 875
                },
                {
                  "text": "赣榆县",
                  "id": 876
                },
                {
                  "text": "东海县",
                  "id": 877
                },
                {
                  "text": "灌云县",
                  "id": 878
                },
                {
                  "text": "灌南县",
                  "id": 879
                }
              ]
            },
            {
              "text": "淮安市",
              "id": 880,
              "c": [
                {
                  "text": "清河区",
                  "id": 881
                },
                {
                  "text": "淮安区",
                  "id": 882
                },
                {
                  "text": "淮阴区",
                  "id": 883
                },
                {
                  "text": "清浦区",
                  "id": 884
                },
                {
                  "text": "涟水县",
                  "id": 885
                },
                {
                  "text": "洪泽县",
                  "id": 886
                },
                {
                  "text": "盱眙县",
                  "id": 887
                },
                {
                  "text": "金湖县",
                  "id": 888
                }
              ]
            },
            {
              "text": "盐城市",
              "id": 889,
              "c": [
                {
                  "text": "亭湖区",
                  "id": 890
                },
                {
                  "text": "盐都区",
                  "id": 891
                },
                {
                  "text": "响水县",
                  "id": 892
                },
                {
                  "text": "滨海县",
                  "id": 893
                },
                {
                  "text": "阜宁县",
                  "id": 894
                },
                {
                  "text": "射阳县",
                  "id": 895
                },
                {
                  "text": "建湖县",
                  "id": 896
                },
                {
                  "text": "东台市",
                  "id": 897
                },
                {
                  "text": "大丰市",
                  "id": 898
                }
              ]
            },
            {
              "text": "扬州市",
              "id": 899,
              "c": [
                {
                  "text": "广陵区",
                  "id": 900
                },
                {
                  "text": "邗江区",
                  "id": 901
                },
                {
                  "text": "江都区",
                  "id": 902
                },
                {
                  "text": "宝应县",
                  "id": 903
                },
                {
                  "text": "仪征市",
                  "id": 904
                },
                {
                  "text": "高邮市",
                  "id": 905
                }
              ]
            },
            {
              "text": "镇江市",
              "id": 906,
              "c": [
                {
                  "text": "京口区",
                  "id": 907
                },
                {
                  "text": "润州区",
                  "id": 908
                },
                {
                  "text": "丹徒区",
                  "id": 909
                },
                {
                  "text": "丹阳市",
                  "id": 910
                },
                {
                  "text": "扬中市",
                  "id": 911
                },
                {
                  "text": "句容市",
                  "id": 912
                }
              ]
            },
            {
              "text": "泰州市",
              "id": 913,
              "c": [
                {
                  "text": "海陵区",
                  "id": 914
                },
                {
                  "text": "高港区",
                  "id": 915
                },
                {
                  "text": "兴化市",
                  "id": 916
                },
                {
                  "text": "靖江市",
                  "id": 917
                },
                {
                  "text": "泰兴市",
                  "id": 918
                },
                {
                  "text": "姜堰市",
                  "id": 919
                }
              ]
            },
            {
              "text": "宿迁市",
              "id": 920,
              "c": [
                {
                  "text": "宿城区",
                  "id": 921
                },
                {
                  "text": "宿豫区",
                  "id": 922
                },
                {
                  "text": "沭阳县",
                  "id": 923
                },
                {
                  "text": "泗阳县",
                  "id": 924
                },
                {
                  "text": "泗洪县",
                  "id": 925
                }
              ]
            }
          ]
        },
        {
          "text": "浙江省",
          "id": 926,
          "c": [
            {
              "text": "杭州市",
              "id": 927,
              "c": [
                {
                  "text": "上城区",
                  "id": 928
                },
                {
                  "text": "下城区",
                  "id": 929
                },
                {
                  "text": "江干区",
                  "id": 930
                },
                {
                  "text": "拱墅区",
                  "id": 931
                },
                {
                  "text": "西湖区",
                  "id": 932
                },
                {
                  "text": "滨江区",
                  "id": 933
                },
                {
                  "text": "萧山区",
                  "id": 934
                },
                {
                  "text": "余杭区",
                  "id": 935
                },
                {
                  "text": "桐庐县",
                  "id": 936
                },
                {
                  "text": "淳安县",
                  "id": 937
                },
                {
                  "text": "建德市",
                  "id": 938
                },
                {
                  "text": "富阳市",
                  "id": 939
                },
                {
                  "text": "临安市",
                  "id": 940
                }
              ]
            },
            {
              "text": "宁波市",
              "id": 941,
              "c": [
                {
                  "text": "海曙区",
                  "id": 942
                },
                {
                  "text": "江东区",
                  "id": 943
                },
                {
                  "text": "江北区",
                  "id": 944
                },
                {
                  "text": "北仑区",
                  "id": 945
                },
                {
                  "text": "镇海区",
                  "id": 946
                },
                {
                  "text": "鄞州区",
                  "id": 947
                },
                {
                  "text": "象山县",
                  "id": 948
                },
                {
                  "text": "宁海县",
                  "id": 949
                },
                {
                  "text": "余姚市",
                  "id": 950
                },
                {
                  "text": "慈溪市",
                  "id": 951
                },
                {
                  "text": "奉化市",
                  "id": 952
                }
              ]
            },
            {
              "text": "温州市",
              "id": 953,
              "c": [
                {
                  "text": "鹿城区",
                  "id": 954
                },
                {
                  "text": "龙湾区",
                  "id": 955
                },
                {
                  "text": "瓯海区",
                  "id": 956
                },
                {
                  "text": "洞头县",
                  "id": 957
                },
                {
                  "text": "永嘉县",
                  "id": 958
                },
                {
                  "text": "平阳县",
                  "id": 959
                },
                {
                  "text": "苍南县",
                  "id": 960
                },
                {
                  "text": "文成县",
                  "id": 961
                },
                {
                  "text": "泰顺县",
                  "id": 962
                },
                {
                  "text": "瑞安市",
                  "id": 963
                },
                {
                  "text": "乐清市",
                  "id": 964
                }
              ]
            },
            {
              "text": "嘉兴市",
              "id": 965,
              "c": [
                {
                  "text": "南湖区",
                  "id": 966
                },
                {
                  "text": "秀洲区",
                  "id": 967
                },
                {
                  "text": "嘉善县",
                  "id": 968
                },
                {
                  "text": "海盐县",
                  "id": 969
                },
                {
                  "text": "海宁市",
                  "id": 970
                },
                {
                  "text": "平湖市",
                  "id": 971
                },
                {
                  "text": "桐乡市",
                  "id": 972
                }
              ]
            },
            {
              "text": "湖州市",
              "id": 973,
              "c": [
                {
                  "text": "吴兴区",
                  "id": 974
                },
                {
                  "text": "南浔区",
                  "id": 975
                },
                {
                  "text": "德清县",
                  "id": 976
                },
                {
                  "text": "长兴县",
                  "id": 977
                },
                {
                  "text": "安吉县",
                  "id": 978
                }
              ]
            },
            {
              "text": "绍兴市",
              "id": 979,
              "c": [
                {
                  "text": "越城区",
                  "id": 980
                },
                {
                  "text": "绍兴县",
                  "id": 981
                },
                {
                  "text": "新昌县",
                  "id": 982
                },
                {
                  "text": "诸暨市",
                  "id": 983
                },
                {
                  "text": "上虞市",
                  "id": 984
                },
                {
                  "text": "嵊州市",
                  "id": 985
                }
              ]
            },
            {
              "text": "金华市",
              "id": 986,
              "c": [
                {
                  "text": "婺城区",
                  "id": 987
                },
                {
                  "text": "金东区",
                  "id": 988
                },
                {
                  "text": "武义县",
                  "id": 989
                },
                {
                  "text": "浦江县",
                  "id": 990
                },
                {
                  "text": "磐安县",
                  "id": 991
                },
                {
                  "text": "兰溪市",
                  "id": 992
                },
                {
                  "text": "义乌市",
                  "id": 993
                },
                {
                  "text": "东阳市",
                  "id": 994
                },
                {
                  "text": "永康市",
                  "id": 995
                }
              ]
            },
            {
              "text": "衢州市",
              "id": 996,
              "c": [
                {
                  "text": "柯城区",
                  "id": 997
                },
                {
                  "text": "衢江区",
                  "id": 998
                },
                {
                  "text": "常山县",
                  "id": 999
                },
                {
                  "text": "开化县",
                  "id": 1000
                },
                {
                  "text": "龙游县",
                  "id": 1001
                },
                {
                  "text": "江山市",
                  "id": 1002
                }
              ]
            },
            {
              "text": "舟山市",
              "id": 1003,
              "c": [
                {
                  "text": "定海区",
                  "id": 1004
                },
                {
                  "text": "普陀区",
                  "id": 1005
                },
                {
                  "text": "岱山县",
                  "id": 1006
                },
                {
                  "text": "嵊泗县",
                  "id": 1007
                }
              ]
            },
            {
              "text": "台州市",
              "id": 1008,
              "c": [
                {
                  "text": "椒江区",
                  "id": 1009
                },
                {
                  "text": "黄岩区",
                  "id": 1010
                },
                {
                  "text": "路桥区",
                  "id": 1011
                },
                {
                  "text": "玉环县",
                  "id": 1012
                },
                {
                  "text": "三门县",
                  "id": 1013
                },
                {
                  "text": "天台县",
                  "id": 1014
                },
                {
                  "text": "仙居县",
                  "id": 1015
                },
                {
                  "text": "温岭市",
                  "id": 1016
                },
                {
                  "text": "临海市",
                  "id": 1017
                }
              ]
            },
            {
              "text": "丽水市",
              "id": 1018,
              "c": [
                {
                  "text": "莲都区",
                  "id": 1019
                },
                {
                  "text": "青田县",
                  "id": 1020
                },
                {
                  "text": "缙云县",
                  "id": 1021
                },
                {
                  "text": "遂昌县",
                  "id": 1022
                },
                {
                  "text": "松阳县",
                  "id": 1023
                },
                {
                  "text": "云和县",
                  "id": 1024
                },
                {
                  "text": "庆元县",
                  "id": 1025
                },
                {
                  "text": "景宁畲族自治县",
                  "id": 1026
                },
                {
                  "text": "龙泉市",
                  "id": 1027
                }
              ]
            }
          ]
        },
        {
          "text": "安徽省",
          "id": 1028,
          "c": [
            {
              "text": "合肥市",
              "id": 1029,
              "c": [
                {
                  "text": "瑶海区",
                  "id": 1030
                },
                {
                  "text": "庐阳区",
                  "id": 1031
                },
                {
                  "text": "蜀山区",
                  "id": 1032
                },
                {
                  "text": "包河区",
                  "id": 1033
                },
                {
                  "text": "长丰县",
                  "id": 1034
                },
                {
                  "text": "肥东县",
                  "id": 1035
                },
                {
                  "text": "肥西县",
                  "id": 1036
                },
                {
                  "text": "庐江县",
                  "id": 1037
                },
                {
                  "text": "巢湖市",
                  "id": 1038
                }
              ]
            },
            {
              "text": "芜湖市",
              "id": 1039,
              "c": [
                {
                  "text": "镜湖区",
                  "id": 1040
                },
                {
                  "text": "弋江区",
                  "id": 1041
                },
                {
                  "text": "鸠江区",
                  "id": 1042
                },
                {
                  "text": "三山区",
                  "id": 1043
                },
                {
                  "text": "芜湖县",
                  "id": 1044
                },
                {
                  "text": "繁昌县",
                  "id": 1045
                },
                {
                  "text": "南陵县",
                  "id": 1046
                },
                {
                  "text": "无为县",
                  "id": 1047
                }
              ]
            },
            {
              "text": "蚌埠市",
              "id": 1048,
              "c": [
                {
                  "text": "龙子湖区",
                  "id": 1049
                },
                {
                  "text": "蚌山区",
                  "id": 1050
                },
                {
                  "text": "禹会区",
                  "id": 1051
                },
                {
                  "text": "淮上区",
                  "id": 1052
                },
                {
                  "text": "怀远县",
                  "id": 1053
                },
                {
                  "text": "五河县",
                  "id": 1054
                },
                {
                  "text": "固镇县",
                  "id": 1055
                }
              ]
            },
            {
              "text": "淮南市",
              "id": 1056,
              "c": [
                {
                  "text": "大通区",
                  "id": 1057
                },
                {
                  "text": "田家庵区",
                  "id": 1058
                },
                {
                  "text": "谢家集区",
                  "id": 1059
                },
                {
                  "text": "八公山区",
                  "id": 1060
                },
                {
                  "text": "潘集区",
                  "id": 1061
                },
                {
                  "text": "凤台县",
                  "id": 1062
                }
              ]
            },
            {
              "text": "马鞍山市",
              "id": 1063,
              "c": [
                {
                  "text": "花山区",
                  "id": 1064
                },
                {
                  "text": "雨山区",
                  "id": 1065
                },
                {
                  "text": "博望区",
                  "id": 1066
                },
                {
                  "text": "当涂县",
                  "id": 1067
                },
                {
                  "text": "含山县",
                  "id": 1068
                },
                {
                  "text": "和县",
                  "id": 1069
                }
              ]
            },
            {
              "text": "淮北市",
              "id": 1070,
              "c": [
                {
                  "text": "杜集区",
                  "id": 1071
                },
                {
                  "text": "相山区",
                  "id": 1072
                },
                {
                  "text": "烈山区",
                  "id": 1073
                },
                {
                  "text": "濉溪县",
                  "id": 1074
                }
              ]
            },
            {
              "text": "铜陵市",
              "id": 1075,
              "c": [
                {
                  "text": "铜官山区",
                  "id": 1076
                },
                {
                  "text": "狮子山区",
                  "id": 1077
                },
                {
                  "text": "郊区",
                  "id": 1078
                },
                {
                  "text": "铜陵县",
                  "id": 1079
                }
              ]
            },
            {
              "text": "安庆市",
              "id": 1080,
              "c": [
                {
                  "text": "迎江区",
                  "id": 1081
                },
                {
                  "text": "大观区",
                  "id": 1082
                },
                {
                  "text": "宜秀区",
                  "id": 1083
                },
                {
                  "text": "怀宁县",
                  "id": 1084
                },
                {
                  "text": "枞阳县",
                  "id": 1085
                },
                {
                  "text": "潜山县",
                  "id": 1086
                },
                {
                  "text": "太湖县",
                  "id": 1087
                },
                {
                  "text": "宿松县",
                  "id": 1088
                },
                {
                  "text": "望江县",
                  "id": 1089
                },
                {
                  "text": "岳西县",
                  "id": 1090
                },
                {
                  "text": "桐城市",
                  "id": 1091
                }
              ]
            },
            {
              "text": "黄山市",
              "id": 1092,
              "c": [
                {
                  "text": "屯溪区",
                  "id": 1093
                },
                {
                  "text": "黄山区",
                  "id": 1094
                },
                {
                  "text": "徽州区",
                  "id": 1095
                },
                {
                  "text": "歙县",
                  "id": 1096
                },
                {
                  "text": "休宁县",
                  "id": 1097
                },
                {
                  "text": "黟县",
                  "id": 1098
                },
                {
                  "text": "祁门县",
                  "id": 1099
                }
              ]
            },
            {
              "text": "滁州市",
              "id": 1100,
              "c": [
                {
                  "text": "琅琊区",
                  "id": 1101
                },
                {
                  "text": "南谯区",
                  "id": 1102
                },
                {
                  "text": "来安县",
                  "id": 1103
                },
                {
                  "text": "全椒县",
                  "id": 1104
                },
                {
                  "text": "定远县",
                  "id": 1105
                },
                {
                  "text": "凤阳县",
                  "id": 1106
                },
                {
                  "text": "天长市",
                  "id": 1107
                },
                {
                  "text": "明光市",
                  "id": 1108
                }
              ]
            },
            {
              "text": "阜阳市",
              "id": 1109,
              "c": [
                {
                  "text": "颍州区",
                  "id": 1110
                },
                {
                  "text": "颍东区",
                  "id": 1111
                },
                {
                  "text": "颍泉区",
                  "id": 1112
                },
                {
                  "text": "临泉县",
                  "id": 1113
                },
                {
                  "text": "太和县",
                  "id": 1114
                },
                {
                  "text": "阜南县",
                  "id": 1115
                },
                {
                  "text": "颍上县",
                  "id": 1116
                },
                {
                  "text": "界首市",
                  "id": 1117
                }
              ]
            },
            {
              "text": "宿州市",
              "id": 1118,
              "c": [
                {
                  "text": "埇桥区",
                  "id": 1119
                },
                {
                  "text": "砀山县",
                  "id": 1120
                },
                {
                  "text": "萧县",
                  "id": 1121
                },
                {
                  "text": "灵璧县",
                  "id": 1122
                },
                {
                  "text": "泗县",
                  "id": 1123
                }
              ]
            },
            {
              "text": "六安市",
              "id": 1124,
              "c": [
                {
                  "text": "金安区",
                  "id": 1125
                },
                {
                  "text": "裕安区",
                  "id": 1126
                },
                {
                  "text": "寿县",
                  "id": 1127
                },
                {
                  "text": "霍邱县",
                  "id": 1128
                },
                {
                  "text": "舒城县",
                  "id": 1129
                },
                {
                  "text": "金寨县",
                  "id": 1130
                },
                {
                  "text": "霍山县",
                  "id": 1131
                }
              ]
            },
            {
              "text": "亳州市",
              "id": 1132,
              "c": [
                {
                  "text": "谯城区",
                  "id": 1133
                },
                {
                  "text": "涡阳县",
                  "id": 1134
                },
                {
                  "text": "蒙城县",
                  "id": 1135
                },
                {
                  "text": "利辛县",
                  "id": 1136
                }
              ]
            },
            {
              "text": "池州市",
              "id": 1137,
              "c": [
                {
                  "text": "贵池区",
                  "id": 1138
                },
                {
                  "text": "东至县",
                  "id": 1139
                },
                {
                  "text": "石台县",
                  "id": 1140
                },
                {
                  "text": "青阳县",
                  "id": 1141
                }
              ]
            },
            {
              "text": "宣城市",
              "id": 1142,
              "c": [
                {
                  "text": "宣州区",
                  "id": 1143
                },
                {
                  "text": "郎溪县",
                  "id": 1144
                },
                {
                  "text": "广德县",
                  "id": 1145
                },
                {
                  "text": "泾县",
                  "id": 1146
                },
                {
                  "text": "绩溪县",
                  "id": 1147
                },
                {
                  "text": "旌德县",
                  "id": 1148
                },
                {
                  "text": "宁国市",
                  "id": 1149
                }
              ]
            }
          ]
        },
        {
          "text": "福建省",
          "id": 1150,
          "c": [
            {
              "text": "福州市",
              "id": 1151,
              "c": [
                {
                  "text": "鼓楼区",
                  "id": 1152
                },
                {
                  "text": "台江区",
                  "id": 1153
                },
                {
                  "text": "仓山区",
                  "id": 1154
                },
                {
                  "text": "马尾区",
                  "id": 1155
                },
                {
                  "text": "晋安区",
                  "id": 1156
                },
                {
                  "text": "闽侯县",
                  "id": 1157
                },
                {
                  "text": "连江县",
                  "id": 1158
                },
                {
                  "text": "罗源县",
                  "id": 1159
                },
                {
                  "text": "闽清县",
                  "id": 1160
                },
                {
                  "text": "永泰县",
                  "id": 1161
                },
                {
                  "text": "平潭县",
                  "id": 1162
                },
                {
                  "text": "福清市",
                  "id": 1163
                },
                {
                  "text": "长乐市",
                  "id": 1164
                }
              ]
            },
            {
              "text": "厦门市",
              "id": 1165,
              "c": [
                {
                  "text": "思明区",
                  "id": 1166
                },
                {
                  "text": "海沧区",
                  "id": 1167
                },
                {
                  "text": "湖里区",
                  "id": 1168
                },
                {
                  "text": "集美区",
                  "id": 1169
                },
                {
                  "text": "同安区",
                  "id": 1170
                },
                {
                  "text": "翔安区",
                  "id": 1171
                }
              ]
            },
            {
              "text": "莆田市",
              "id": 1172,
              "c": [
                {
                  "text": "城厢区",
                  "id": 1173
                },
                {
                  "text": "涵江区",
                  "id": 1174
                },
                {
                  "text": "荔城区",
                  "id": 1175
                },
                {
                  "text": "秀屿区",
                  "id": 1176
                },
                {
                  "text": "仙游县",
                  "id": 1177
                }
              ]
            },
            {
              "text": "三明市",
              "id": 1178,
              "c": [
                {
                  "text": "梅列区",
                  "id": 1179
                },
                {
                  "text": "三元区",
                  "id": 1180
                },
                {
                  "text": "明溪县",
                  "id": 1181
                },
                {
                  "text": "清流县",
                  "id": 1182
                },
                {
                  "text": "宁化县",
                  "id": 1183
                },
                {
                  "text": "大田县",
                  "id": 1184
                },
                {
                  "text": "尤溪县",
                  "id": 1185
                },
                {
                  "text": "沙县",
                  "id": 1186
                },
                {
                  "text": "将乐县",
                  "id": 1187
                },
                {
                  "text": "泰宁县",
                  "id": 1188
                },
                {
                  "text": "建宁县",
                  "id": 1189
                },
                {
                  "text": "永安市",
                  "id": 1190
                }
              ]
            },
            {
              "text": "泉州市",
              "id": 1191,
              "c": [
                {
                  "text": "鲤城区",
                  "id": 1192
                },
                {
                  "text": "丰泽区",
                  "id": 1193
                },
                {
                  "text": "洛江区",
                  "id": 1194
                },
                {
                  "text": "泉港区",
                  "id": 1195
                },
                {
                  "text": "惠安县",
                  "id": 1196
                },
                {
                  "text": "安溪县",
                  "id": 1197
                },
                {
                  "text": "永春县",
                  "id": 1198
                },
                {
                  "text": "德化县",
                  "id": 1199
                },
                {
                  "text": "金门县",
                  "id": 1200
                },
                {
                  "text": "石狮市",
                  "id": 1201
                },
                {
                  "text": "晋江市",
                  "id": 1202
                },
                {
                  "text": "南安市",
                  "id": 1203
                }
              ]
            },
            {
              "text": "漳州市",
              "id": 1204,
              "c": [
                {
                  "text": "芗城区",
                  "id": 1205
                },
                {
                  "text": "龙文区",
                  "id": 1206
                },
                {
                  "text": "云霄县",
                  "id": 1207
                },
                {
                  "text": "漳浦县",
                  "id": 1208
                },
                {
                  "text": "诏安县",
                  "id": 1209
                },
                {
                  "text": "长泰县",
                  "id": 1210
                },
                {
                  "text": "东山县",
                  "id": 1211
                },
                {
                  "text": "南靖县",
                  "id": 1212
                },
                {
                  "text": "平和县",
                  "id": 1213
                },
                {
                  "text": "华安县",
                  "id": 1214
                },
                {
                  "text": "龙海市",
                  "id": 1215
                }
              ]
            },
            {
              "text": "南平市",
              "id": 1216,
              "c": [
                {
                  "text": "延平区",
                  "id": 1217
                },
                {
                  "text": "顺昌县",
                  "id": 1218
                },
                {
                  "text": "浦城县",
                  "id": 1219
                },
                {
                  "text": "光泽县",
                  "id": 1220
                },
                {
                  "text": "松溪县",
                  "id": 1221
                },
                {
                  "text": "政和县",
                  "id": 1222
                },
                {
                  "text": "邵武市",
                  "id": 1223
                },
                {
                  "text": "武夷山市",
                  "id": 1224
                },
                {
                  "text": "建瓯市",
                  "id": 1225
                },
                {
                  "text": "建阳市",
                  "id": 1226
                }
              ]
            },
            {
              "text": "龙岩市",
              "id": 1227,
              "c": [
                {
                  "text": "新罗区",
                  "id": 1228
                },
                {
                  "text": "长汀县",
                  "id": 1229
                },
                {
                  "text": "永定县",
                  "id": 1230
                },
                {
                  "text": "上杭县",
                  "id": 1231
                },
                {
                  "text": "武平县",
                  "id": 1232
                },
                {
                  "text": "连城县",
                  "id": 1233
                },
                {
                  "text": "漳平市",
                  "id": 1234
                }
              ]
            },
            {
              "text": "宁德市",
              "id": 1235,
              "c": [
                {
                  "text": "蕉城区",
                  "id": 1236
                },
                {
                  "text": "霞浦县",
                  "id": 1237
                },
                {
                  "text": "古田县",
                  "id": 1238
                },
                {
                  "text": "屏南县",
                  "id": 1239
                },
                {
                  "text": "寿宁县",
                  "id": 1240
                },
                {
                  "text": "周宁县",
                  "id": 1241
                },
                {
                  "text": "柘荣县",
                  "id": 1242
                },
                {
                  "text": "福安市",
                  "id": 1243
                },
                {
                  "text": "福鼎市",
                  "id": 1244
                }
              ]
            }
          ]
        },
        {
          "text": "江西省",
          "id": 1245,
          "c": [
            {
              "text": "南昌市",
              "id": 1246,
              "c": [
                {
                  "text": "东湖区",
                  "id": 1247
                },
                {
                  "text": "西湖区",
                  "id": 1248
                },
                {
                  "text": "青云谱区",
                  "id": 1249
                },
                {
                  "text": "湾里区",
                  "id": 1250
                },
                {
                  "text": "青山湖区",
                  "id": 1251
                },
                {
                  "text": "南昌县",
                  "id": 1252
                },
                {
                  "text": "新建县",
                  "id": 1253
                },
                {
                  "text": "安义县",
                  "id": 1254
                },
                {
                  "text": "进贤县",
                  "id": 1255
                }
              ]
            },
            {
              "text": "景德镇市",
              "id": 1256,
              "c": [
                {
                  "text": "昌江区",
                  "id": 1257
                },
                {
                  "text": "珠山区",
                  "id": 1258
                },
                {
                  "text": "浮梁县",
                  "id": 1259
                },
                {
                  "text": "乐平市",
                  "id": 1260
                }
              ]
            },
            {
              "text": "萍乡市",
              "id": 1261,
              "c": [
                {
                  "text": "安源区",
                  "id": 1262
                },
                {
                  "text": "湘东区",
                  "id": 1263
                },
                {
                  "text": "莲花县",
                  "id": 1264
                },
                {
                  "text": "上栗县",
                  "id": 1265
                },
                {
                  "text": "芦溪县",
                  "id": 1266
                }
              ]
            },
            {
              "text": "九江市",
              "id": 1267,
              "c": [
                {
                  "text": "庐山区",
                  "id": 1268
                },
                {
                  "text": "浔阳区",
                  "id": 1269
                },
                {
                  "text": "九江县",
                  "id": 1270
                },
                {
                  "text": "武宁县",
                  "id": 1271
                },
                {
                  "text": "修水县",
                  "id": 1272
                },
                {
                  "text": "永修县",
                  "id": 1273
                },
                {
                  "text": "德安县",
                  "id": 1274
                },
                {
                  "text": "星子县",
                  "id": 1275
                },
                {
                  "text": "都昌县",
                  "id": 1276
                },
                {
                  "text": "湖口县",
                  "id": 1277
                },
                {
                  "text": "彭泽县",
                  "id": 1278
                },
                {
                  "text": "瑞昌市",
                  "id": 1279
                },
                {
                  "text": "共青城市",
                  "id": 1280
                }
              ]
            },
            {
              "text": "新余市",
              "id": 1281,
              "c": [
                {
                  "text": "渝水区",
                  "id": 1282
                },
                {
                  "text": "分宜县",
                  "id": 1283
                }
              ]
            },
            {
              "text": "鹰潭市",
              "id": 1284,
              "c": [
                {
                  "text": "月湖区",
                  "id": 1285
                },
                {
                  "text": "余江县",
                  "id": 1286
                },
                {
                  "text": "贵溪市",
                  "id": 1287
                }
              ]
            },
            {
              "text": "赣州市",
              "id": 1288,
              "c": [
                {
                  "text": "章贡区",
                  "id": 1289
                },
                {
                  "text": "赣县",
                  "id": 1290
                },
                {
                  "text": "信丰县",
                  "id": 1291
                },
                {
                  "text": "大余县",
                  "id": 1292
                },
                {
                  "text": "上犹县",
                  "id": 1293
                },
                {
                  "text": "崇义县",
                  "id": 1294
                },
                {
                  "text": "安远县",
                  "id": 1295
                },
                {
                  "text": "龙南县",
                  "id": 1296
                },
                {
                  "text": "定南县",
                  "id": 1297
                },
                {
                  "text": "全南县",
                  "id": 1298
                },
                {
                  "text": "宁都县",
                  "id": 1299
                },
                {
                  "text": "于都县",
                  "id": 1300
                },
                {
                  "text": "兴国县",
                  "id": 1301
                },
                {
                  "text": "会昌县",
                  "id": 1302
                },
                {
                  "text": "寻乌县",
                  "id": 1303
                },
                {
                  "text": "石城县",
                  "id": 1304
                },
                {
                  "text": "瑞金市",
                  "id": 1305
                },
                {
                  "text": "南康市",
                  "id": 1306
                }
              ]
            },
            {
              "text": "吉安市",
              "id": 1307,
              "c": [
                {
                  "text": "吉州区",
                  "id": 1308
                },
                {
                  "text": "青原区",
                  "id": 1309
                },
                {
                  "text": "吉安县",
                  "id": 1310
                },
                {
                  "text": "吉水县",
                  "id": 1311
                },
                {
                  "text": "峡江县",
                  "id": 1312
                },
                {
                  "text": "新干县",
                  "id": 1313
                },
                {
                  "text": "永丰县",
                  "id": 1314
                },
                {
                  "text": "泰和县",
                  "id": 1315
                },
                {
                  "text": "遂川县",
                  "id": 1316
                },
                {
                  "text": "万安县",
                  "id": 1317
                },
                {
                  "text": "安福县",
                  "id": 1318
                },
                {
                  "text": "永新县",
                  "id": 1319
                },
                {
                  "text": "井冈山市",
                  "id": 1320
                }
              ]
            },
            {
              "text": "宜春市",
              "id": 1321,
              "c": [
                {
                  "text": "袁州区",
                  "id": 1322
                },
                {
                  "text": "奉新县",
                  "id": 1323
                },
                {
                  "text": "万载县",
                  "id": 1324
                },
                {
                  "text": "上高县",
                  "id": 1325
                },
                {
                  "text": "宜丰县",
                  "id": 1326
                },
                {
                  "text": "靖安县",
                  "id": 1327
                },
                {
                  "text": "铜鼓县",
                  "id": 1328
                },
                {
                  "text": "丰城市",
                  "id": 1329
                },
                {
                  "text": "樟树市",
                  "id": 1330
                },
                {
                  "text": "高安市",
                  "id": 1331
                }
              ]
            },
            {
              "text": "抚州市",
              "id": 1332,
              "c": [
                {
                  "text": "临川区",
                  "id": 1333
                },
                {
                  "text": "南城县",
                  "id": 1334
                },
                {
                  "text": "黎川县",
                  "id": 1335
                },
                {
                  "text": "南丰县",
                  "id": 1336
                },
                {
                  "text": "崇仁县",
                  "id": 1337
                },
                {
                  "text": "乐安县",
                  "id": 1338
                },
                {
                  "text": "宜黄县",
                  "id": 1339
                },
                {
                  "text": "金溪县",
                  "id": 1340
                },
                {
                  "text": "资溪县",
                  "id": 1341
                },
                {
                  "text": "东乡县",
                  "id": 1342
                },
                {
                  "text": "广昌县",
                  "id": 1343
                }
              ]
            },
            {
              "text": "上饶市",
              "id": 1344,
              "c": [
                {
                  "text": "信州区",
                  "id": 1345
                },
                {
                  "text": "上饶县",
                  "id": 1346
                },
                {
                  "text": "广丰县",
                  "id": 1347
                },
                {
                  "text": "玉山县",
                  "id": 1348
                },
                {
                  "text": "铅山县",
                  "id": 1349
                },
                {
                  "text": "横峰县",
                  "id": 1350
                },
                {
                  "text": "弋阳县",
                  "id": 1351
                },
                {
                  "text": "余干县",
                  "id": 1352
                },
                {
                  "text": "鄱阳县",
                  "id": 1353
                },
                {
                  "text": "万年县",
                  "id": 1354
                },
                {
                  "text": "婺源县",
                  "id": 1355
                },
                {
                  "text": "德兴市",
                  "id": 1356
                }
              ]
            }
          ]
        },
        {
          "text": "山东省",
          "id": 1357,
          "c": [
            {
              "text": "济南市",
              "id": 1358,
              "c": [
                {
                  "text": "历下区",
                  "id": 1359
                },
                {
                  "text": "市中区",
                  "id": 1360
                },
                {
                  "text": "槐荫区",
                  "id": 1361
                },
                {
                  "text": "天桥区",
                  "id": 1362
                },
                {
                  "text": "历城区",
                  "id": 1363
                },
                {
                  "text": "长清区",
                  "id": 1364
                },
                {
                  "text": "平阴县",
                  "id": 1365
                },
                {
                  "text": "济阳县",
                  "id": 1366
                },
                {
                  "text": "商河县",
                  "id": 1367
                },
                {
                  "text": "章丘市",
                  "id": 1368
                }
              ]
            },
            {
              "text": "青岛市",
              "id": 1369,
              "c": [
                {
                  "text": "市南区",
                  "id": 1370
                },
                {
                  "text": "市北区",
                  "id": 1371
                },
                {
                  "text": "四方区",
                  "id": 1372
                },
                {
                  "text": "黄岛区",
                  "id": 1373
                },
                {
                  "text": "崂山区",
                  "id": 1374
                },
                {
                  "text": "李沧区",
                  "id": 1375
                },
                {
                  "text": "城阳区",
                  "id": 1376
                },
                {
                  "text": "胶州市",
                  "id": 1377
                },
                {
                  "text": "即墨市",
                  "id": 1378
                },
                {
                  "text": "平度市",
                  "id": 1379
                },
                {
                  "text": "胶南市",
                  "id": 1380
                },
                {
                  "text": "莱西市",
                  "id": 1381
                }
              ]
            },
            {
              "text": "淄博市",
              "id": 1382,
              "c": [
                {
                  "text": "淄川区",
                  "id": 1383
                },
                {
                  "text": "张店区",
                  "id": 1384
                },
                {
                  "text": "博山区",
                  "id": 1385
                },
                {
                  "text": "临淄区",
                  "id": 1386
                },
                {
                  "text": "周村区",
                  "id": 1387
                },
                {
                  "text": "桓台县",
                  "id": 1388
                },
                {
                  "text": "高青县",
                  "id": 1389
                },
                {
                  "text": "沂源县",
                  "id": 1390
                }
              ]
            },
            {
              "text": "枣庄市",
              "id": 1391,
              "c": [
                {
                  "text": "市中区",
                  "id": 1392
                },
                {
                  "text": "薛城区",
                  "id": 1393
                },
                {
                  "text": "峄城区",
                  "id": 1394
                },
                {
                  "text": "台儿庄区",
                  "id": 1395
                },
                {
                  "text": "山亭区",
                  "id": 1396
                },
                {
                  "text": "滕州市",
                  "id": 1397
                }
              ]
            },
            {
              "text": "东营市",
              "id": 1398,
              "c": [
                {
                  "text": "东营区",
                  "id": 1399
                },
                {
                  "text": "河口区",
                  "id": 1400
                },
                {
                  "text": "垦利县",
                  "id": 1401
                },
                {
                  "text": "利津县",
                  "id": 1402
                },
                {
                  "text": "广饶县",
                  "id": 1403
                }
              ]
            },
            {
              "text": "烟台市",
              "id": 1404,
              "c": [
                {
                  "text": "芝罘区",
                  "id": 1405
                },
                {
                  "text": "福山区",
                  "id": 1406
                },
                {
                  "text": "牟平区",
                  "id": 1407
                },
                {
                  "text": "莱山区",
                  "id": 1408
                },
                {
                  "text": "长岛县",
                  "id": 1409
                },
                {
                  "text": "龙口市",
                  "id": 1410
                },
                {
                  "text": "莱阳市",
                  "id": 1411
                },
                {
                  "text": "莱州市",
                  "id": 1412
                },
                {
                  "text": "蓬莱市",
                  "id": 1413
                },
                {
                  "text": "招远市",
                  "id": 1414
                },
                {
                  "text": "栖霞市",
                  "id": 1415
                },
                {
                  "text": "海阳市",
                  "id": 1416
                }
              ]
            },
            {
              "text": "潍坊市",
              "id": 1417,
              "c": [
                {
                  "text": "潍城区",
                  "id": 1418
                },
                {
                  "text": "寒亭区",
                  "id": 1419
                },
                {
                  "text": "坊子区",
                  "id": 1420
                },
                {
                  "text": "奎文区",
                  "id": 1421
                },
                {
                  "text": "临朐县",
                  "id": 1422
                },
                {
                  "text": "昌乐县",
                  "id": 1423
                },
                {
                  "text": "青州市",
                  "id": 1424
                },
                {
                  "text": "诸城市",
                  "id": 1425
                },
                {
                  "text": "寿光市",
                  "id": 1426
                },
                {
                  "text": "安丘市",
                  "id": 1427
                },
                {
                  "text": "高密市",
                  "id": 1428
                },
                {
                  "text": "昌邑市",
                  "id": 1429
                }
              ]
            },
            {
              "text": "济宁市",
              "id": 1430,
              "c": [
                {
                  "text": "市中区",
                  "id": 1431
                },
                {
                  "text": "任城区",
                  "id": 1432
                },
                {
                  "text": "微山县",
                  "id": 1433
                },
                {
                  "text": "鱼台县",
                  "id": 1434
                },
                {
                  "text": "金乡县",
                  "id": 1435
                },
                {
                  "text": "嘉祥县",
                  "id": 1436
                },
                {
                  "text": "汶上县",
                  "id": 1437
                },
                {
                  "text": "泗水县",
                  "id": 1438
                },
                {
                  "text": "梁山县",
                  "id": 1439
                },
                {
                  "text": "曲阜市",
                  "id": 1440
                },
                {
                  "text": "兖州市",
                  "id": 1441
                },
                {
                  "text": "邹城市",
                  "id": 1442
                }
              ]
            },
            {
              "text": "泰安市",
              "id": 1443,
              "c": [
                {
                  "text": "泰山区",
                  "id": 1444
                },
                {
                  "text": "岱岳区",
                  "id": 1445
                },
                {
                  "text": "宁阳县",
                  "id": 1446
                },
                {
                  "text": "东平县",
                  "id": 1447
                },
                {
                  "text": "新泰市",
                  "id": 1448
                },
                {
                  "text": "肥城市",
                  "id": 1449
                }
              ]
            },
            {
              "text": "威海市",
              "id": 1450,
              "c": [
                {
                  "text": "环翠区",
                  "id": 1451
                },
                {
                  "text": "文登市",
                  "id": 1452
                },
                {
                  "text": "荣成市",
                  "id": 1453
                },
                {
                  "text": "乳山市",
                  "id": 1454
                }
              ]
            },
            {
              "text": "日照市",
              "id": 1455,
              "c": [
                {
                  "text": "东港区",
                  "id": 1456
                },
                {
                  "text": "岚山区",
                  "id": 1457
                },
                {
                  "text": "五莲县",
                  "id": 1458
                },
                {
                  "text": "莒县",
                  "id": 1459
                }
              ]
            },
            {
              "text": "莱芜市",
              "id": 1460,
              "c": [
                {
                  "text": "莱城区",
                  "id": 1461
                },
                {
                  "text": "钢城区",
                  "id": 1462
                }
              ]
            },
            {
              "text": "临沂市",
              "id": 1463,
              "c": [
                {
                  "text": "兰山区",
                  "id": 1464
                },
                {
                  "text": "罗庄区",
                  "id": 1465
                },
                {
                  "text": "河东区",
                  "id": 1466
                },
                {
                  "text": "沂南县",
                  "id": 1467
                },
                {
                  "text": "郯城县",
                  "id": 1468
                },
                {
                  "text": "沂水县",
                  "id": 1469
                },
                {
                  "text": "苍山县",
                  "id": 1470
                },
                {
                  "text": "费县",
                  "id": 1471
                },
                {
                  "text": "平邑县",
                  "id": 1472
                },
                {
                  "text": "莒南县",
                  "id": 1473
                },
                {
                  "text": "蒙阴县",
                  "id": 1474
                },
                {
                  "text": "临沭县",
                  "id": 1475
                }
              ]
            },
            {
              "text": "德州市",
              "id": 1476,
              "c": [
                {
                  "text": "德城区",
                  "id": 1477
                },
                {
                  "text": "陵县",
                  "id": 1478
                },
                {
                  "text": "宁津县",
                  "id": 1479
                },
                {
                  "text": "庆云县",
                  "id": 1480
                },
                {
                  "text": "临邑县",
                  "id": 1481
                },
                {
                  "text": "齐河县",
                  "id": 1482
                },
                {
                  "text": "平原县",
                  "id": 1483
                },
                {
                  "text": "夏津县",
                  "id": 1484
                },
                {
                  "text": "武城县",
                  "id": 1485
                },
                {
                  "text": "乐陵市",
                  "id": 1486
                },
                {
                  "text": "禹城市",
                  "id": 1487
                }
              ]
            },
            {
              "text": "聊城市",
              "id": 1488,
              "c": [
                {
                  "text": "东昌府区",
                  "id": 1489
                },
                {
                  "text": "阳谷县",
                  "id": 1490
                },
                {
                  "text": "莘县",
                  "id": 1491
                },
                {
                  "text": "茌平县",
                  "id": 1492
                },
                {
                  "text": "东阿县",
                  "id": 1493
                },
                {
                  "text": "冠县",
                  "id": 1494
                },
                {
                  "text": "高唐县",
                  "id": 1495
                },
                {
                  "text": "临清市",
                  "id": 1496
                }
              ]
            },
            {
              "text": "滨州市",
              "id": 1497,
              "c": [
                {
                  "text": "滨城区",
                  "id": 1498
                },
                {
                  "text": "惠民县",
                  "id": 1499
                },
                {
                  "text": "阳信县",
                  "id": 1500
                },
                {
                  "text": "无棣县",
                  "id": 1501
                },
                {
                  "text": "沾化县",
                  "id": 1502
                },
                {
                  "text": "博兴县",
                  "id": 1503
                },
                {
                  "text": "邹平县",
                  "id": 1504
                }
              ]
            },
            {
              "text": "菏泽市",
              "id": 1505,
              "c": [
                {
                  "text": "牡丹区",
                  "id": 1506
                },
                {
                  "text": "曹县",
                  "id": 1507
                },
                {
                  "text": "单县",
                  "id": 1508
                },
                {
                  "text": "成武县",
                  "id": 1509
                },
                {
                  "text": "巨野县",
                  "id": 1510
                },
                {
                  "text": "郓城县",
                  "id": 1511
                },
                {
                  "text": "鄄城县",
                  "id": 1512
                },
                {
                  "text": "定陶县",
                  "id": 1513
                },
                {
                  "text": "东明县",
                  "id": 1514
                }
              ]
            }
          ]
        },
        {
          "text": "河南省",
          "id": 1515,
          "c": [
            {
              "text": "郑州市",
              "id": 1516,
              "c": [
                {
                  "text": "中原区",
                  "id": 1517
                },
                {
                  "text": "二七区",
                  "id": 1518
                },
                {
                  "text": "管城回族区",
                  "id": 1519
                },
                {
                  "text": "金水区",
                  "id": 1520
                },
                {
                  "text": "上街区",
                  "id": 1521
                },
                {
                  "text": "惠济区",
                  "id": 1522
                },
                {
                  "text": "中牟县",
                  "id": 1523
                },
                {
                  "text": "巩义市",
                  "id": 1524
                },
                {
                  "text": "荥阳市",
                  "id": 1525
                },
                {
                  "text": "新密市",
                  "id": 1526
                },
                {
                  "text": "新郑市",
                  "id": 1527
                },
                {
                  "text": "登封市",
                  "id": 1528
                }
              ]
            },
            {
              "text": "开封市",
              "id": 1529,
              "c": [
                {
                  "text": "龙亭区",
                  "id": 1530
                },
                {
                  "text": "顺河回族区",
                  "id": 1531
                },
                {
                  "text": "鼓楼区",
                  "id": 1532
                },
                {
                  "text": "禹王台区",
                  "id": 1533
                },
                {
                  "text": "金明区",
                  "id": 1534
                },
                {
                  "text": "杞县",
                  "id": 1535
                },
                {
                  "text": "通许县",
                  "id": 1536
                },
                {
                  "text": "尉氏县",
                  "id": 1537
                },
                {
                  "text": "开封县",
                  "id": 1538
                },
                {
                  "text": "兰考县",
                  "id": 1539
                }
              ]
            },
            {
              "text": "洛阳市",
              "id": 1540,
              "c": [
                {
                  "text": "老城区",
                  "id": 1541
                },
                {
                  "text": "西工区",
                  "id": 1542
                },
                {
                  "text": "瀍河回族区",
                  "id": 1543
                },
                {
                  "text": "涧西区",
                  "id": 1544
                },
                {
                  "text": "吉利区",
                  "id": 1545
                },
                {
                  "text": "洛龙区",
                  "id": 1546
                },
                {
                  "text": "孟津县",
                  "id": 1547
                },
                {
                  "text": "新安县",
                  "id": 1548
                },
                {
                  "text": "栾川县",
                  "id": 1549
                },
                {
                  "text": "嵩县",
                  "id": 1550
                },
                {
                  "text": "汝阳县",
                  "id": 1551
                },
                {
                  "text": "宜阳县",
                  "id": 1552
                },
                {
                  "text": "洛宁县",
                  "id": 1553
                },
                {
                  "text": "伊川县",
                  "id": 1554
                },
                {
                  "text": "偃师市",
                  "id": 1555
                }
              ]
            },
            {
              "text": "平顶山市",
              "id": 1556,
              "c": [
                {
                  "text": "新华区",
                  "id": 1557
                },
                {
                  "text": "卫东区",
                  "id": 1558
                },
                {
                  "text": "石龙区",
                  "id": 1559
                },
                {
                  "text": "湛河区",
                  "id": 1560
                },
                {
                  "text": "宝丰县",
                  "id": 1561
                },
                {
                  "text": "叶县",
                  "id": 1562
                },
                {
                  "text": "鲁山县",
                  "id": 1563
                },
                {
                  "text": "郏县",
                  "id": 1564
                },
                {
                  "text": "舞钢市",
                  "id": 1565
                },
                {
                  "text": "汝州市",
                  "id": 1566
                }
              ]
            },
            {
              "text": "安阳市",
              "id": 1567,
              "c": [
                {
                  "text": "文峰区",
                  "id": 1568
                },
                {
                  "text": "北关区",
                  "id": 1569
                },
                {
                  "text": "殷都区",
                  "id": 1570
                },
                {
                  "text": "龙安区",
                  "id": 1571
                },
                {
                  "text": "安阳县",
                  "id": 1572
                },
                {
                  "text": "汤阴县",
                  "id": 1573
                },
                {
                  "text": "滑县",
                  "id": 1574
                },
                {
                  "text": "内黄县",
                  "id": 1575
                },
                {
                  "text": "林州市",
                  "id": 1576
                }
              ]
            },
            {
              "text": "鹤壁市",
              "id": 1577,
              "c": [
                {
                  "text": "鹤山区",
                  "id": 1578
                },
                {
                  "text": "山城区",
                  "id": 1579
                },
                {
                  "text": "淇滨区",
                  "id": 1580
                },
                {
                  "text": "浚县",
                  "id": 1581
                },
                {
                  "text": "淇县",
                  "id": 1582
                }
              ]
            },
            {
              "text": "新乡市",
              "id": 1583,
              "c": [
                {
                  "text": "红旗区",
                  "id": 1584
                },
                {
                  "text": "卫滨区",
                  "id": 1585
                },
                {
                  "text": "凤泉区",
                  "id": 1586
                },
                {
                  "text": "牧野区",
                  "id": 1587
                },
                {
                  "text": "新乡县",
                  "id": 1588
                },
                {
                  "text": "获嘉县",
                  "id": 1589
                },
                {
                  "text": "原阳县",
                  "id": 1590
                },
                {
                  "text": "延津县",
                  "id": 1591
                },
                {
                  "text": "封丘县",
                  "id": 1592
                },
                {
                  "text": "长垣县",
                  "id": 1593
                },
                {
                  "text": "卫辉市",
                  "id": 1594
                },
                {
                  "text": "辉县市",
                  "id": 1595
                }
              ]
            },
            {
              "text": "焦作市",
              "id": 1596,
              "c": [
                {
                  "text": "解放区",
                  "id": 1597
                },
                {
                  "text": "中站区",
                  "id": 1598
                },
                {
                  "text": "马村区",
                  "id": 1599
                },
                {
                  "text": "山阳区",
                  "id": 1600
                },
                {
                  "text": "修武县",
                  "id": 1601
                },
                {
                  "text": "博爱县",
                  "id": 1602
                },
                {
                  "text": "武陟县",
                  "id": 1603
                },
                {
                  "text": "温县",
                  "id": 1604
                },
                {
                  "text": "沁阳市",
                  "id": 1605
                },
                {
                  "text": "孟州市",
                  "id": 1606
                }
              ]
            },
            {
              "text": "濮阳市",
              "id": 1607,
              "c": [
                {
                  "text": "华龙区",
                  "id": 1608
                },
                {
                  "text": "清丰县",
                  "id": 1609
                },
                {
                  "text": "南乐县",
                  "id": 1610
                },
                {
                  "text": "范县",
                  "id": 1611
                },
                {
                  "text": "台前县",
                  "id": 1612
                },
                {
                  "text": "濮阳县",
                  "id": 1613
                }
              ]
            },
            {
              "text": "许昌市",
              "id": 1614,
              "c": [
                {
                  "text": "魏都区",
                  "id": 1615
                },
                {
                  "text": "许昌县",
                  "id": 1616
                },
                {
                  "text": "鄢陵县",
                  "id": 1617
                },
                {
                  "text": "襄城县",
                  "id": 1618
                },
                {
                  "text": "禹州市",
                  "id": 1619
                },
                {
                  "text": "长葛市",
                  "id": 1620
                }
              ]
            },
            {
              "text": "漯河市",
              "id": 1621,
              "c": [
                {
                  "text": "源汇区",
                  "id": 1622
                },
                {
                  "text": "郾城区",
                  "id": 1623
                },
                {
                  "text": "召陵区",
                  "id": 1624
                },
                {
                  "text": "舞阳县",
                  "id": 1625
                },
                {
                  "text": "临颍县",
                  "id": 1626
                }
              ]
            },
            {
              "text": "三门峡市",
              "id": 1627,
              "c": [
                {
                  "text": "湖滨区",
                  "id": 1628
                },
                {
                  "text": "渑池县",
                  "id": 1629
                },
                {
                  "text": "陕县",
                  "id": 1630
                },
                {
                  "text": "卢氏县",
                  "id": 1631
                },
                {
                  "text": "义马市",
                  "id": 1632
                },
                {
                  "text": "灵宝市",
                  "id": 1633
                }
              ]
            },
            {
              "text": "南阳市",
              "id": 1634,
              "c": [
                {
                  "text": "宛城区",
                  "id": 1635
                },
                {
                  "text": "卧龙区",
                  "id": 1636
                },
                {
                  "text": "南召县",
                  "id": 1637
                },
                {
                  "text": "方城县",
                  "id": 1638
                },
                {
                  "text": "西峡县",
                  "id": 1639
                },
                {
                  "text": "镇平县",
                  "id": 1640
                },
                {
                  "text": "内乡县",
                  "id": 1641
                },
                {
                  "text": "淅川县",
                  "id": 1642
                },
                {
                  "text": "社旗县",
                  "id": 1643
                },
                {
                  "text": "唐河县",
                  "id": 1644
                },
                {
                  "text": "新野县",
                  "id": 1645
                },
                {
                  "text": "桐柏县",
                  "id": 1646
                },
                {
                  "text": "邓州市",
                  "id": 1647
                }
              ]
            },
            {
              "text": "商丘市",
              "id": 1648,
              "c": [
                {
                  "text": "梁园区",
                  "id": 1649
                },
                {
                  "text": "睢阳区",
                  "id": 1650
                },
                {
                  "text": "民权县",
                  "id": 1651
                },
                {
                  "text": "睢县",
                  "id": 1652
                },
                {
                  "text": "宁陵县",
                  "id": 1653
                },
                {
                  "text": "柘城县",
                  "id": 1654
                },
                {
                  "text": "虞城县",
                  "id": 1655
                },
                {
                  "text": "夏邑县",
                  "id": 1656
                },
                {
                  "text": "永城市",
                  "id": 1657
                }
              ]
            },
            {
              "text": "信阳市",
              "id": 1658,
              "c": [
                {
                  "text": "浉河区",
                  "id": 1659
                },
                {
                  "text": "平桥区",
                  "id": 1660
                },
                {
                  "text": "罗山县",
                  "id": 1661
                },
                {
                  "text": "光山县",
                  "id": 1662
                },
                {
                  "text": "新县",
                  "id": 1663
                },
                {
                  "text": "商城县",
                  "id": 1664
                },
                {
                  "text": "固始县",
                  "id": 1665
                },
                {
                  "text": "潢川县",
                  "id": 1666
                },
                {
                  "text": "淮滨县",
                  "id": 1667
                },
                {
                  "text": "息县",
                  "id": 1668
                }
              ]
            },
            {
              "text": "周口市",
              "id": 1669,
              "c": [
                {
                  "text": "川汇区",
                  "id": 1670
                },
                {
                  "text": "扶沟县",
                  "id": 1671
                },
                {
                  "text": "西华县",
                  "id": 1672
                },
                {
                  "text": "商水县",
                  "id": 1673
                },
                {
                  "text": "沈丘县",
                  "id": 1674
                },
                {
                  "text": "郸城县",
                  "id": 1675
                },
                {
                  "text": "淮阳县",
                  "id": 1676
                },
                {
                  "text": "太康县",
                  "id": 1677
                },
                {
                  "text": "鹿邑县",
                  "id": 1678
                },
                {
                  "text": "项城市",
                  "id": 1679
                }
              ]
            },
            {
              "text": "驻马店市",
              "id": 1680,
              "c": [
                {
                  "text": "驿城区",
                  "id": 1681
                },
                {
                  "text": "西平县",
                  "id": 1682
                },
                {
                  "text": "上蔡县",
                  "id": 1683
                },
                {
                  "text": "平舆县",
                  "id": 1684
                },
                {
                  "text": "正阳县",
                  "id": 1685
                },
                {
                  "text": "确山县",
                  "id": 1686
                },
                {
                  "text": "泌阳县",
                  "id": 1687
                },
                {
                  "text": "汝南县",
                  "id": 1688
                },
                {
                  "text": "遂平县",
                  "id": 1689
                },
                {
                  "text": "新蔡县",
                  "id": 1690
                }
              ]
            },
            {
              "text": "济源市",
              "id": 1691,
              "c": []
            }
          ]
        },
        {
          "text": "湖北省",
          "id": 1692,
          "c": [
            {
              "text": "武汉市",
              "id": 1693,
              "c": [
                {
                  "text": "江岸区",
                  "id": 1694
                },
                {
                  "text": "江汉区",
                  "id": 1695
                },
                {
                  "text": "硚口区",
                  "id": 1696
                },
                {
                  "text": "汉阳区",
                  "id": 1697
                },
                {
                  "text": "武昌区",
                  "id": 1698
                },
                {
                  "text": "青山区",
                  "id": 1699
                },
                {
                  "text": "洪山区",
                  "id": 1700
                },
                {
                  "text": "东西湖区",
                  "id": 1701
                },
                {
                  "text": "汉南区",
                  "id": 1702
                },
                {
                  "text": "蔡甸区",
                  "id": 1703
                },
                {
                  "text": "江夏区",
                  "id": 1704
                },
                {
                  "text": "黄陂区",
                  "id": 1705
                },
                {
                  "text": "新洲区",
                  "id": 1706
                }
              ]
            },
            {
              "text": "黄石市",
              "id": 1707,
              "c": [
                {
                  "text": "黄石港区",
                  "id": 1708
                },
                {
                  "text": "西塞山区",
                  "id": 1709
                },
                {
                  "text": "下陆区",
                  "id": 1710
                },
                {
                  "text": "铁山区",
                  "id": 1711
                },
                {
                  "text": "阳新县",
                  "id": 1712
                },
                {
                  "text": "大冶市",
                  "id": 1713
                }
              ]
            },
            {
              "text": "十堰市",
              "id": 1714,
              "c": [
                {
                  "text": "茅箭区",
                  "id": 1715
                },
                {
                  "text": "张湾区",
                  "id": 1716
                },
                {
                  "text": "郧县",
                  "id": 1717
                },
                {
                  "text": "郧西县",
                  "id": 1718
                },
                {
                  "text": "竹山县",
                  "id": 1719
                },
                {
                  "text": "竹溪县",
                  "id": 1720
                },
                {
                  "text": "房县",
                  "id": 1721
                },
                {
                  "text": "丹江口市",
                  "id": 1722
                }
              ]
            },
            {
              "text": "宜昌市",
              "id": 1723,
              "c": [
                {
                  "text": "西陵区",
                  "id": 1724
                },
                {
                  "text": "伍家岗区",
                  "id": 1725
                },
                {
                  "text": "点军区",
                  "id": 1726
                },
                {
                  "text": "猇亭区",
                  "id": 1727
                },
                {
                  "text": "夷陵区",
                  "id": 1728
                },
                {
                  "text": "远安县",
                  "id": 1729
                },
                {
                  "text": "兴山县",
                  "id": 1730
                },
                {
                  "text": "秭归县",
                  "id": 1731
                },
                {
                  "text": "长阳土家族自治县",
                  "id": 1732
                },
                {
                  "text": "五峰土家族自治县",
                  "id": 1733
                },
                {
                  "text": "宜都市",
                  "id": 1734
                },
                {
                  "text": "当阳市",
                  "id": 1735
                },
                {
                  "text": "枝江市",
                  "id": 1736
                }
              ]
            },
            {
              "text": "襄阳市",
              "id": 1737,
              "c": [
                {
                  "text": "襄城区",
                  "id": 1738
                },
                {
                  "text": "樊城区",
                  "id": 1739
                },
                {
                  "text": "襄州区",
                  "id": 1740
                },
                {
                  "text": "南漳县",
                  "id": 1741
                },
                {
                  "text": "谷城县",
                  "id": 1742
                },
                {
                  "text": "保康县",
                  "id": 1743
                },
                {
                  "text": "老河口市",
                  "id": 1744
                },
                {
                  "text": "枣阳市",
                  "id": 1745
                },
                {
                  "text": "宜城市",
                  "id": 1746
                }
              ]
            },
            {
              "text": "鄂州市",
              "id": 1747,
              "c": [
                {
                  "text": "梁子湖区",
                  "id": 1748
                },
                {
                  "text": "华容区",
                  "id": 1749
                },
                {
                  "text": "鄂城区",
                  "id": 1750
                }
              ]
            },
            {
              "text": "荆门市",
              "id": 1751,
              "c": [
                {
                  "text": "东宝区",
                  "id": 1752
                },
                {
                  "text": "掇刀区",
                  "id": 1753
                },
                {
                  "text": "京山县",
                  "id": 1754
                },
                {
                  "text": "沙洋县",
                  "id": 1755
                },
                {
                  "text": "钟祥市",
                  "id": 1756
                }
              ]
            },
            {
              "text": "孝感市",
              "id": 1757,
              "c": [
                {
                  "text": "孝南区",
                  "id": 1758
                },
                {
                  "text": "孝昌县",
                  "id": 1759
                },
                {
                  "text": "大悟县",
                  "id": 1760
                },
                {
                  "text": "云梦县",
                  "id": 1761
                },
                {
                  "text": "应城市",
                  "id": 1762
                },
                {
                  "text": "安陆市",
                  "id": 1763
                },
                {
                  "text": "汉川市",
                  "id": 1764
                }
              ]
            },
            {
              "text": "荆州市",
              "id": 1765,
              "c": [
                {
                  "text": "沙市区",
                  "id": 1766
                },
                {
                  "text": "荆州区",
                  "id": 1767
                },
                {
                  "text": "公安县",
                  "id": 1768
                },
                {
                  "text": "监利县",
                  "id": 1769
                },
                {
                  "text": "江陵县",
                  "id": 1770
                },
                {
                  "text": "石首市",
                  "id": 1771
                },
                {
                  "text": "洪湖市",
                  "id": 1772
                },
                {
                  "text": "松滋市",
                  "id": 1773
                }
              ]
            },
            {
              "text": "黄冈市",
              "id": 1774,
              "c": [
                {
                  "text": "黄州区",
                  "id": 1775
                },
                {
                  "text": "团风县",
                  "id": 1776
                },
                {
                  "text": "红安县",
                  "id": 1777
                },
                {
                  "text": "罗田县",
                  "id": 1778
                },
                {
                  "text": "英山县",
                  "id": 1779
                },
                {
                  "text": "浠水县",
                  "id": 1780
                },
                {
                  "text": "蕲春县",
                  "id": 1781
                },
                {
                  "text": "黄梅县",
                  "id": 1782
                },
                {
                  "text": "麻城市",
                  "id": 1783
                },
                {
                  "text": "武穴市",
                  "id": 1784
                }
              ]
            },
            {
              "text": "咸宁市",
              "id": 1785,
              "c": [
                {
                  "text": "咸安区",
                  "id": 1786
                },
                {
                  "text": "嘉鱼县",
                  "id": 1787
                },
                {
                  "text": "通城县",
                  "id": 1788
                },
                {
                  "text": "崇阳县",
                  "id": 1789
                },
                {
                  "text": "通山县",
                  "id": 1790
                },
                {
                  "text": "赤壁市",
                  "id": 1791
                }
              ]
            },
            {
              "text": "随州市",
              "id": 1792,
              "c": [
                {
                  "text": "曾都区",
                  "id": 1793
                },
                {
                  "text": "随县",
                  "id": 1794
                },
                {
                  "text": "广水市",
                  "id": 1795
                }
              ]
            },
            {
              "text": "恩施土家族苗族自治州",
              "id": 1796,
              "c": [
                {
                  "text": "恩施市",
                  "id": 1797
                },
                {
                  "text": "利川市",
                  "id": 1798
                },
                {
                  "text": "建始县",
                  "id": 1799
                },
                {
                  "text": "巴东县",
                  "id": 1800
                },
                {
                  "text": "宣恩县",
                  "id": 1801
                },
                {
                  "text": "咸丰县",
                  "id": 1802
                },
                {
                  "text": "来凤县",
                  "id": 1803
                },
                {
                  "text": "鹤峰县",
                  "id": 1804
                }
              ]
            },
            {
              "text": "仙桃市",
              "id": 1805,
              "c": []
            },
            {
              "text": "潜江市",
              "id": 1806,
              "c": []
            },
            {
              "text": "天门市",
              "id": 1807,
              "c": []
            },
            {
              "text": "神农架林区",
              "id": 1808,
              "c": []
            }
          ]
        },
        {
          "text": "湖南省",
          "id": 1809,
          "c": [
            {
              "text": "长沙市",
              "id": 1810,
              "c": [
                {
                  "text": "芙蓉区",
                  "id": 1811
                },
                {
                  "text": "天心区",
                  "id": 1812
                },
                {
                  "text": "岳麓区",
                  "id": 1813
                },
                {
                  "text": "开福区",
                  "id": 1814
                },
                {
                  "text": "雨花区",
                  "id": 1815
                },
                {
                  "text": "望城区",
                  "id": 1816
                },
                {
                  "text": "长沙县",
                  "id": 1817
                },
                {
                  "text": "宁乡县",
                  "id": 1818
                },
                {
                  "text": "浏阳市",
                  "id": 1819
                }
              ]
            },
            {
              "text": "株洲市",
              "id": 1820,
              "c": [
                {
                  "text": "荷塘区",
                  "id": 1821
                },
                {
                  "text": "芦淞区",
                  "id": 1822
                },
                {
                  "text": "石峰区",
                  "id": 1823
                },
                {
                  "text": "天元区",
                  "id": 1824
                },
                {
                  "text": "株洲县",
                  "id": 1825
                },
                {
                  "text": "攸县",
                  "id": 1826
                },
                {
                  "text": "茶陵县",
                  "id": 1827
                },
                {
                  "text": "炎陵县",
                  "id": 1828
                },
                {
                  "text": "醴陵市",
                  "id": 1829
                }
              ]
            },
            {
              "text": "湘潭市",
              "id": 1830,
              "c": [
                {
                  "text": "雨湖区",
                  "id": 1831
                },
                {
                  "text": "岳塘区",
                  "id": 1832
                },
                {
                  "text": "湘潭县",
                  "id": 1833
                },
                {
                  "text": "湘乡市",
                  "id": 1834
                },
                {
                  "text": "韶山市",
                  "id": 1835
                }
              ]
            },
            {
              "text": "衡阳市",
              "id": 1836,
              "c": [
                {
                  "text": "珠晖区",
                  "id": 1837
                },
                {
                  "text": "雁峰区",
                  "id": 1838
                },
                {
                  "text": "石鼓区",
                  "id": 1839
                },
                {
                  "text": "蒸湘区",
                  "id": 1840
                },
                {
                  "text": "南岳区",
                  "id": 1841
                },
                {
                  "text": "衡阳县",
                  "id": 1842
                },
                {
                  "text": "衡南县",
                  "id": 1843
                },
                {
                  "text": "衡山县",
                  "id": 1844
                },
                {
                  "text": "衡东县",
                  "id": 1845
                },
                {
                  "text": "祁东县",
                  "id": 1846
                },
                {
                  "text": "耒阳市",
                  "id": 1847
                },
                {
                  "text": "常宁市",
                  "id": 1848
                }
              ]
            },
            {
              "text": "邵阳市",
              "id": 1849,
              "c": [
                {
                  "text": "双清区",
                  "id": 1850
                },
                {
                  "text": "大祥区",
                  "id": 1851
                },
                {
                  "text": "北塔区",
                  "id": 1852
                },
                {
                  "text": "邵东县",
                  "id": 1853
                },
                {
                  "text": "新邵县",
                  "id": 1854
                },
                {
                  "text": "邵阳县",
                  "id": 1855
                },
                {
                  "text": "隆回县",
                  "id": 1856
                },
                {
                  "text": "洞口县",
                  "id": 1857
                },
                {
                  "text": "绥宁县",
                  "id": 1858
                },
                {
                  "text": "新宁县",
                  "id": 1859
                },
                {
                  "text": "城步苗族自治县",
                  "id": 1860
                },
                {
                  "text": "武冈市",
                  "id": 1861
                }
              ]
            },
            {
              "text": "岳阳市",
              "id": 1862,
              "c": [
                {
                  "text": "岳阳楼区",
                  "id": 1863
                },
                {
                  "text": "云溪区",
                  "id": 1864
                },
                {
                  "text": "君山区",
                  "id": 1865
                },
                {
                  "text": "岳阳县",
                  "id": 1866
                },
                {
                  "text": "华容县",
                  "id": 1867
                },
                {
                  "text": "湘阴县",
                  "id": 1868
                },
                {
                  "text": "平江县",
                  "id": 1869
                },
                {
                  "text": "汨罗市",
                  "id": 1870
                },
                {
                  "text": "临湘市",
                  "id": 1871
                }
              ]
            },
            {
              "text": "常德市",
              "id": 1872,
              "c": [
                {
                  "text": "武陵区",
                  "id": 1873
                },
                {
                  "text": "鼎城区",
                  "id": 1874
                },
                {
                  "text": "安乡县",
                  "id": 1875
                },
                {
                  "text": "汉寿县",
                  "id": 1876
                },
                {
                  "text": "澧县",
                  "id": 1877
                },
                {
                  "text": "临澧县",
                  "id": 1878
                },
                {
                  "text": "桃源县",
                  "id": 1879
                },
                {
                  "text": "石门县",
                  "id": 1880
                },
                {
                  "text": "津市市",
                  "id": 1881
                }
              ]
            },
            {
              "text": "张家界市",
              "id": 1882,
              "c": [
                {
                  "text": "永定区",
                  "id": 1883
                },
                {
                  "text": "武陵源区",
                  "id": 1884
                },
                {
                  "text": "慈利县",
                  "id": 1885
                },
                {
                  "text": "桑植县",
                  "id": 1886
                }
              ]
            },
            {
              "text": "益阳市",
              "id": 1887,
              "c": [
                {
                  "text": "资阳区",
                  "id": 1888
                },
                {
                  "text": "赫山区",
                  "id": 1889
                },
                {
                  "text": "南县",
                  "id": 1890
                },
                {
                  "text": "桃江县",
                  "id": 1891
                },
                {
                  "text": "安化县",
                  "id": 1892
                },
                {
                  "text": "沅江市",
                  "id": 1893
                }
              ]
            },
            {
              "text": "郴州市",
              "id": 1894,
              "c": [
                {
                  "text": "北湖区",
                  "id": 1895
                },
                {
                  "text": "苏仙区",
                  "id": 1896
                },
                {
                  "text": "桂阳县",
                  "id": 1897
                },
                {
                  "text": "宜章县",
                  "id": 1898
                },
                {
                  "text": "永兴县",
                  "id": 1899
                },
                {
                  "text": "嘉禾县",
                  "id": 1900
                },
                {
                  "text": "临武县",
                  "id": 1901
                },
                {
                  "text": "汝城县",
                  "id": 1902
                },
                {
                  "text": "桂东县",
                  "id": 1903
                },
                {
                  "text": "安仁县",
                  "id": 1904
                },
                {
                  "text": "资兴市",
                  "id": 1905
                }
              ]
            },
            {
              "text": "永州市",
              "id": 1906,
              "c": [
                {
                  "text": "零陵区",
                  "id": 1907
                },
                {
                  "text": "冷水滩区",
                  "id": 1908
                },
                {
                  "text": "祁阳县",
                  "id": 1909
                },
                {
                  "text": "东安县",
                  "id": 1910
                },
                {
                  "text": "双牌县",
                  "id": 1911
                },
                {
                  "text": "道县",
                  "id": 1912
                },
                {
                  "text": "江永县",
                  "id": 1913
                },
                {
                  "text": "宁远县",
                  "id": 1914
                },
                {
                  "text": "蓝山县",
                  "id": 1915
                },
                {
                  "text": "新田县",
                  "id": 1916
                },
                {
                  "text": "江华瑶族自治县",
                  "id": 1917
                }
              ]
            },
            {
              "text": "怀化市",
              "id": 1918,
              "c": [
                {
                  "text": "鹤城区",
                  "id": 1919
                },
                {
                  "text": "中方县",
                  "id": 1920
                },
                {
                  "text": "沅陵县",
                  "id": 1921
                },
                {
                  "text": "辰溪县",
                  "id": 1922
                },
                {
                  "text": "溆浦县",
                  "id": 1923
                },
                {
                  "text": "会同县",
                  "id": 1924
                },
                {
                  "text": "麻阳苗族自治县",
                  "id": 1925
                },
                {
                  "text": "新晃侗族自治县",
                  "id": 1926
                },
                {
                  "text": "芷江侗族自治县",
                  "id": 1927
                },
                {
                  "text": "靖州苗族侗族自治县",
                  "id": 1928
                },
                {
                  "text": "通道侗族自治县",
                  "id": 1929
                },
                {
                  "text": "洪江市",
                  "id": 1930
                }
              ]
            },
            {
              "text": "娄底市",
              "id": 1931,
              "c": [
                {
                  "text": "娄星区",
                  "id": 1932
                },
                {
                  "text": "双峰县",
                  "id": 1933
                },
                {
                  "text": "新化县",
                  "id": 1934
                },
                {
                  "text": "冷水江市",
                  "id": 1935
                },
                {
                  "text": "涟源市",
                  "id": 1936
                }
              ]
            },
            {
              "text": "湘西土家族苗族自治州",
              "id": 1937,
              "c": [
                {
                  "text": "吉首市",
                  "id": 1938
                },
                {
                  "text": "泸溪县",
                  "id": 1939
                },
                {
                  "text": "凤凰县",
                  "id": 1940
                },
                {
                  "text": "花垣县",
                  "id": 1941
                },
                {
                  "text": "保靖县",
                  "id": 1942
                },
                {
                  "text": "古丈县",
                  "id": 1943
                },
                {
                  "text": "永顺县",
                  "id": 1944
                },
                {
                  "text": "龙山县",
                  "id": 1945
                }
              ]
            }
          ]
        },
        {
          "text": "广东省",
          "id": 1946,
          "c": [
            {
              "text": "广州市",
              "id": 1947,
              "c": [
                {
                  "text": "荔湾区",
                  "id": 1948
                },
                {
                  "text": "越秀区",
                  "id": 1949
                },
                {
                  "text": "海珠区",
                  "id": 1950
                },
                {
                  "text": "天河区",
                  "id": 1951
                },
                {
                  "text": "白云区",
                  "id": 1952
                },
                {
                  "text": "黄埔区",
                  "id": 1953
                },
                {
                  "text": "番禺区",
                  "id": 1954
                },
                {
                  "text": "花都区",
                  "id": 1955
                },
                {
                  "text": "南沙区",
                  "id": 1956
                },
                {
                  "text": "萝岗区",
                  "id": 1957
                },
                {
                  "text": "增城市",
                  "id": 1958
                },
                {
                  "text": "从化市",
                  "id": 1959
                }
              ]
            },
            {
              "text": "韶关市",
              "id": 1960,
              "c": [
                {
                  "text": "武江区",
                  "id": 1961
                },
                {
                  "text": "浈江区",
                  "id": 1962
                },
                {
                  "text": "曲江区",
                  "id": 1963
                },
                {
                  "text": "始兴县",
                  "id": 1964
                },
                {
                  "text": "仁化县",
                  "id": 1965
                },
                {
                  "text": "翁源县",
                  "id": 1966
                },
                {
                  "text": "乳源瑶族自治县",
                  "id": 1967
                },
                {
                  "text": "新丰县",
                  "id": 1968
                },
                {
                  "text": "乐昌市",
                  "id": 1969
                },
                {
                  "text": "南雄市",
                  "id": 1970
                }
              ]
            },
            {
              "text": "深圳市",
              "id": 1971,
              "c": [
                {
                  "text": "罗湖区",
                  "id": 1972
                },
                {
                  "text": "福田区",
                  "id": 1973
                },
                {
                  "text": "南山区",
                  "id": 1974
                },
                {
                  "text": "宝安区",
                  "id": 1975
                },
                {
                  "text": "龙岗区",
                  "id": 1976
                },
                {
                  "text": "盐田区",
                  "id": 1977
                }
              ]
            },
            {
              "text": "珠海市",
              "id": 1978,
              "c": [
                {
                  "text": "香洲区",
                  "id": 1979
                },
                {
                  "text": "斗门区",
                  "id": 1980
                },
                {
                  "text": "金湾区",
                  "id": 1981
                }
              ]
            },
            {
              "text": "汕头市",
              "id": 1982,
              "c": [
                {
                  "text": "龙湖区",
                  "id": 1983
                },
                {
                  "text": "金平区",
                  "id": 1984
                },
                {
                  "text": "濠江区",
                  "id": 1985
                },
                {
                  "text": "潮阳区",
                  "id": 1986
                },
                {
                  "text": "潮南区",
                  "id": 1987
                },
                {
                  "text": "澄海区",
                  "id": 1988
                },
                {
                  "text": "南澳县",
                  "id": 1989
                }
              ]
            },
            {
              "text": "佛山市",
              "id": 1990,
              "c": [
                {
                  "text": "禅城区",
                  "id": 1991
                },
                {
                  "text": "南海区",
                  "id": 1992
                },
                {
                  "text": "顺德区",
                  "id": 1993
                },
                {
                  "text": "三水区",
                  "id": 1994
                },
                {
                  "text": "高明区",
                  "id": 1995
                }
              ]
            },
            {
              "text": "江门市",
              "id": 1996,
              "c": [
                {
                  "text": "蓬江区",
                  "id": 1997
                },
                {
                  "text": "江海区",
                  "id": 1998
                },
                {
                  "text": "新会区",
                  "id": 1999
                },
                {
                  "text": "台山市",
                  "id": 2000
                },
                {
                  "text": "开平市",
                  "id": 2001
                },
                {
                  "text": "鹤山市",
                  "id": 2002
                },
                {
                  "text": "恩平市",
                  "id": 2003
                }
              ]
            },
            {
              "text": "湛江市",
              "id": 2004,
              "c": [
                {
                  "text": "赤坎区",
                  "id": 2005
                },
                {
                  "text": "霞山区",
                  "id": 2006
                },
                {
                  "text": "坡头区",
                  "id": 2007
                },
                {
                  "text": "麻章区",
                  "id": 2008
                },
                {
                  "text": "遂溪县",
                  "id": 2009
                },
                {
                  "text": "徐闻县",
                  "id": 2010
                },
                {
                  "text": "廉江市",
                  "id": 2011
                },
                {
                  "text": "雷州市",
                  "id": 2012
                },
                {
                  "text": "吴川市",
                  "id": 2013
                }
              ]
            },
            {
              "text": "茂名市",
              "id": 2014,
              "c": [
                {
                  "text": "茂南区",
                  "id": 2015
                },
                {
                  "text": "茂港区",
                  "id": 2016
                },
                {
                  "text": "电白县",
                  "id": 2017
                },
                {
                  "text": "高州市",
                  "id": 2018
                },
                {
                  "text": "化州市",
                  "id": 2019
                },
                {
                  "text": "信宜市",
                  "id": 2020
                }
              ]
            },
            {
              "text": "肇庆市",
              "id": 2021,
              "c": [
                {
                  "text": "端州区",
                  "id": 2022
                },
                {
                  "text": "鼎湖区",
                  "id": 2023
                },
                {
                  "text": "广宁县",
                  "id": 2024
                },
                {
                  "text": "怀集县",
                  "id": 2025
                },
                {
                  "text": "封开县",
                  "id": 2026
                },
                {
                  "text": "德庆县",
                  "id": 2027
                },
                {
                  "text": "高要市",
                  "id": 2028
                },
                {
                  "text": "四会市",
                  "id": 2029
                }
              ]
            },
            {
              "text": "惠州市",
              "id": 2030,
              "c": [
                {
                  "text": "惠城区",
                  "id": 2031
                },
                {
                  "text": "惠阳区",
                  "id": 2032
                },
                {
                  "text": "博罗县",
                  "id": 2033
                },
                {
                  "text": "惠东县",
                  "id": 2034
                },
                {
                  "text": "龙门县",
                  "id": 2035
                }
              ]
            },
            {
              "text": "梅州市",
              "id": 2036,
              "c": [
                {
                  "text": "梅江区",
                  "id": 2037
                },
                {
                  "text": "梅县",
                  "id": 2038
                },
                {
                  "text": "大埔县",
                  "id": 2039
                },
                {
                  "text": "丰顺县",
                  "id": 2040
                },
                {
                  "text": "五华县",
                  "id": 2041
                },
                {
                  "text": "平远县",
                  "id": 2042
                },
                {
                  "text": "蕉岭县",
                  "id": 2043
                },
                {
                  "text": "兴宁市",
                  "id": 2044
                }
              ]
            },
            {
              "text": "汕尾市",
              "id": 2045,
              "c": [
                {
                  "text": "城区",
                  "id": 2046
                },
                {
                  "text": "海丰县",
                  "id": 2047
                },
                {
                  "text": "陆河县",
                  "id": 2048
                },
                {
                  "text": "陆丰市",
                  "id": 2049
                }
              ]
            },
            {
              "text": "河源市",
              "id": 2050,
              "c": [
                {
                  "text": "源城区",
                  "id": 2051
                },
                {
                  "text": "紫金县",
                  "id": 2052
                },
                {
                  "text": "龙川县",
                  "id": 2053
                },
                {
                  "text": "连平县",
                  "id": 2054
                },
                {
                  "text": "和平县",
                  "id": 2055
                },
                {
                  "text": "东源县",
                  "id": 2056
                }
              ]
            },
            {
              "text": "阳江市",
              "id": 2057,
              "c": [
                {
                  "text": "江城区",
                  "id": 2058
                },
                {
                  "text": "阳西县",
                  "id": 2059
                },
                {
                  "text": "阳东县",
                  "id": 2060
                },
                {
                  "text": "阳春市",
                  "id": 2061
                }
              ]
            },
            {
              "text": "清远市",
              "id": 2062,
              "c": [
                {
                  "text": "清城区",
                  "id": 2063
                },
                {
                  "text": "佛冈县",
                  "id": 2064
                },
                {
                  "text": "阳山县",
                  "id": 2065
                },
                {
                  "text": "连山壮族瑶族自治县",
                  "id": 2066
                },
                {
                  "text": "连南瑶族自治县",
                  "id": 2067
                },
                {
                  "text": "清新县",
                  "id": 2068
                },
                {
                  "text": "英德市",
                  "id": 2069
                },
                {
                  "text": "连州市",
                  "id": 2070
                }
              ]
            },
            {
              "text": "东莞市",
              "id": 2071,
              "c": []
            },
            {
              "text": "中山市",
              "id": 2072,
              "c": []
            },
            {
              "text": "潮州市",
              "id": 2073,
              "c": [
                {
                  "text": "湘桥区",
                  "id": 2074
                },
                {
                  "text": "潮安县",
                  "id": 2075
                },
                {
                  "text": "饶平县",
                  "id": 2076
                }
              ]
            },
            {
              "text": "揭阳市",
              "id": 2077,
              "c": [
                {
                  "text": "榕城区",
                  "id": 2078
                },
                {
                  "text": "揭东县",
                  "id": 2079
                },
                {
                  "text": "揭西县",
                  "id": 2080
                },
                {
                  "text": "惠来县",
                  "id": 2081
                },
                {
                  "text": "普宁市",
                  "id": 2082
                }
              ]
            },
            {
              "text": "云浮市",
              "id": 2083,
              "c": [
                {
                  "text": "云城区",
                  "id": 2084
                },
                {
                  "text": "新兴县",
                  "id": 2085
                },
                {
                  "text": "郁南县",
                  "id": 2086
                },
                {
                  "text": "云安县",
                  "id": 2087
                },
                {
                  "text": "罗定市",
                  "id": 2088
                }
              ]
            }
          ]
        },
        {
          "text": "广西壮族自治区",
          "id": 2089,
          "c": [
            {
              "text": "南宁市",
              "id": 2090,
              "c": [
                {
                  "text": "兴宁区",
                  "id": 2091
                },
                {
                  "text": "青秀区",
                  "id": 2092
                },
                {
                  "text": "江南区",
                  "id": 2093
                },
                {
                  "text": "西乡塘区",
                  "id": 2094
                },
                {
                  "text": "良庆区",
                  "id": 2095
                },
                {
                  "text": "邕宁区",
                  "id": 2096
                },
                {
                  "text": "武鸣县",
                  "id": 2097
                },
                {
                  "text": "隆安县",
                  "id": 2098
                },
                {
                  "text": "马山县",
                  "id": 2099
                },
                {
                  "text": "上林县",
                  "id": 2100
                },
                {
                  "text": "宾阳县",
                  "id": 2101
                },
                {
                  "text": "横县",
                  "id": 2102
                }
              ]
            },
            {
              "text": "柳州市",
              "id": 2103,
              "c": [
                {
                  "text": "城中区",
                  "id": 2104
                },
                {
                  "text": "鱼峰区",
                  "id": 2105
                },
                {
                  "text": "柳南区",
                  "id": 2106
                },
                {
                  "text": "柳北区",
                  "id": 2107
                },
                {
                  "text": "柳江县",
                  "id": 2108
                },
                {
                  "text": "柳城县",
                  "id": 2109
                },
                {
                  "text": "鹿寨县",
                  "id": 2110
                },
                {
                  "text": "融安县",
                  "id": 2111
                },
                {
                  "text": "融水苗族自治县",
                  "id": 2112
                },
                {
                  "text": "三江侗族自治县",
                  "id": 2113
                }
              ]
            },
            {
              "text": "桂林市",
              "id": 2114,
              "c": [
                {
                  "text": "秀峰区",
                  "id": 2115
                },
                {
                  "text": "叠彩区",
                  "id": 2116
                },
                {
                  "text": "象山区",
                  "id": 2117
                },
                {
                  "text": "七星区",
                  "id": 2118
                },
                {
                  "text": "雁山区",
                  "id": 2119
                },
                {
                  "text": "阳朔县",
                  "id": 2120
                },
                {
                  "text": "临桂县",
                  "id": 2121
                },
                {
                  "text": "灵川县",
                  "id": 2122
                },
                {
                  "text": "全州县",
                  "id": 2123
                },
                {
                  "text": "兴安县",
                  "id": 2124
                },
                {
                  "text": "永福县",
                  "id": 2125
                },
                {
                  "text": "灌阳县",
                  "id": 2126
                },
                {
                  "text": "龙胜各族自治县",
                  "id": 2127
                },
                {
                  "text": "资源县",
                  "id": 2128
                },
                {
                  "text": "平乐县",
                  "id": 2129
                },
                {
                  "text": "荔浦县",
                  "id": 2130
                },
                {
                  "text": "恭城瑶族自治县",
                  "id": 2131
                }
              ]
            },
            {
              "text": "梧州市",
              "id": 2132,
              "c": [
                {
                  "text": "万秀区",
                  "id": 2133
                },
                {
                  "text": "蝶山区",
                  "id": 2134
                },
                {
                  "text": "长洲区",
                  "id": 2135
                },
                {
                  "text": "苍梧县",
                  "id": 2136
                },
                {
                  "text": "藤县",
                  "id": 2137
                },
                {
                  "text": "蒙山县",
                  "id": 2138
                },
                {
                  "text": "岑溪市",
                  "id": 2139
                }
              ]
            },
            {
              "text": "北海市",
              "id": 2140,
              "c": [
                {
                  "text": "海城区",
                  "id": 2141
                },
                {
                  "text": "银海区",
                  "id": 2142
                },
                {
                  "text": "铁山港区",
                  "id": 2143
                },
                {
                  "text": "合浦县",
                  "id": 2144
                }
              ]
            },
            {
              "text": "防城港市",
              "id": 2145,
              "c": [
                {
                  "text": "港口区",
                  "id": 2146
                },
                {
                  "text": "防城区",
                  "id": 2147
                },
                {
                  "text": "上思县",
                  "id": 2148
                },
                {
                  "text": "东兴市",
                  "id": 2149
                }
              ]
            },
            {
              "text": "钦州市",
              "id": 2150,
              "c": [
                {
                  "text": "钦南区",
                  "id": 2151
                },
                {
                  "text": "钦北区",
                  "id": 2152
                },
                {
                  "text": "灵山县",
                  "id": 2153
                },
                {
                  "text": "浦北县",
                  "id": 2154
                }
              ]
            },
            {
              "text": "贵港市",
              "id": 2155,
              "c": [
                {
                  "text": "港北区",
                  "id": 2156
                },
                {
                  "text": "港南区",
                  "id": 2157
                },
                {
                  "text": "覃塘区",
                  "id": 2158
                },
                {
                  "text": "平南县",
                  "id": 2159
                },
                {
                  "text": "桂平市",
                  "id": 2160
                }
              ]
            },
            {
              "text": "玉林市",
              "id": 2161,
              "c": [
                {
                  "text": "玉州区",
                  "id": 2162
                },
                {
                  "text": "容县",
                  "id": 2163
                },
                {
                  "text": "陆川县",
                  "id": 2164
                },
                {
                  "text": "博白县",
                  "id": 2165
                },
                {
                  "text": "兴业县",
                  "id": 2166
                },
                {
                  "text": "北流市",
                  "id": 2167
                }
              ]
            },
            {
              "text": "百色市",
              "id": 2168,
              "c": [
                {
                  "text": "右江区",
                  "id": 2169
                },
                {
                  "text": "田阳县",
                  "id": 2170
                },
                {
                  "text": "田东县",
                  "id": 2171
                },
                {
                  "text": "平果县",
                  "id": 2172
                },
                {
                  "text": "德保县",
                  "id": 2173
                },
                {
                  "text": "靖西县",
                  "id": 2174
                },
                {
                  "text": "那坡县",
                  "id": 2175
                },
                {
                  "text": "凌云县",
                  "id": 2176
                },
                {
                  "text": "乐业县",
                  "id": 2177
                },
                {
                  "text": "田林县",
                  "id": 2178
                },
                {
                  "text": "西林县",
                  "id": 2179
                },
                {
                  "text": "隆林各族自治县",
                  "id": 2180
                }
              ]
            },
            {
              "text": "贺州市",
              "id": 2181,
              "c": [
                {
                  "text": "八步区",
                  "id": 2182
                },
                {
                  "text": "昭平县",
                  "id": 2183
                },
                {
                  "text": "钟山县",
                  "id": 2184
                },
                {
                  "text": "富川瑶族自治县",
                  "id": 2185
                }
              ]
            },
            {
              "text": "河池市",
              "id": 2186,
              "c": [
                {
                  "text": "金城江区",
                  "id": 2187
                },
                {
                  "text": "南丹县",
                  "id": 2188
                },
                {
                  "text": "天峨县",
                  "id": 2189
                },
                {
                  "text": "凤山县",
                  "id": 2190
                },
                {
                  "text": "东兰县",
                  "id": 2191
                },
                {
                  "text": "罗城仫佬族自治县",
                  "id": 2192
                },
                {
                  "text": "环江毛南族自治县",
                  "id": 2193
                },
                {
                  "text": "巴马瑶族自治县",
                  "id": 2194
                },
                {
                  "text": "都安瑶族自治县",
                  "id": 2195
                },
                {
                  "text": "大化瑶族自治县",
                  "id": 2196
                },
                {
                  "text": "宜州市",
                  "id": 2197
                }
              ]
            },
            {
              "text": "来宾市",
              "id": 2198,
              "c": [
                {
                  "text": "兴宾区",
                  "id": 2199
                },
                {
                  "text": "忻城县",
                  "id": 2200
                },
                {
                  "text": "象州县",
                  "id": 2201
                },
                {
                  "text": "武宣县",
                  "id": 2202
                },
                {
                  "text": "金秀瑶族自治县",
                  "id": 2203
                },
                {
                  "text": "合山市",
                  "id": 2204
                }
              ]
            },
            {
              "text": "崇左市",
              "id": 2205,
              "c": [
                {
                  "text": "江洲区",
                  "id": 2206
                },
                {
                  "text": "扶绥县",
                  "id": 2207
                },
                {
                  "text": "宁明县",
                  "id": 2208
                },
                {
                  "text": "龙州县",
                  "id": 2209
                },
                {
                  "text": "大新县",
                  "id": 2210
                },
                {
                  "text": "天等县",
                  "id": 2211
                },
                {
                  "text": "凭祥市",
                  "id": 2212
                }
              ]
            }
          ]
        },
        {
          "text": "海南省",
          "id": 2213,
          "c": [
            {
              "text": "海口市",
              "id": 2214,
              "c": [
                {
                  "text": "秀英区",
                  "id": 2215
                },
                {
                  "text": "龙华区",
                  "id": 2216
                },
                {
                  "text": "琼山区",
                  "id": 2217
                },
                {
                  "text": "美兰区",
                  "id": 2218
                }
              ]
            },
            {
              "text": "三亚市",
              "id": 2219,
              "c": []
            },
            {
              "text": "三沙市",
              "id": 2220,
              "c": [
                {
                  "text": "西沙群岛",
                  "id": 2221
                },
                {
                  "text": "南沙群岛",
                  "id": 2222
                },
                {
                  "text": "中沙群岛的岛礁及其海域",
                  "id": 2223
                }
              ]
            },
            {
              "text": "五指山市",
              "id": 2224,
              "c": []
            },
            {
              "text": "琼海市",
              "id": 2225,
              "c": []
            },
            {
              "text": "儋州市",
              "id": 2226,
              "c": []
            },
            {
              "text": "文昌市",
              "id": 2227,
              "c": []
            },
            {
              "text": "万宁市",
              "id": 2228,
              "c": []
            },
            {
              "text": "东方市",
              "id": 2229,
              "c": []
            },
            {
              "text": "定安县",
              "id": 2230,
              "c": []
            },
            {
              "text": "屯昌县",
              "id": 2231,
              "c": []
            },
            {
              "text": "澄迈县",
              "id": 2232,
              "c": []
            },
            {
              "text": "临高县",
              "id": 2233,
              "c": []
            },
            {
              "text": "白沙黎族自治县",
              "id": 2234,
              "c": []
            },
            {
              "text": "昌江黎族自治县",
              "id": 2235,
              "c": []
            },
            {
              "text": "乐东黎族自治县",
              "id": 2236,
              "c": []
            },
            {
              "text": "陵水黎族自治县",
              "id": 2237,
              "c": []
            },
            {
              "text": "保亭黎族苗族自治县",
              "id": 2238,
              "c": []
            },
            {
              "text": "琼中黎族苗族自治县",
              "id": 2239,
              "c": []
            }
          ]
        },
        {
          "text": "重庆",
          "id": 3320,
          "c": [
            {
              "text": "重庆市",
              "id": 2240,
              "c": [
                {
                  "text": "万州区",
                  "id": 2241
                },
                {
                  "text": "涪陵区",
                  "id": 2242
                },
                {
                  "text": "渝中区",
                  "id": 2243
                },
                {
                  "text": "大渡口区",
                  "id": 2244
                },
                {
                  "text": "江北区",
                  "id": 2245
                },
                {
                  "text": "沙坪坝区",
                  "id": 2246
                },
                {
                  "text": "九龙坡区",
                  "id": 2247
                },
                {
                  "text": "南岸区",
                  "id": 2248
                },
                {
                  "text": "北碚区",
                  "id": 2249
                },
                {
                  "text": "綦江区",
                  "id": 2250
                },
                {
                  "text": "大足区",
                  "id": 2251
                },
                {
                  "text": "渝北区",
                  "id": 2252
                },
                {
                  "text": "巴南区",
                  "id": 2253
                },
                {
                  "text": "黔江区",
                  "id": 2254
                },
                {
                  "text": "长寿区",
                  "id": 2255
                },
                {
                  "text": "江津区",
                  "id": 2256
                },
                {
                  "text": "合川区",
                  "id": 2257
                },
                {
                  "text": "永川区",
                  "id": 2258
                },
                {
                  "text": "南川区",
                  "id": 2259
                },
                {
                  "text": "潼南县",
                  "id": 2260
                },
                {
                  "text": "铜梁县",
                  "id": 2261
                },
                {
                  "text": "荣昌县",
                  "id": 2262
                },
                {
                  "text": "璧山县",
                  "id": 2263
                },
                {
                  "text": "梁平县",
                  "id": 2264
                },
                {
                  "text": "城口县",
                  "id": 2265
                },
                {
                  "text": "丰都县",
                  "id": 2266
                },
                {
                  "text": "垫江县",
                  "id": 2267
                },
                {
                  "text": "武隆县",
                  "id": 2268
                },
                {
                  "text": "忠县",
                  "id": 2269
                },
                {
                  "text": "开县",
                  "id": 2270
                },
                {
                  "text": "云阳县",
                  "id": 2271
                },
                {
                  "text": "奉节县",
                  "id": 2272
                },
                {
                  "text": "巫山县",
                  "id": 2273
                },
                {
                  "text": "巫溪县",
                  "id": 2274
                },
                {
                  "text": "石柱土家族自治县",
                  "id": 2275
                },
                {
                  "text": "秀山土家族苗族自治县",
                  "id": 2276
                },
                {
                  "text": "酉阳土家族苗族自治县",
                  "id": 2277
                },
                {
                  "text": "彭水苗族土家族自治县",
                  "id": 2278
                }
              ]
            }
          ]
        },
        {
          "text": "四川省",
          "id": 2279,
          "c": [
            {
              "text": "成都市",
              "id": 2280,
              "c": [
                {
                  "text": "锦江区",
                  "id": 2281
                },
                {
                  "text": "青羊区",
                  "id": 2282
                },
                {
                  "text": "金牛区",
                  "id": 2283
                },
                {
                  "text": "武侯区",
                  "id": 2284
                },
                {
                  "text": "成华区",
                  "id": 2285
                },
                {
                  "text": "龙泉驿区",
                  "id": 2286
                },
                {
                  "text": "青白江区",
                  "id": 2287
                },
                {
                  "text": "新都区",
                  "id": 2288
                },
                {
                  "text": "温江区",
                  "id": 2289
                },
                {
                  "text": "金堂县",
                  "id": 2290
                },
                {
                  "text": "双流县",
                  "id": 2291
                },
                {
                  "text": "郫县",
                  "id": 2292
                },
                {
                  "text": "大邑县",
                  "id": 2293
                },
                {
                  "text": "蒲江县",
                  "id": 2294
                },
                {
                  "text": "新津县",
                  "id": 2295
                },
                {
                  "text": "都江堰市",
                  "id": 2296
                },
                {
                  "text": "彭州市",
                  "id": 2297
                },
                {
                  "text": "邛崃市",
                  "id": 2298
                },
                {
                  "text": "崇州市",
                  "id": 2299
                }
              ]
            },
            {
              "text": "自贡市",
              "id": 2300,
              "c": [
                {
                  "text": "自流井区",
                  "id": 2301
                },
                {
                  "text": "贡井区",
                  "id": 2302
                },
                {
                  "text": "大安区",
                  "id": 2303
                },
                {
                  "text": "沿滩区",
                  "id": 2304
                },
                {
                  "text": "荣县",
                  "id": 2305
                },
                {
                  "text": "富顺县",
                  "id": 2306
                }
              ]
            },
            {
              "text": "攀枝花市",
              "id": 2307,
              "c": [
                {
                  "text": "东区",
                  "id": 2308
                },
                {
                  "text": "西区",
                  "id": 2309
                },
                {
                  "text": "仁和区",
                  "id": 2310
                },
                {
                  "text": "米易县",
                  "id": 2311
                },
                {
                  "text": "盐边县",
                  "id": 2312
                }
              ]
            },
            {
              "text": "泸州市",
              "id": 2313,
              "c": [
                {
                  "text": "江阳区",
                  "id": 2314
                },
                {
                  "text": "纳溪区",
                  "id": 2315
                },
                {
                  "text": "龙马潭区",
                  "id": 2316
                },
                {
                  "text": "泸县",
                  "id": 2317
                },
                {
                  "text": "合江县",
                  "id": 2318
                },
                {
                  "text": "叙永县",
                  "id": 2319
                },
                {
                  "text": "古蔺县",
                  "id": 2320
                }
              ]
            },
            {
              "text": "德阳市",
              "id": 2321,
              "c": [
                {
                  "text": "旌阳区",
                  "id": 2322
                },
                {
                  "text": "中江县",
                  "id": 2323
                },
                {
                  "text": "罗江县",
                  "id": 2324
                },
                {
                  "text": "广汉市",
                  "id": 2325
                },
                {
                  "text": "什邡市",
                  "id": 2326
                },
                {
                  "text": "绵竹市",
                  "id": 2327
                }
              ]
            },
            {
              "text": "绵阳市",
              "id": 2328,
              "c": [
                {
                  "text": "涪城区",
                  "id": 2329
                },
                {
                  "text": "游仙区",
                  "id": 2330
                },
                {
                  "text": "三台县",
                  "id": 2331
                },
                {
                  "text": "盐亭县",
                  "id": 2332
                },
                {
                  "text": "安县",
                  "id": 2333
                },
                {
                  "text": "梓潼县",
                  "id": 2334
                },
                {
                  "text": "北川羌族自治县",
                  "id": 2335
                },
                {
                  "text": "平武县",
                  "id": 2336
                },
                {
                  "text": "江油市",
                  "id": 2337
                }
              ]
            },
            {
              "text": "广元市",
              "id": 2338,
              "c": [
                {
                  "text": "利州区",
                  "id": 2339
                },
                {
                  "text": "元坝区",
                  "id": 2340
                },
                {
                  "text": "朝天区",
                  "id": 2341
                },
                {
                  "text": "旺苍县",
                  "id": 2342
                },
                {
                  "text": "青川县",
                  "id": 2343
                },
                {
                  "text": "剑阁县",
                  "id": 2344
                },
                {
                  "text": "苍溪县",
                  "id": 2345
                }
              ]
            },
            {
              "text": "遂宁市",
              "id": 2346,
              "c": [
                {
                  "text": "船山区",
                  "id": 2347
                },
                {
                  "text": "安居区",
                  "id": 2348
                },
                {
                  "text": "蓬溪县",
                  "id": 2349
                },
                {
                  "text": "射洪县",
                  "id": 2350
                },
                {
                  "text": "大英县",
                  "id": 2351
                }
              ]
            },
            {
              "text": "内江市",
              "id": 2352,
              "c": [
                {
                  "text": "市中区",
                  "id": 2353
                },
                {
                  "text": "东兴区",
                  "id": 2354
                },
                {
                  "text": "威远县",
                  "id": 2355
                },
                {
                  "text": "资中县",
                  "id": 2356
                },
                {
                  "text": "隆昌县",
                  "id": 2357
                }
              ]
            },
            {
              "text": "乐山市",
              "id": 2358,
              "c": [
                {
                  "text": "市中区",
                  "id": 2359
                },
                {
                  "text": "沙湾区",
                  "id": 2360
                },
                {
                  "text": "五通桥区",
                  "id": 2361
                },
                {
                  "text": "金口河区",
                  "id": 2362
                },
                {
                  "text": "犍为县",
                  "id": 2363
                },
                {
                  "text": "井研县",
                  "id": 2364
                },
                {
                  "text": "夹江县",
                  "id": 2365
                },
                {
                  "text": "沐川县",
                  "id": 2366
                },
                {
                  "text": "峨边彝族自治县",
                  "id": 2367
                },
                {
                  "text": "马边彝族自治县",
                  "id": 2368
                },
                {
                  "text": "峨眉山市",
                  "id": 2369
                }
              ]
            },
            {
              "text": "南充市",
              "id": 2370,
              "c": [
                {
                  "text": "顺庆区",
                  "id": 2371
                },
                {
                  "text": "高坪区",
                  "id": 2372
                },
                {
                  "text": "嘉陵区",
                  "id": 2373
                },
                {
                  "text": "南部县",
                  "id": 2374
                },
                {
                  "text": "营山县",
                  "id": 2375
                },
                {
                  "text": "蓬安县",
                  "id": 2376
                },
                {
                  "text": "仪陇县",
                  "id": 2377
                },
                {
                  "text": "西充县",
                  "id": 2378
                },
                {
                  "text": "阆中市",
                  "id": 2379
                }
              ]
            },
            {
              "text": "眉山市",
              "id": 2380,
              "c": [
                {
                  "text": "东坡区",
                  "id": 2381
                },
                {
                  "text": "仁寿县",
                  "id": 2382
                },
                {
                  "text": "彭山县",
                  "id": 2383
                },
                {
                  "text": "洪雅县",
                  "id": 2384
                },
                {
                  "text": "丹棱县",
                  "id": 2385
                },
                {
                  "text": "青神县",
                  "id": 2386
                }
              ]
            },
            {
              "text": "宜宾市",
              "id": 2387,
              "c": [
                {
                  "text": "翠屏区",
                  "id": 2388
                },
                {
                  "text": "南溪区",
                  "id": 2389
                },
                {
                  "text": "宜宾县",
                  "id": 2390
                },
                {
                  "text": "江安县",
                  "id": 2391
                },
                {
                  "text": "长宁县",
                  "id": 2392
                },
                {
                  "text": "高县",
                  "id": 2393
                },
                {
                  "text": "珙县",
                  "id": 2394
                },
                {
                  "text": "筠连县",
                  "id": 2395
                },
                {
                  "text": "兴文县",
                  "id": 2396
                },
                {
                  "text": "屏山县",
                  "id": 2397
                }
              ]
            },
            {
              "text": "广安市",
              "id": 2398,
              "c": [
                {
                  "text": "广安区",
                  "id": 2399
                },
                {
                  "text": "岳池县",
                  "id": 2400
                },
                {
                  "text": "武胜县",
                  "id": 2401
                },
                {
                  "text": "邻水县",
                  "id": 2402
                },
                {
                  "text": "华蓥市",
                  "id": 2403
                }
              ]
            },
            {
              "text": "达州市",
              "id": 2404,
              "c": [
                {
                  "text": "通川区",
                  "id": 2405
                },
                {
                  "text": "达县",
                  "id": 2406
                },
                {
                  "text": "宣汉县",
                  "id": 2407
                },
                {
                  "text": "开江县",
                  "id": 2408
                },
                {
                  "text": "大竹县",
                  "id": 2409
                },
                {
                  "text": "渠县",
                  "id": 2410
                },
                {
                  "text": "万源市",
                  "id": 2411
                }
              ]
            },
            {
              "text": "雅安市",
              "id": 2412,
              "c": [
                {
                  "text": "雨城区",
                  "id": 2413
                },
                {
                  "text": "名山区",
                  "id": 2414
                },
                {
                  "text": "荥经县",
                  "id": 2415
                },
                {
                  "text": "汉源县",
                  "id": 2416
                },
                {
                  "text": "石棉县",
                  "id": 2417
                },
                {
                  "text": "天全县",
                  "id": 2418
                },
                {
                  "text": "芦山县",
                  "id": 2419
                },
                {
                  "text": "宝兴县",
                  "id": 2420
                }
              ]
            },
            {
              "text": "巴中市",
              "id": 2421,
              "c": [
                {
                  "text": "巴州区",
                  "id": 2422
                },
                {
                  "text": "通江县",
                  "id": 2423
                },
                {
                  "text": "南江县",
                  "id": 2424
                },
                {
                  "text": "平昌县",
                  "id": 2425
                }
              ]
            },
            {
              "text": "资阳市",
              "id": 2426,
              "c": [
                {
                  "text": "雁江区",
                  "id": 2427
                },
                {
                  "text": "安岳县",
                  "id": 2428
                },
                {
                  "text": "乐至县",
                  "id": 2429
                },
                {
                  "text": "简阳市",
                  "id": 2430
                }
              ]
            },
            {
              "text": "阿坝藏族羌族自治州",
              "id": 2431,
              "c": [
                {
                  "text": "汶川县",
                  "id": 2432
                },
                {
                  "text": "理县",
                  "id": 2433
                },
                {
                  "text": "茂县",
                  "id": 2434
                },
                {
                  "text": "松潘县",
                  "id": 2435
                },
                {
                  "text": "九寨沟县",
                  "id": 2436
                },
                {
                  "text": "金川县",
                  "id": 2437
                },
                {
                  "text": "小金县",
                  "id": 2438
                },
                {
                  "text": "黑水县",
                  "id": 2439
                },
                {
                  "text": "马尔康县",
                  "id": 2440
                },
                {
                  "text": "壤塘县",
                  "id": 2441
                },
                {
                  "text": "阿坝县",
                  "id": 2442
                },
                {
                  "text": "若尔盖县",
                  "id": 2443
                },
                {
                  "text": "红原县",
                  "id": 2444
                }
              ]
            },
            {
              "text": "甘孜藏族自治州",
              "id": 2445,
              "c": [
                {
                  "text": "康定县",
                  "id": 2446
                },
                {
                  "text": "泸定县",
                  "id": 2447
                },
                {
                  "text": "丹巴县",
                  "id": 2448
                },
                {
                  "text": "九龙县",
                  "id": 2449
                },
                {
                  "text": "雅江县",
                  "id": 2450
                },
                {
                  "text": "道孚县",
                  "id": 2451
                },
                {
                  "text": "炉霍县",
                  "id": 2452
                },
                {
                  "text": "甘孜县",
                  "id": 2453
                },
                {
                  "text": "新龙县",
                  "id": 2454
                },
                {
                  "text": "德格县",
                  "id": 2455
                },
                {
                  "text": "白玉县",
                  "id": 2456
                },
                {
                  "text": "石渠县",
                  "id": 2457
                },
                {
                  "text": "色达县",
                  "id": 2458
                },
                {
                  "text": "理塘县",
                  "id": 2459
                },
                {
                  "text": "巴塘县",
                  "id": 2460
                },
                {
                  "text": "乡城县",
                  "id": 2461
                },
                {
                  "text": "稻城县",
                  "id": 2462
                },
                {
                  "text": "得荣县",
                  "id": 2463
                }
              ]
            },
            {
              "text": "凉山彝族自治州",
              "id": 2464,
              "c": [
                {
                  "text": "西昌市",
                  "id": 2465
                },
                {
                  "text": "木里藏族自治县",
                  "id": 2466
                },
                {
                  "text": "盐源县",
                  "id": 2467
                },
                {
                  "text": "德昌县",
                  "id": 2468
                },
                {
                  "text": "会理县",
                  "id": 2469
                },
                {
                  "text": "会东县",
                  "id": 2470
                },
                {
                  "text": "宁南县",
                  "id": 2471
                },
                {
                  "text": "普格县",
                  "id": 2472
                },
                {
                  "text": "布拖县",
                  "id": 2473
                },
                {
                  "text": "金阳县",
                  "id": 2474
                },
                {
                  "text": "昭觉县",
                  "id": 2475
                },
                {
                  "text": "喜德县",
                  "id": 2476
                },
                {
                  "text": "冕宁县",
                  "id": 2477
                },
                {
                  "text": "越西县",
                  "id": 2478
                },
                {
                  "text": "甘洛县",
                  "id": 2479
                },
                {
                  "text": "美姑县",
                  "id": 2480
                },
                {
                  "text": "雷波县",
                  "id": 2481
                }
              ]
            }
          ]
        },
        {
          "text": "贵州省",
          "id": 2482,
          "c": [
            {
              "text": "贵阳市",
              "id": 2483,
              "c": [
                {
                  "text": "南明区",
                  "id": 2484
                },
                {
                  "text": "云岩区",
                  "id": 2485
                },
                {
                  "text": "花溪区",
                  "id": 2486
                },
                {
                  "text": "乌当区",
                  "id": 2487
                },
                {
                  "text": "白云区",
                  "id": 2488
                },
                {
                  "text": "小河区",
                  "id": 2489
                },
                {
                  "text": "开阳县",
                  "id": 2490
                },
                {
                  "text": "息烽县",
                  "id": 2491
                },
                {
                  "text": "修文县",
                  "id": 2492
                },
                {
                  "text": "清镇市",
                  "id": 2493
                }
              ]
            },
            {
              "text": "六盘水市",
              "id": 2494,
              "c": [
                {
                  "text": "钟山区",
                  "id": 2495
                },
                {
                  "text": "六枝特区",
                  "id": 2496
                },
                {
                  "text": "水城县",
                  "id": 2497
                },
                {
                  "text": "盘县",
                  "id": 2498
                }
              ]
            },
            {
              "text": "遵义市",
              "id": 2499,
              "c": [
                {
                  "text": "红花岗区",
                  "id": 2500
                },
                {
                  "text": "汇川区",
                  "id": 2501
                },
                {
                  "text": "遵义县",
                  "id": 2502
                },
                {
                  "text": "桐梓县",
                  "id": 2503
                },
                {
                  "text": "绥阳县",
                  "id": 2504
                },
                {
                  "text": "正安县",
                  "id": 2505
                },
                {
                  "text": "道真仡佬族苗族自治县",
                  "id": 2506
                },
                {
                  "text": "务川仡佬族苗族自治县",
                  "id": 2507
                },
                {
                  "text": "凤冈县",
                  "id": 2508
                },
                {
                  "text": "湄潭县",
                  "id": 2509
                },
                {
                  "text": "余庆县",
                  "id": 2510
                },
                {
                  "text": "习水县",
                  "id": 2511
                },
                {
                  "text": "赤水市",
                  "id": 2512
                },
                {
                  "text": "仁怀市",
                  "id": 2513
                }
              ]
            },
            {
              "text": "安顺市",
              "id": 2514,
              "c": [
                {
                  "text": "西秀区",
                  "id": 2515
                },
                {
                  "text": "平坝县",
                  "id": 2516
                },
                {
                  "text": "普定县",
                  "id": 2517
                },
                {
                  "text": "镇宁布依族苗族自治县",
                  "id": 2518
                },
                {
                  "text": "关岭布依族苗族自治县",
                  "id": 2519
                },
                {
                  "text": "紫云苗族布依族自治县",
                  "id": 2520
                }
              ]
            },
            {
              "text": "毕节市",
              "id": 2521,
              "c": [
                {
                  "text": "七星关区",
                  "id": 2522
                },
                {
                  "text": "大方县",
                  "id": 2523
                },
                {
                  "text": "黔西县",
                  "id": 2524
                },
                {
                  "text": "金沙县",
                  "id": 2525
                },
                {
                  "text": "织金县",
                  "id": 2526
                },
                {
                  "text": "纳雍县",
                  "id": 2527
                },
                {
                  "text": "威宁彝族回族苗族自治县",
                  "id": 2528
                },
                {
                  "text": "赫章县",
                  "id": 2529
                }
              ]
            },
            {
              "text": "铜仁市",
              "id": 2530,
              "c": [
                {
                  "text": "碧江区",
                  "id": 2531
                },
                {
                  "text": "万山区",
                  "id": 2532
                },
                {
                  "text": "江口县",
                  "id": 2533
                },
                {
                  "text": "玉屏侗族自治县",
                  "id": 2534
                },
                {
                  "text": "石阡县",
                  "id": 2535
                },
                {
                  "text": "思南县",
                  "id": 2536
                },
                {
                  "text": "印江土家族苗族自治县",
                  "id": 2537
                },
                {
                  "text": "德江县",
                  "id": 2538
                },
                {
                  "text": "沿河土家族自治县",
                  "id": 2539
                },
                {
                  "text": "松桃苗族自治县",
                  "id": 2540
                }
              ]
            },
            {
              "text": "黔西南布依族苗族自治州",
              "id": 2541,
              "c": [
                {
                  "text": "兴义市",
                  "id": 2542
                },
                {
                  "text": "兴仁县",
                  "id": 2543
                },
                {
                  "text": "普安县",
                  "id": 2544
                },
                {
                  "text": "晴隆县",
                  "id": 2545
                },
                {
                  "text": "贞丰县",
                  "id": 2546
                },
                {
                  "text": "望谟县",
                  "id": 2547
                },
                {
                  "text": "册亨县",
                  "id": 2548
                },
                {
                  "text": "安龙县",
                  "id": 2549
                }
              ]
            },
            {
              "text": "黔东南苗族侗族自治州",
              "id": 2550,
              "c": [
                {
                  "text": "凯里市",
                  "id": 2551
                },
                {
                  "text": "黄平县",
                  "id": 2552
                },
                {
                  "text": "施秉县",
                  "id": 2553
                },
                {
                  "text": "三穗县",
                  "id": 2554
                },
                {
                  "text": "镇远县",
                  "id": 2555
                },
                {
                  "text": "岑巩县",
                  "id": 2556
                },
                {
                  "text": "天柱县",
                  "id": 2557
                },
                {
                  "text": "锦屏县",
                  "id": 2558
                },
                {
                  "text": "剑河县",
                  "id": 2559
                },
                {
                  "text": "台江县",
                  "id": 2560
                },
                {
                  "text": "黎平县",
                  "id": 2561
                },
                {
                  "text": "榕江县",
                  "id": 2562
                },
                {
                  "text": "从江县",
                  "id": 2563
                },
                {
                  "text": "雷山县",
                  "id": 2564
                },
                {
                  "text": "麻江县",
                  "id": 2565
                },
                {
                  "text": "丹寨县",
                  "id": 2566
                }
              ]
            },
            {
              "text": "黔南布依族苗族自治州",
              "id": 2567,
              "c": [
                {
                  "text": "都匀市",
                  "id": 2568
                },
                {
                  "text": "福泉市",
                  "id": 2569
                },
                {
                  "text": "荔波县",
                  "id": 2570
                },
                {
                  "text": "贵定县",
                  "id": 2571
                },
                {
                  "text": "瓮安县",
                  "id": 2572
                },
                {
                  "text": "独山县",
                  "id": 2573
                },
                {
                  "text": "平塘县",
                  "id": 2574
                },
                {
                  "text": "罗甸县",
                  "id": 2575
                },
                {
                  "text": "长顺县",
                  "id": 2576
                },
                {
                  "text": "龙里县",
                  "id": 2577
                },
                {
                  "text": "惠水县",
                  "id": 2578
                },
                {
                  "text": "三都水族自治县",
                  "id": 2579
                }
              ]
            }
          ]
        },
        {
          "text": "云南省",
          "id": 2580,
          "c": [
            {
              "text": "昆明市",
              "id": 2581,
              "c": [
                {
                  "text": "五华区",
                  "id": 2582
                },
                {
                  "text": "盘龙区",
                  "id": 2583
                },
                {
                  "text": "官渡区",
                  "id": 2584
                },
                {
                  "text": "西山区",
                  "id": 2585
                },
                {
                  "text": "东川区",
                  "id": 2586
                },
                {
                  "text": "呈贡区",
                  "id": 2587
                },
                {
                  "text": "晋宁县",
                  "id": 2588
                },
                {
                  "text": "富民县",
                  "id": 2589
                },
                {
                  "text": "宜良县",
                  "id": 2590
                },
                {
                  "text": "石林彝族自治县",
                  "id": 2591
                },
                {
                  "text": "嵩明县",
                  "id": 2592
                },
                {
                  "text": "禄劝彝族苗族自治县",
                  "id": 2593
                },
                {
                  "text": "寻甸回族彝族自治县",
                  "id": 2594
                },
                {
                  "text": "安宁市",
                  "id": 2595
                }
              ]
            },
            {
              "text": "曲靖市",
              "id": 2596,
              "c": [
                {
                  "text": "麒麟区",
                  "id": 2597
                },
                {
                  "text": "马龙县",
                  "id": 2598
                },
                {
                  "text": "陆良县",
                  "id": 2599
                },
                {
                  "text": "师宗县",
                  "id": 2600
                },
                {
                  "text": "罗平县",
                  "id": 2601
                },
                {
                  "text": "富源县",
                  "id": 2602
                },
                {
                  "text": "会泽县",
                  "id": 2603
                },
                {
                  "text": "沾益县",
                  "id": 2604
                },
                {
                  "text": "宣威市",
                  "id": 2605
                }
              ]
            },
            {
              "text": "玉溪市",
              "id": 2606,
              "c": [
                {
                  "text": "红塔区",
                  "id": 2607
                },
                {
                  "text": "江川县",
                  "id": 2608
                },
                {
                  "text": "澄江县",
                  "id": 2609
                },
                {
                  "text": "通海县",
                  "id": 2610
                },
                {
                  "text": "华宁县",
                  "id": 2611
                },
                {
                  "text": "易门县",
                  "id": 2612
                },
                {
                  "text": "峨山彝族自治县",
                  "id": 2613
                },
                {
                  "text": "新平彝族傣族自治县",
                  "id": 2614
                },
                {
                  "text": "元江哈尼族彝族傣族自治县",
                  "id": 2615
                }
              ]
            },
            {
              "text": "保山市",
              "id": 2616,
              "c": [
                {
                  "text": "隆阳区",
                  "id": 2617
                },
                {
                  "text": "施甸县",
                  "id": 2618
                },
                {
                  "text": "腾冲县",
                  "id": 2619
                },
                {
                  "text": "龙陵县",
                  "id": 2620
                },
                {
                  "text": "昌宁县",
                  "id": 2621
                }
              ]
            },
            {
              "text": "昭通市",
              "id": 2622,
              "c": [
                {
                  "text": "昭阳区",
                  "id": 2623
                },
                {
                  "text": "鲁甸县",
                  "id": 2624
                },
                {
                  "text": "巧家县",
                  "id": 2625
                },
                {
                  "text": "盐津县",
                  "id": 2626
                },
                {
                  "text": "大关县",
                  "id": 2627
                },
                {
                  "text": "永善县",
                  "id": 2628
                },
                {
                  "text": "绥江县",
                  "id": 2629
                },
                {
                  "text": "镇雄县",
                  "id": 2630
                },
                {
                  "text": "彝良县",
                  "id": 2631
                },
                {
                  "text": "威信县",
                  "id": 2632
                },
                {
                  "text": "水富县",
                  "id": 2633
                }
              ]
            },
            {
              "text": "丽江市",
              "id": 2634,
              "c": [
                {
                  "text": "古城区",
                  "id": 2635
                },
                {
                  "text": "玉龙纳西族自治县",
                  "id": 2636
                },
                {
                  "text": "永胜县",
                  "id": 2637
                },
                {
                  "text": "华坪县",
                  "id": 2638
                },
                {
                  "text": "宁蒗彝族自治县",
                  "id": 2639
                }
              ]
            },
            {
              "text": "普洱市",
              "id": 2640,
              "c": [
                {
                  "text": "思茅区",
                  "id": 2641
                },
                {
                  "text": "宁洱哈尼族彝族自治县",
                  "id": 2642
                },
                {
                  "text": "墨江哈尼族自治县",
                  "id": 2643
                },
                {
                  "text": "景东彝族自治县",
                  "id": 2644
                },
                {
                  "text": "景谷傣族彝族自治县",
                  "id": 2645
                },
                {
                  "text": "镇沅彝族哈尼族拉祜族自治县",
                  "id": 2646
                },
                {
                  "text": "江城哈尼族彝族自治县",
                  "id": 2647
                },
                {
                  "text": "孟连傣族拉祜族佤族自治县",
                  "id": 2648
                },
                {
                  "text": "澜沧拉祜族自治县",
                  "id": 2649
                },
                {
                  "text": "西盟佤族自治县",
                  "id": 2650
                }
              ]
            },
            {
              "text": "临沧市",
              "id": 2651,
              "c": [
                {
                  "text": "临翔区",
                  "id": 2652
                },
                {
                  "text": "凤庆县",
                  "id": 2653
                },
                {
                  "text": "云县",
                  "id": 2654
                },
                {
                  "text": "永德县",
                  "id": 2655
                },
                {
                  "text": "镇康县",
                  "id": 2656
                },
                {
                  "text": "双江拉祜族佤族布朗族傣族自治县",
                  "id": 2657
                },
                {
                  "text": "耿马傣族佤族自治县",
                  "id": 2658
                },
                {
                  "text": "沧源佤族自治县",
                  "id": 2659
                }
              ]
            },
            {
              "text": "楚雄彝族自治州",
              "id": 2660,
              "c": [
                {
                  "text": "楚雄市",
                  "id": 2661
                },
                {
                  "text": "双柏县",
                  "id": 2662
                },
                {
                  "text": "牟定县",
                  "id": 2663
                },
                {
                  "text": "南华县",
                  "id": 2664
                },
                {
                  "text": "姚安县",
                  "id": 2665
                },
                {
                  "text": "大姚县",
                  "id": 2666
                },
                {
                  "text": "永仁县",
                  "id": 2667
                },
                {
                  "text": "元谋县",
                  "id": 2668
                },
                {
                  "text": "武定县",
                  "id": 2669
                },
                {
                  "text": "禄丰县",
                  "id": 2670
                }
              ]
            },
            {
              "text": "红河哈尼族彝族自治州",
              "id": 2671,
              "c": [
                {
                  "text": "个旧市",
                  "id": 2672
                },
                {
                  "text": "开远市",
                  "id": 2673
                },
                {
                  "text": "蒙自市",
                  "id": 2674
                },
                {
                  "text": "屏边苗族自治县",
                  "id": 2675
                },
                {
                  "text": "建水县",
                  "id": 2676
                },
                {
                  "text": "石屏县",
                  "id": 2677
                },
                {
                  "text": "弥勒县",
                  "id": 2678
                },
                {
                  "text": "泸西县",
                  "id": 2679
                },
                {
                  "text": "元阳县",
                  "id": 2680
                },
                {
                  "text": "红河县",
                  "id": 2681
                },
                {
                  "text": "金平苗族瑶族傣族自治县",
                  "id": 2682
                },
                {
                  "text": "绿春县",
                  "id": 2683
                },
                {
                  "text": "河口瑶族自治县",
                  "id": 2684
                }
              ]
            },
            {
              "text": "文山壮族苗族自治州",
              "id": 2685,
              "c": [
                {
                  "text": "文山市",
                  "id": 2686
                },
                {
                  "text": "砚山县",
                  "id": 2687
                },
                {
                  "text": "西畴县",
                  "id": 2688
                },
                {
                  "text": "麻栗坡县",
                  "id": 2689
                },
                {
                  "text": "马关县",
                  "id": 2690
                },
                {
                  "text": "丘北县",
                  "id": 2691
                },
                {
                  "text": "广南县",
                  "id": 2692
                },
                {
                  "text": "富宁县",
                  "id": 2693
                }
              ]
            },
            {
              "text": "西双版纳傣族自治州",
              "id": 2694,
              "c": [
                {
                  "text": "景洪市",
                  "id": 2695
                },
                {
                  "text": "勐海县",
                  "id": 2696
                },
                {
                  "text": "勐腊县",
                  "id": 2697
                }
              ]
            },
            {
              "text": "大理白族自治州",
              "id": 2698,
              "c": [
                {
                  "text": "大理市",
                  "id": 2699
                },
                {
                  "text": "漾濞彝族自治县",
                  "id": 2700
                },
                {
                  "text": "祥云县",
                  "id": 2701
                },
                {
                  "text": "宾川县",
                  "id": 2702
                },
                {
                  "text": "弥渡县",
                  "id": 2703
                },
                {
                  "text": "南涧彝族自治县",
                  "id": 2704
                },
                {
                  "text": "巍山彝族回族自治县",
                  "id": 2705
                },
                {
                  "text": "永平县",
                  "id": 2706
                },
                {
                  "text": "云龙县",
                  "id": 2707
                },
                {
                  "text": "洱源县",
                  "id": 2708
                },
                {
                  "text": "剑川县",
                  "id": 2709
                },
                {
                  "text": "鹤庆县",
                  "id": 2710
                }
              ]
            },
            {
              "text": "德宏傣族景颇族自治州",
              "id": 2711,
              "c": [
                {
                  "text": "瑞丽市",
                  "id": 2712
                },
                {
                  "text": "芒市",
                  "id": 2713
                },
                {
                  "text": "梁河县",
                  "id": 2714
                },
                {
                  "text": "盈江县",
                  "id": 2715
                },
                {
                  "text": "陇川县",
                  "id": 2716
                }
              ]
            },
            {
              "text": "怒江傈僳族自治州",
              "id": 2717,
              "c": [
                {
                  "text": "泸水县",
                  "id": 2718
                },
                {
                  "text": "福贡县",
                  "id": 2719
                },
                {
                  "text": "贡山独龙族怒族自治县",
                  "id": 2720
                },
                {
                  "text": "兰坪白族普米族自治县",
                  "id": 2721
                }
              ]
            },
            {
              "text": "迪庆藏族自治州",
              "id": 2722,
              "c": [
                {
                  "text": "香格里拉县",
                  "id": 2723
                },
                {
                  "text": "德钦县",
                  "id": 2724
                },
                {
                  "text": "维西傈僳族自治县",
                  "id": 2725
                }
              ]
            }
          ]
        },
        {
          "text": "西藏自治区",
          "id": 2726,
          "c": [
            {
              "text": "拉萨市",
              "id": 2727,
              "c": [
                {
                  "text": "城关区",
                  "id": 2728
                },
                {
                  "text": "林周县",
                  "id": 2729
                },
                {
                  "text": "当雄县",
                  "id": 2730
                },
                {
                  "text": "尼木县",
                  "id": 2731
                },
                {
                  "text": "曲水县",
                  "id": 2732
                },
                {
                  "text": "堆龙德庆县",
                  "id": 2733
                },
                {
                  "text": "达孜县",
                  "id": 2734
                },
                {
                  "text": "墨竹工卡县",
                  "id": 2735
                }
              ]
            },
            {
              "text": "昌都地区",
              "id": 2736,
              "c": [
                {
                  "text": "昌都县",
                  "id": 2737
                },
                {
                  "text": "江达县",
                  "id": 2738
                },
                {
                  "text": "贡觉县",
                  "id": 2739
                },
                {
                  "text": "类乌齐县",
                  "id": 2740
                },
                {
                  "text": "丁青县",
                  "id": 2741
                },
                {
                  "text": "察雅县",
                  "id": 2742
                },
                {
                  "text": "八宿县",
                  "id": 2743
                },
                {
                  "text": "左贡县",
                  "id": 2744
                },
                {
                  "text": "芒康县",
                  "id": 2745
                },
                {
                  "text": "洛隆县",
                  "id": 2746
                },
                {
                  "text": "边坝县",
                  "id": 2747
                }
              ]
            },
            {
              "text": "山南地区",
              "id": 2748,
              "c": [
                {
                  "text": "乃东县",
                  "id": 2749
                },
                {
                  "text": "扎囊县",
                  "id": 2750
                },
                {
                  "text": "贡嘎县",
                  "id": 2751
                },
                {
                  "text": "桑日县",
                  "id": 2752
                },
                {
                  "text": "琼结县",
                  "id": 2753
                },
                {
                  "text": "曲松县",
                  "id": 2754
                },
                {
                  "text": "措美县",
                  "id": 2755
                },
                {
                  "text": "洛扎县",
                  "id": 2756
                },
                {
                  "text": "加查县",
                  "id": 2757
                },
                {
                  "text": "隆子县",
                  "id": 2758
                },
                {
                  "text": "错那县",
                  "id": 2759
                },
                {
                  "text": "浪卡子县",
                  "id": 2760
                }
              ]
            },
            {
              "text": "日喀则地区",
              "id": 2761,
              "c": [
                {
                  "text": "日喀则市",
                  "id": 2762
                },
                {
                  "text": "南木林县",
                  "id": 2763
                },
                {
                  "text": "江孜县",
                  "id": 2764
                },
                {
                  "text": "定日县",
                  "id": 2765
                },
                {
                  "text": "萨迦县",
                  "id": 2766
                },
                {
                  "text": "拉孜县",
                  "id": 2767
                },
                {
                  "text": "昂仁县",
                  "id": 2768
                },
                {
                  "text": "谢通门县",
                  "id": 2769
                },
                {
                  "text": "白朗县",
                  "id": 2770
                },
                {
                  "text": "仁布县",
                  "id": 2771
                },
                {
                  "text": "康马县",
                  "id": 2772
                },
                {
                  "text": "定结县",
                  "id": 2773
                },
                {
                  "text": "仲巴县",
                  "id": 2774
                },
                {
                  "text": "亚东县",
                  "id": 2775
                },
                {
                  "text": "吉隆县",
                  "id": 2776
                },
                {
                  "text": "聂拉木县",
                  "id": 2777
                },
                {
                  "text": "萨嘎县",
                  "id": 2778
                },
                {
                  "text": "岗巴县",
                  "id": 2779
                }
              ]
            },
            {
              "text": "那曲地区",
              "id": 2780,
              "c": [
                {
                  "text": "那曲县",
                  "id": 2781
                },
                {
                  "text": "嘉黎县",
                  "id": 2782
                },
                {
                  "text": "比如县",
                  "id": 2783
                },
                {
                  "text": "聂荣县",
                  "id": 2784
                },
                {
                  "text": "安多县",
                  "id": 2785
                },
                {
                  "text": "申扎县",
                  "id": 2786
                },
                {
                  "text": "索县",
                  "id": 2787
                },
                {
                  "text": "班戈县",
                  "id": 2788
                },
                {
                  "text": "巴青县",
                  "id": 2789
                },
                {
                  "text": "尼玛县",
                  "id": 2790
                }
              ]
            },
            {
              "text": "阿里地区",
              "id": 2791,
              "c": [
                {
                  "text": "普兰县",
                  "id": 2792
                },
                {
                  "text": "札达县",
                  "id": 2793
                },
                {
                  "text": "噶尔县",
                  "id": 2794
                },
                {
                  "text": "日土县",
                  "id": 2795
                },
                {
                  "text": "革吉县",
                  "id": 2796
                },
                {
                  "text": "改则县",
                  "id": 2797
                },
                {
                  "text": "措勤县",
                  "id": 2798
                }
              ]
            },
            {
              "text": "林芝地区",
              "id": 2799,
              "c": [
                {
                  "text": "林芝县",
                  "id": 2800
                },
                {
                  "text": "工布江达县",
                  "id": 2801
                },
                {
                  "text": "米林县",
                  "id": 2802
                },
                {
                  "text": "墨脱县",
                  "id": 2803
                },
                {
                  "text": "波密县",
                  "id": 2804
                },
                {
                  "text": "察隅县",
                  "id": 2805
                },
                {
                  "text": "朗县",
                  "id": 2806
                }
              ]
            }
          ]
        },
        {
          "text": "陕西省",
          "id": 2807,
          "c": [
            {
              "text": "西安市",
              "id": 2808,
              "c": [
                {
                  "text": "新城区",
                  "id": 2809
                },
                {
                  "text": "碑林区",
                  "id": 2810
                },
                {
                  "text": "莲湖区",
                  "id": 2811
                },
                {
                  "text": "灞桥区",
                  "id": 2812
                },
                {
                  "text": "未央区",
                  "id": 2813
                },
                {
                  "text": "雁塔区",
                  "id": 2814
                },
                {
                  "text": "阎良区",
                  "id": 2815
                },
                {
                  "text": "临潼区",
                  "id": 2816
                },
                {
                  "text": "长安区",
                  "id": 2817
                },
                {
                  "text": "蓝田县",
                  "id": 2818
                },
                {
                  "text": "周至县",
                  "id": 2819
                },
                {
                  "text": "户县",
                  "id": 2820
                },
                {
                  "text": "高陵县",
                  "id": 2821
                }
              ]
            },
            {
              "text": "铜川市",
              "id": 2822,
              "c": [
                {
                  "text": "王益区",
                  "id": 2823
                },
                {
                  "text": "印台区",
                  "id": 2824
                },
                {
                  "text": "耀州区",
                  "id": 2825
                },
                {
                  "text": "宜君县",
                  "id": 2826
                }
              ]
            },
            {
              "text": "宝鸡市",
              "id": 2827,
              "c": [
                {
                  "text": "渭滨区",
                  "id": 2828
                },
                {
                  "text": "金台区",
                  "id": 2829
                },
                {
                  "text": "陈仓区",
                  "id": 2830
                },
                {
                  "text": "凤翔县",
                  "id": 2831
                },
                {
                  "text": "岐山县",
                  "id": 2832
                },
                {
                  "text": "扶风县",
                  "id": 2833
                },
                {
                  "text": "眉县",
                  "id": 2834
                },
                {
                  "text": "陇县",
                  "id": 2835
                },
                {
                  "text": "千阳县",
                  "id": 2836
                },
                {
                  "text": "麟游县",
                  "id": 2837
                },
                {
                  "text": "凤县",
                  "id": 2838
                },
                {
                  "text": "太白县",
                  "id": 2839
                }
              ]
            },
            {
              "text": "咸阳市",
              "id": 2840,
              "c": [
                {
                  "text": "秦都区",
                  "id": 2841
                },
                {
                  "text": "杨陵区",
                  "id": 2842
                },
                {
                  "text": "渭城区",
                  "id": 2843
                },
                {
                  "text": "三原县",
                  "id": 2844
                },
                {
                  "text": "泾阳县",
                  "id": 2845
                },
                {
                  "text": "乾县",
                  "id": 2846
                },
                {
                  "text": "礼泉县",
                  "id": 2847
                },
                {
                  "text": "永寿县",
                  "id": 2848
                },
                {
                  "text": "彬县",
                  "id": 2849
                },
                {
                  "text": "长武县",
                  "id": 2850
                },
                {
                  "text": "旬邑县",
                  "id": 2851
                },
                {
                  "text": "淳化县",
                  "id": 2852
                },
                {
                  "text": "武功县",
                  "id": 2853
                },
                {
                  "text": "兴平市",
                  "id": 2854
                }
              ]
            },
            {
              "text": "渭南市",
              "id": 2855,
              "c": [
                {
                  "text": "临渭区",
                  "id": 2856
                },
                {
                  "text": "华县",
                  "id": 2857
                },
                {
                  "text": "潼关县",
                  "id": 2858
                },
                {
                  "text": "大荔县",
                  "id": 2859
                },
                {
                  "text": "合阳县",
                  "id": 2860
                },
                {
                  "text": "澄城县",
                  "id": 2861
                },
                {
                  "text": "蒲城县",
                  "id": 2862
                },
                {
                  "text": "白水县",
                  "id": 2863
                },
                {
                  "text": "富平县",
                  "id": 2864
                },
                {
                  "text": "韩城市",
                  "id": 2865
                },
                {
                  "text": "华阴市",
                  "id": 2866
                }
              ]
            },
            {
              "text": "延安市",
              "id": 2867,
              "c": [
                {
                  "text": "宝塔区",
                  "id": 2868
                },
                {
                  "text": "延长县",
                  "id": 2869
                },
                {
                  "text": "延川县",
                  "id": 2870
                },
                {
                  "text": "子长县",
                  "id": 2871
                },
                {
                  "text": "安塞县",
                  "id": 2872
                },
                {
                  "text": "志丹县",
                  "id": 2873
                },
                {
                  "text": "吴起县",
                  "id": 2874
                },
                {
                  "text": "甘泉县",
                  "id": 2875
                },
                {
                  "text": "富县",
                  "id": 2876
                },
                {
                  "text": "洛川县",
                  "id": 2877
                },
                {
                  "text": "宜川县",
                  "id": 2878
                },
                {
                  "text": "黄龙县",
                  "id": 2879
                },
                {
                  "text": "黄陵县",
                  "id": 2880
                }
              ]
            },
            {
              "text": "汉中市",
              "id": 2881,
              "c": [
                {
                  "text": "汉台区",
                  "id": 2882
                },
                {
                  "text": "南郑县",
                  "id": 2883
                },
                {
                  "text": "城固县",
                  "id": 2884
                },
                {
                  "text": "洋县",
                  "id": 2885
                },
                {
                  "text": "西乡县",
                  "id": 2886
                },
                {
                  "text": "勉县",
                  "id": 2887
                },
                {
                  "text": "宁强县",
                  "id": 2888
                },
                {
                  "text": "略阳县",
                  "id": 2889
                },
                {
                  "text": "镇巴县",
                  "id": 2890
                },
                {
                  "text": "留坝县",
                  "id": 2891
                },
                {
                  "text": "佛坪县",
                  "id": 2892
                }
              ]
            },
            {
              "text": "榆林市",
              "id": 2893,
              "c": [
                {
                  "text": "榆阳区",
                  "id": 2894
                },
                {
                  "text": "神木县",
                  "id": 2895
                },
                {
                  "text": "府谷县",
                  "id": 2896
                },
                {
                  "text": "横山县",
                  "id": 2897
                },
                {
                  "text": "靖边县",
                  "id": 2898
                },
                {
                  "text": "定边县",
                  "id": 2899
                },
                {
                  "text": "绥德县",
                  "id": 2900
                },
                {
                  "text": "米脂县",
                  "id": 2901
                },
                {
                  "text": "佳县",
                  "id": 2902
                },
                {
                  "text": "吴堡县",
                  "id": 2903
                },
                {
                  "text": "清涧县",
                  "id": 2904
                },
                {
                  "text": "子洲县",
                  "id": 2905
                }
              ]
            },
            {
              "text": "安康市",
              "id": 2906,
              "c": [
                {
                  "text": "汉滨区",
                  "id": 2907
                },
                {
                  "text": "汉阴县",
                  "id": 2908
                },
                {
                  "text": "石泉县",
                  "id": 2909
                },
                {
                  "text": "宁陕县",
                  "id": 2910
                },
                {
                  "text": "紫阳县",
                  "id": 2911
                },
                {
                  "text": "岚皋县",
                  "id": 2912
                },
                {
                  "text": "平利县",
                  "id": 2913
                },
                {
                  "text": "镇坪县",
                  "id": 2914
                },
                {
                  "text": "旬阳县",
                  "id": 2915
                },
                {
                  "text": "白河县",
                  "id": 2916
                }
              ]
            },
            {
              "text": "商洛市",
              "id": 2917,
              "c": [
                {
                  "text": "商州区",
                  "id": 2918
                },
                {
                  "text": "洛南县",
                  "id": 2919
                },
                {
                  "text": "丹凤县",
                  "id": 2920
                },
                {
                  "text": "商南县",
                  "id": 2921
                },
                {
                  "text": "山阳县",
                  "id": 2922
                },
                {
                  "text": "镇安县",
                  "id": 2923
                },
                {
                  "text": "柞水县",
                  "id": 2924
                }
              ]
            }
          ]
        },
        {
          "text": "甘肃省",
          "id": 2925,
          "c": [
            {
              "text": "兰州市",
              "id": 2926,
              "c": [
                {
                  "text": "城关区",
                  "id": 2927
                },
                {
                  "text": "七里河区",
                  "id": 2928
                },
                {
                  "text": "西固区",
                  "id": 2929
                },
                {
                  "text": "安宁区",
                  "id": 2930
                },
                {
                  "text": "红古区",
                  "id": 2931
                },
                {
                  "text": "永登县",
                  "id": 2932
                },
                {
                  "text": "皋兰县",
                  "id": 2933
                },
                {
                  "text": "榆中县",
                  "id": 2934
                }
              ]
            },
            {
              "text": "嘉峪关市",
              "id": 2935,
              "c": []
            },
            {
              "text": "金昌市",
              "id": 2936,
              "c": [
                {
                  "text": "金川区",
                  "id": 2937
                },
                {
                  "text": "永昌县",
                  "id": 2938
                }
              ]
            },
            {
              "text": "白银市",
              "id": 2939,
              "c": [
                {
                  "text": "白银区",
                  "id": 2940
                },
                {
                  "text": "平川区",
                  "id": 2941
                },
                {
                  "text": "靖远县",
                  "id": 2942
                },
                {
                  "text": "会宁县",
                  "id": 2943
                },
                {
                  "text": "景泰县",
                  "id": 2944
                }
              ]
            },
            {
              "text": "天水市",
              "id": 2945,
              "c": [
                {
                  "text": "秦州区",
                  "id": 2946
                },
                {
                  "text": "麦积区",
                  "id": 2947
                },
                {
                  "text": "清水县",
                  "id": 2948
                },
                {
                  "text": "秦安县",
                  "id": 2949
                },
                {
                  "text": "甘谷县",
                  "id": 2950
                },
                {
                  "text": "武山县",
                  "id": 2951
                },
                {
                  "text": "张家川回族自治县",
                  "id": 2952
                }
              ]
            },
            {
              "text": "武威市",
              "id": 2953,
              "c": [
                {
                  "text": "凉州区",
                  "id": 2954
                },
                {
                  "text": "民勤县",
                  "id": 2955
                },
                {
                  "text": "古浪县",
                  "id": 2956
                },
                {
                  "text": "天祝藏族自治县",
                  "id": 2957
                }
              ]
            },
            {
              "text": "张掖市",
              "id": 2958,
              "c": [
                {
                  "text": "甘州区",
                  "id": 2959
                },
                {
                  "text": "肃南裕固族自治县",
                  "id": 2960
                },
                {
                  "text": "民乐县",
                  "id": 2961
                },
                {
                  "text": "临泽县",
                  "id": 2962
                },
                {
                  "text": "高台县",
                  "id": 2963
                },
                {
                  "text": "山丹县",
                  "id": 2964
                }
              ]
            },
            {
              "text": "平凉市",
              "id": 2965,
              "c": [
                {
                  "text": "崆峒区",
                  "id": 2966
                },
                {
                  "text": "泾川县",
                  "id": 2967
                },
                {
                  "text": "灵台县",
                  "id": 2968
                },
                {
                  "text": "崇信县",
                  "id": 2969
                },
                {
                  "text": "华亭县",
                  "id": 2970
                },
                {
                  "text": "庄浪县",
                  "id": 2971
                },
                {
                  "text": "静宁县",
                  "id": 2972
                }
              ]
            },
            {
              "text": "酒泉市",
              "id": 2973,
              "c": [
                {
                  "text": "肃州区",
                  "id": 2974
                },
                {
                  "text": "金塔县",
                  "id": 2975
                },
                {
                  "text": "瓜州县",
                  "id": 2976
                },
                {
                  "text": "肃北蒙古族自治县",
                  "id": 2977
                },
                {
                  "text": "阿克塞哈萨克族自治县",
                  "id": 2978
                },
                {
                  "text": "玉门市",
                  "id": 2979
                },
                {
                  "text": "敦煌市",
                  "id": 2980
                }
              ]
            },
            {
              "text": "庆阳市",
              "id": 2981,
              "c": [
                {
                  "text": "西峰区",
                  "id": 2982
                },
                {
                  "text": "庆城县",
                  "id": 2983
                },
                {
                  "text": "环县",
                  "id": 2984
                },
                {
                  "text": "华池县",
                  "id": 2985
                },
                {
                  "text": "合水县",
                  "id": 2986
                },
                {
                  "text": "正宁县",
                  "id": 2987
                },
                {
                  "text": "宁县",
                  "id": 2988
                },
                {
                  "text": "镇原县",
                  "id": 2989
                }
              ]
            },
            {
              "text": "定西市",
              "id": 2990,
              "c": [
                {
                  "text": "安定区",
                  "id": 2991
                },
                {
                  "text": "通渭县",
                  "id": 2992
                },
                {
                  "text": "陇西县",
                  "id": 2993
                },
                {
                  "text": "渭源县",
                  "id": 2994
                },
                {
                  "text": "临洮县",
                  "id": 2995
                },
                {
                  "text": "漳县",
                  "id": 2996
                },
                {
                  "text": "岷县",
                  "id": 2997
                }
              ]
            },
            {
              "text": "陇南市",
              "id": 2998,
              "c": [
                {
                  "text": "武都区",
                  "id": 2999
                },
                {
                  "text": "成县",
                  "id": 3000
                },
                {
                  "text": "文县",
                  "id": 3001
                },
                {
                  "text": "宕昌县",
                  "id": 3002
                },
                {
                  "text": "康县",
                  "id": 3003
                },
                {
                  "text": "西和县",
                  "id": 3004
                },
                {
                  "text": "礼县",
                  "id": 3005
                },
                {
                  "text": "徽县",
                  "id": 3006
                },
                {
                  "text": "两当县",
                  "id": 3007
                }
              ]
            },
            {
              "text": "临夏回族自治州",
              "id": 3008,
              "c": [
                {
                  "text": "临夏市",
                  "id": 3009
                },
                {
                  "text": "临夏县",
                  "id": 3010
                },
                {
                  "text": "康乐县",
                  "id": 3011
                },
                {
                  "text": "永靖县",
                  "id": 3012
                },
                {
                  "text": "广河县",
                  "id": 3013
                },
                {
                  "text": "和政县",
                  "id": 3014
                },
                {
                  "text": "东乡族自治县",
                  "id": 3015
                },
                {
                  "text": "积石山保安族东乡族撒拉族自治县",
                  "id": 3016
                }
              ]
            },
            {
              "text": "甘南藏族自治州",
              "id": 3017,
              "c": [
                {
                  "text": "合作市",
                  "id": 3018
                },
                {
                  "text": "临潭县",
                  "id": 3019
                },
                {
                  "text": "卓尼县",
                  "id": 3020
                },
                {
                  "text": "舟曲县",
                  "id": 3021
                },
                {
                  "text": "迭部县",
                  "id": 3022
                },
                {
                  "text": "玛曲县",
                  "id": 3023
                },
                {
                  "text": "碌曲县",
                  "id": 3024
                },
                {
                  "text": "夏河县",
                  "id": 3025
                }
              ]
            }
          ]
        },
        {
          "text": "青海省",
          "id": 3026,
          "c": [
            {
              "text": "西宁市",
              "id": 3027,
              "c": [
                {
                  "text": "城东区",
                  "id": 3028
                },
                {
                  "text": "城中区",
                  "id": 3029
                },
                {
                  "text": "城西区",
                  "id": 3030
                },
                {
                  "text": "城北区",
                  "id": 3031
                },
                {
                  "text": "大通回族土族自治县",
                  "id": 3032
                },
                {
                  "text": "湟中县",
                  "id": 3033
                },
                {
                  "text": "湟源县",
                  "id": 3034
                }
              ]
            },
            {
              "text": "海东地区",
              "id": 3035,
              "c": [
                {
                  "text": "平安县",
                  "id": 3036
                },
                {
                  "text": "民和回族土族自治县",
                  "id": 3037
                },
                {
                  "text": "乐都县",
                  "id": 3038
                },
                {
                  "text": "互助土族自治县",
                  "id": 3039
                },
                {
                  "text": "化隆回族自治县",
                  "id": 3040
                },
                {
                  "text": "循化撒拉族自治县",
                  "id": 3041
                }
              ]
            },
            {
              "text": "海北藏族自治州",
              "id": 3042,
              "c": [
                {
                  "text": "门源回族自治县",
                  "id": 3043
                },
                {
                  "text": "祁连县",
                  "id": 3044
                },
                {
                  "text": "海晏县",
                  "id": 3045
                },
                {
                  "text": "刚察县",
                  "id": 3046
                }
              ]
            },
            {
              "text": "黄南藏族自治州",
              "id": 3047,
              "c": [
                {
                  "text": "同仁县",
                  "id": 3048
                },
                {
                  "text": "尖扎县",
                  "id": 3049
                },
                {
                  "text": "泽库县",
                  "id": 3050
                },
                {
                  "text": "河南蒙古族自治县",
                  "id": 3051
                }
              ]
            },
            {
              "text": "海南藏族自治州",
              "id": 3052,
              "c": [
                {
                  "text": "共和县",
                  "id": 3053
                },
                {
                  "text": "同德县",
                  "id": 3054
                },
                {
                  "text": "贵德县",
                  "id": 3055
                },
                {
                  "text": "兴海县",
                  "id": 3056
                },
                {
                  "text": "贵南县",
                  "id": 3057
                }
              ]
            },
            {
              "text": "果洛藏族自治州",
              "id": 3058,
              "c": [
                {
                  "text": "玛沁县",
                  "id": 3059
                },
                {
                  "text": "班玛县",
                  "id": 3060
                },
                {
                  "text": "甘德县",
                  "id": 3061
                },
                {
                  "text": "达日县",
                  "id": 3062
                },
                {
                  "text": "久治县",
                  "id": 3063
                },
                {
                  "text": "玛多县",
                  "id": 3064
                }
              ]
            },
            {
              "text": "玉树藏族自治州",
              "id": 3065,
              "c": [
                {
                  "text": "玉树县",
                  "id": 3066
                },
                {
                  "text": "杂多县",
                  "id": 3067
                },
                {
                  "text": "称多县",
                  "id": 3068
                },
                {
                  "text": "治多县",
                  "id": 3069
                },
                {
                  "text": "囊谦县",
                  "id": 3070
                },
                {
                  "text": "曲麻莱县",
                  "id": 3071
                }
              ]
            },
            {
              "text": "海西蒙古族藏族自治州",
              "id": 3072,
              "c": [
                {
                  "text": "格尔木市",
                  "id": 3073
                },
                {
                  "text": "德令哈市",
                  "id": 3074
                },
                {
                  "text": "乌兰县",
                  "id": 3075
                },
                {
                  "text": "都兰县",
                  "id": 3076
                },
                {
                  "text": "天峻县",
                  "id": 3077
                }
              ]
            }
          ]
        },
        {
          "text": "宁夏回族自治区",
          "id": 3078,
          "c": [
            {
              "text": "银川市",
              "id": 3079,
              "c": [
                {
                  "text": "兴庆区",
                  "id": 3080
                },
                {
                  "text": "西夏区",
                  "id": 3081
                },
                {
                  "text": "金凤区",
                  "id": 3082
                },
                {
                  "text": "永宁县",
                  "id": 3083
                },
                {
                  "text": "贺兰县",
                  "id": 3084
                },
                {
                  "text": "灵武市",
                  "id": 3085
                }
              ]
            },
            {
              "text": "石嘴山市",
              "id": 3086,
              "c": [
                {
                  "text": "大武口区",
                  "id": 3087
                },
                {
                  "text": "惠农区",
                  "id": 3088
                },
                {
                  "text": "平罗县",
                  "id": 3089
                }
              ]
            },
            {
              "text": "吴忠市",
              "id": 3090,
              "c": [
                {
                  "text": "利通区",
                  "id": 3091
                },
                {
                  "text": "红寺堡区",
                  "id": 3092
                },
                {
                  "text": "盐池县",
                  "id": 3093
                },
                {
                  "text": "同心县",
                  "id": 3094
                },
                {
                  "text": "青铜峡市",
                  "id": 3095
                }
              ]
            },
            {
              "text": "固原市",
              "id": 3096,
              "c": [
                {
                  "text": "原州区",
                  "id": 3097
                },
                {
                  "text": "西吉县",
                  "id": 3098
                },
                {
                  "text": "隆德县",
                  "id": 3099
                },
                {
                  "text": "泾源县",
                  "id": 3100
                },
                {
                  "text": "彭阳县",
                  "id": 3101
                }
              ]
            },
            {
              "text": "中卫市",
              "id": 3102,
              "c": [
                {
                  "text": "沙坡头区",
                  "id": 3103
                },
                {
                  "text": "中宁县",
                  "id": 3104
                },
                {
                  "text": "海原县",
                  "id": 3105
                }
              ]
            }
          ]
        },
        {
          "text": "新疆维吾尔自治区",
          "id": 3106,
          "c": [
            {
              "text": "乌鲁木齐市",
              "id": 3107,
              "c": [
                {
                  "text": "天山区",
                  "id": 3108
                },
                {
                  "text": "沙依巴克区",
                  "id": 3109
                },
                {
                  "text": "新市区",
                  "id": 3110
                },
                {
                  "text": "水磨沟区",
                  "id": 3111
                },
                {
                  "text": "头屯河区",
                  "id": 3112
                },
                {
                  "text": "达坂城区",
                  "id": 3113
                },
                {
                  "text": "米东区",
                  "id": 3114
                },
                {
                  "text": "乌鲁木齐县",
                  "id": 3115
                }
              ]
            },
            {
              "text": "克拉玛依市",
              "id": 3116,
              "c": [
                {
                  "text": "独山子区",
                  "id": 3117
                },
                {
                  "text": "克拉玛依区",
                  "id": 3118
                },
                {
                  "text": "白碱滩区",
                  "id": 3119
                },
                {
                  "text": "乌尔禾区",
                  "id": 3120
                }
              ]
            },
            {
              "text": "吐鲁番地区",
              "id": 3121,
              "c": [
                {
                  "text": "吐鲁番市",
                  "id": 3122
                },
                {
                  "text": "鄯善县",
                  "id": 3123
                },
                {
                  "text": "托克逊县",
                  "id": 3124
                }
              ]
            },
            {
              "text": "哈密地区",
              "id": 3125,
              "c": [
                {
                  "text": "哈密市",
                  "id": 3126
                },
                {
                  "text": "巴里坤哈萨克自治县",
                  "id": 3127
                },
                {
                  "text": "伊吾县",
                  "id": 3128
                }
              ]
            },
            {
              "text": "昌吉回族自治州",
              "id": 3129,
              "c": [
                {
                  "text": "昌吉市",
                  "id": 3130
                },
                {
                  "text": "阜康市",
                  "id": 3131
                },
                {
                  "text": "呼图壁县",
                  "id": 3132
                },
                {
                  "text": "玛纳斯县",
                  "id": 3133
                },
                {
                  "text": "奇台县",
                  "id": 3134
                },
                {
                  "text": "吉木萨尔县",
                  "id": 3135
                },
                {
                  "text": "木垒哈萨克自治县",
                  "id": 3136
                }
              ]
            },
            {
              "text": "博尔塔拉蒙古自治州",
              "id": 3137,
              "c": [
                {
                  "text": "博乐市",
                  "id": 3138
                },
                {
                  "text": "精河县",
                  "id": 3139
                },
                {
                  "text": "温泉县",
                  "id": 3140
                }
              ]
            },
            {
              "text": "巴音郭楞蒙古自治州",
              "id": 3141,
              "c": [
                {
                  "text": "库尔勒市",
                  "id": 3142
                },
                {
                  "text": "轮台县",
                  "id": 3143
                },
                {
                  "text": "尉犁县",
                  "id": 3144
                },
                {
                  "text": "若羌县",
                  "id": 3145
                },
                {
                  "text": "且末县",
                  "id": 3146
                },
                {
                  "text": "焉耆回族自治县",
                  "id": 3147
                },
                {
                  "text": "和静县",
                  "id": 3148
                },
                {
                  "text": "和硕县",
                  "id": 3149
                },
                {
                  "text": "博湖县",
                  "id": 3150
                }
              ]
            },
            {
              "text": "阿克苏地区",
              "id": 3151,
              "c": [
                {
                  "text": "阿克苏市",
                  "id": 3152
                },
                {
                  "text": "温宿县",
                  "id": 3153
                },
                {
                  "text": "库车县",
                  "id": 3154
                },
                {
                  "text": "沙雅县",
                  "id": 3155
                },
                {
                  "text": "新和县",
                  "id": 3156
                },
                {
                  "text": "拜城县",
                  "id": 3157
                },
                {
                  "text": "乌什县",
                  "id": 3158
                },
                {
                  "text": "阿瓦提县",
                  "id": 3159
                },
                {
                  "text": "柯坪县",
                  "id": 3160
                }
              ]
            },
            {
              "text": "克孜勒苏柯尔克孜自治州",
              "id": 3161,
              "c": [
                {
                  "text": "阿图什市",
                  "id": 3162
                },
                {
                  "text": "阿克陶县",
                  "id": 3163
                },
                {
                  "text": "阿合奇县",
                  "id": 3164
                },
                {
                  "text": "乌恰县",
                  "id": 3165
                }
              ]
            },
            {
              "text": "喀什地区",
              "id": 3166,
              "c": [
                {
                  "text": "喀什市",
                  "id": 3167
                },
                {
                  "text": "疏附县",
                  "id": 3168
                },
                {
                  "text": "疏勒县",
                  "id": 3169
                },
                {
                  "text": "英吉沙县",
                  "id": 3170
                },
                {
                  "text": "泽普县",
                  "id": 3171
                },
                {
                  "text": "莎车县",
                  "id": 3172
                },
                {
                  "text": "叶城县",
                  "id": 3173
                },
                {
                  "text": "麦盖提县",
                  "id": 3174
                },
                {
                  "text": "岳普湖县",
                  "id": 3175
                },
                {
                  "text": "伽师县",
                  "id": 3176
                },
                {
                  "text": "巴楚县",
                  "id": 3177
                },
                {
                  "text": "塔什库尔干塔吉克自治县",
                  "id": 3178
                }
              ]
            },
            {
              "text": "和田地区",
              "id": 3179,
              "c": [
                {
                  "text": "和田市",
                  "id": 3180
                },
                {
                  "text": "和田县",
                  "id": 3181
                },
                {
                  "text": "墨玉县",
                  "id": 3182
                },
                {
                  "text": "皮山县",
                  "id": 3183
                },
                {
                  "text": "洛浦县",
                  "id": 3184
                },
                {
                  "text": "策勒县",
                  "id": 3185
                },
                {
                  "text": "于田县",
                  "id": 3186
                },
                {
                  "text": "民丰县",
                  "id": 3187
                }
              ]
            },
            {
              "text": "伊犁哈萨克自治州",
              "id": 3188,
              "c": [
                {
                  "text": "伊宁市",
                  "id": 3189
                },
                {
                  "text": "奎屯市",
                  "id": 3190
                },
                {
                  "text": "伊宁县",
                  "id": 3191
                },
                {
                  "text": "察布查尔锡伯自治县",
                  "id": 3192
                },
                {
                  "text": "霍城县",
                  "id": 3193
                },
                {
                  "text": "巩留县",
                  "id": 3194
                },
                {
                  "text": "新源县",
                  "id": 3195
                },
                {
                  "text": "昭苏县",
                  "id": 3196
                },
                {
                  "text": "特克斯县",
                  "id": 3197
                },
                {
                  "text": "尼勒克县",
                  "id": 3198
                }
              ]
            },
            {
              "text": "塔城地区",
              "id": 3199,
              "c": [
                {
                  "text": "塔城市",
                  "id": 3200
                },
                {
                  "text": "乌苏市",
                  "id": 3201
                },
                {
                  "text": "额敏县",
                  "id": 3202
                },
                {
                  "text": "沙湾县",
                  "id": 3203
                },
                {
                  "text": "托里县",
                  "id": 3204
                },
                {
                  "text": "裕民县",
                  "id": 3205
                },
                {
                  "text": "和布克赛尔蒙古自治县",
                  "id": 3206
                }
              ]
            },
            {
              "text": "阿勒泰地区",
              "id": 3207,
              "c": [
                {
                  "text": "阿勒泰市",
                  "id": 3208
                },
                {
                  "text": "布尔津县",
                  "id": 3209
                },
                {
                  "text": "富蕴县",
                  "id": 3210
                },
                {
                  "text": "福海县",
                  "id": 3211
                },
                {
                  "text": "哈巴河县",
                  "id": 3212
                },
                {
                  "text": "青河县",
                  "id": 3213
                },
                {
                  "text": "吉木乃县",
                  "id": 3214
                }
              ]
            },
            {
              "text": "石河子市",
              "id": 3215,
              "c": []
            },
            {
              "text": "阿拉尔市",
              "id": 3216,
              "c": []
            },
            {
              "text": "图木舒克市",
              "id": 3217,
              "c": []
            },
            {
              "text": "五家渠市",
              "id": 3218,
              "c": []
            }
          ]
        },
        {
          "text": "台湾省",
          "id": 3219,
          "c": [
            {
              "text": "台北市",
              "id": 3220,
              "c": [
                {
                  "text": "中正区",
                  "id": 3241
                },
                {
                  "text": "大同区",
                  "id": 3242
                },
                {
                  "text": "中山区",
                  "id": 3243
                },
                {
                  "text": "松山区",
                  "id": 3244
                },
                {
                  "text": "大安区",
                  "id": 3245
                },
                {
                  "text": "万华区",
                  "id": 3246
                },
                {
                  "text": "信义区",
                  "id": 3247
                },
                {
                  "text": "士林区",
                  "id": 3248
                },
                {
                  "text": "北投区",
                  "id": 3249
                },
                {
                  "text": "内湖区",
                  "id": 3250
                },
                {
                  "text": "南港区",
                  "id": 3251
                },
                {
                  "text": "文山区",
                  "id": 3252
                }
              ]
            },
            {
              "text": "高雄市",
              "id": 3221,
              "c": [
                {
                  "text": "新兴区",
                  "id": 3255
                },
                {
                  "text": "前金区",
                  "id": 3256
                },
                {
                  "text": "芩雅区",
                  "id": 3257
                },
                {
                  "text": "盐埕区",
                  "id": 3258
                },
                {
                  "text": "鼓山区",
                  "id": 3259
                },
                {
                  "text": "旗津区",
                  "id": 3260
                },
                {
                  "text": "前镇区",
                  "id": 3261
                },
                {
                  "text": "三民区",
                  "id": 3262
                },
                {
                  "text": "左营区",
                  "id": 3263
                },
                {
                  "text": "楠梓区",
                  "id": 3264
                },
                {
                  "text": "小港区",
                  "id": 3265
                }
              ]
            },
            {
              "text": "台南市",
              "id": 3222,
              "c": [
                {
                  "text": "中西区",
                  "id": 3273
                },
                {
                  "text": "东区",
                  "id": 3274
                },
                {
                  "text": "南区",
                  "id": 3275
                },
                {
                  "text": "北区",
                  "id": 3276
                },
                {
                  "text": "安平区",
                  "id": 3277
                },
                {
                  "text": "安南区",
                  "id": 3278
                }
              ]
            },
            {
              "text": "台中市",
              "id": 3223,
              "c": [
                {
                  "text": "中区",
                  "id": 3282
                },
                {
                  "text": "东区",
                  "id": 3283
                },
                {
                  "text": "南区",
                  "id": 3284
                },
                {
                  "text": "西区",
                  "id": 3285
                },
                {
                  "text": "北区",
                  "id": 3286
                },
                {
                  "text": "北屯区",
                  "id": 3287
                },
                {
                  "text": "西屯区",
                  "id": 3288
                },
                {
                  "text": "南屯区",
                  "id": 3289
                }
              ]
            },
            {
              "text": "金门县",
              "id": 3224,
              "c": []
            },
            {
              "text": "南投县",
              "id": 3225,
              "c": []
            },
            {
              "text": "基隆市",
              "id": 3226,
              "c": [
                {
                  "text": "仁爱区",
                  "id": 3266
                },
                {
                  "text": "信义区",
                  "id": 3267
                },
                {
                  "text": "中正区",
                  "id": 3268
                },
                {
                  "text": "中山区",
                  "id": 3269
                },
                {
                  "text": "安乐区",
                  "id": 3270
                },
                {
                  "text": "暖暖区",
                  "id": 3271
                },
                {
                  "text": "七堵区",
                  "id": 3272
                }
              ]
            },
            {
              "text": "新竹市",
              "id": 3227,
              "c": [
                {
                  "text": "东区",
                  "id": 3279
                },
                {
                  "text": "北区",
                  "id": 3280
                },
                {
                  "text": "香山区",
                  "id": 3281
                }
              ]
            },
            {
              "text": "嘉义市",
              "id": 3228,
              "c": [
                {
                  "text": "东区",
                  "id": 3290
                },
                {
                  "text": "西区",
                  "id": 3291
                }
              ]
            },
            {
              "text": "新北市",
              "id": 3229,
              "c": []
            },
            {
              "text": "宜兰县",
              "id": 3230,
              "c": []
            },
            {
              "text": "新竹县",
              "id": 3231,
              "c": []
            },
            {
              "text": "桃园县",
              "id": 3232,
              "c": []
            },
            {
              "text": "苗栗县",
              "id": 3233,
              "c": []
            },
            {
              "text": "彰化县",
              "id": 3234,
              "c": []
            },
            {
              "text": "嘉义县",
              "id": 3235,
              "c": [
                {
                  "text": "东区",
                  "id": 3253
                },
                {
                  "text": "西区",
                  "id": 3254
                }
              ]
            },
            {
              "text": "云林县",
              "id": 3236,
              "c": []
            },
            {
              "text": "屏东县",
              "id": 3237,
              "c": []
            },
            {
              "text": "台东县",
              "id": 3238,
              "c": []
            },
            {
              "text": "花莲县",
              "id": 3239,
              "c": []
            },
            {
              "text": "澎湖县",
              "id": 3240,
              "c": []
            }
          ]
        },
        {
          "text": "香港特别行政区",
          "id": 3292,
          "c": [
            {
              "text": "香港岛",
              "id": 3293,
              "c": [
                {
                  "text": "中西区",
                  "id": 3301
                },
                {
                  "text": "湾仔",
                  "id": 3302
                },
                {
                  "text": "东区",
                  "id": 3303
                },
                {
                  "text": "南区",
                  "id": 3304
                }
              ]
            },
            {
              "text": "九龙",
              "id": 3294,
              "c": [
                {
                  "text": "九龙城区",
                  "id": 3296
                },
                {
                  "text": "油尖旺区",
                  "id": 3297
                },
                {
                  "text": "深水埗区",
                  "id": 3298
                },
                {
                  "text": "黄大仙区",
                  "id": 3299
                },
                {
                  "text": "观塘区",
                  "id": 3300
                }
              ]
            },
            {
              "text": "新界",
              "id": 3295,
              "c": [
                {
                  "text": "北区",
                  "id": 3305
                },
                {
                  "text": "大埔区",
                  "id": 3306
                },
                {
                  "text": "沙田区",
                  "id": 3307
                },
                {
                  "text": "西贡区",
                  "id": 3308
                },
                {
                  "text": "元朗区",
                  "id": 3309
                },
                {
                  "text": "屯门区",
                  "id": 3310
                },
                {
                  "text": "荃湾区",
                  "id": 3311
                },
                {
                  "text": "葵青区",
                  "id": 3312
                },
                {
                  "text": "离岛区",
                  "id": 3313
                }
              ]
            }
          ]
        },
        {
          "text": "澳门特别行政区",
          "id": 3314,
          "c": [
            {
              "text": "澳门半岛",
              "id": 3315,
              "c": []
            },
            {
              "text": "离岛",
              "id": 3316,
              "c": []
            }
          ]
        }
      ];

});